[{"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的小圆形，一个黑色的大圆形，一个蓝色的大正方形，一个黄色的小圆形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的大正方形，一个黄色的中等三角形。在右边的盒子里，有一个黑色的大圆形，一个蓝色的大圆形，一个黑色的中等三角形，一个黑色的中等三角形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "large", "left"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个蓝色的中等正方形，一个蓝色的小圆形，一个蓝色的中等三角形，一个黄色的中等圆形，一个黄色的大正方形。在中间的盒子里，有一个黄色的小圆形，一个蓝色的中等正方形，一个黑色的小三角形，一个黑色的小正方形，一个黄色的小三角形，一个黑色的大圆形。在右边的盒子里，有一个黄色的小正方形，一个黄色的小三角形，一个黑色的中等三角形，一个黄色的大圆形，一个蓝色的中等正方形，一个黄色的大正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "middle"], ["black", "square", "small", "middle"], ["black", "round", "large", "middle"]]}, {"data": "你好，有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个黑色的中间正方形，一个蓝色的小正方形，一个蓝色的中间正方形。在中间的盒子里，有一个蓝色的大正方形，一个蓝色的中间正方形，一个黑色的中间正方形，一个黑色的大三角形，一个蓝色的中间圆形，一个黄色的小正方形。在右边的盒子里，有一个蓝色的大圆形，一个黄色的小三角形，一个蓝色的大三角形。请问如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个蓝色的小三角形，一个黄色的小圆形，一个蓝色的大正方形。中间的盒子里有一个黄色的小三角形，一个黄色的中等大小的圆形，一个黑色的小圆形。右边的盒子里有一个黄色的小三角形，一个黄色的大圆形，一个黑色的小正方形，一个黄色的大三角形，一个蓝色的中等大小的正方形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "middle", "left"], ["blue", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的小正方形、一个蓝色的小正方形、一个黄色的小三角形和一个黄色的中等大小的正方形。中间的盒子里有一个黄色的大正方形、一个蓝色的中等大小的三角形和一个黑色的大圆形。右边的盒子里有一个蓝色的大正方形、一个黑色的大三角形和一个黑色的中等大小的三角形。如何将所有黑色物品移到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "middle", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个蓝色的小正方形，一个黄色的中等三角形。在中间的盒子里，有一个蓝色的大圆形，一个黑色的小正方形，一个黄色的大正方形，一个蓝色的小正方形，一个蓝色的中等三角形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的大正方形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "middle", "left"], ["blue", "square", "small", "left"], ["black", "square", "small", "middle"], ["yellow", "square", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形、一个黄色的小圆形、一个蓝色的中等正方形和一个黑色的中等三角形。中间的盒子里有一个黄色的中等三角形、一个黄色的小三角形和一个黑色的中等正方形。右边的盒子里有一个蓝色的大三角形、一个黄色的大圆形、一个黑色的大正方形和一个蓝色的小圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个蓝色的小三角形和一个蓝色的小正方形。中间的盒子里有一个蓝色的大圆形、一个黑色的中等三角形、一个黑色的大正方形、一个黄色的小三角形、一个黄色的中等圆形和一个黑色的大三角形。右边的盒子里有一个黄色的中等圆形、一个黄色的中等正方形、一个蓝色的中等圆形和一个黑色的小圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "left"], ["blue", "triangle", "small", "left"], ["blue", "square", "small", "left"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的小正方形，一个蓝色的中等正方形，一个蓝色的大圆形，一个黑色的中等正方形。在中间的盒子里，有一个黑色的中等正方形，一个黑色的小圆形，一个黄色的中等圆形，一个黑色的小圆形，一个黄色的大圆形，一个蓝色的小正方形。在右边的盒子里，有一个蓝色的小圆形，一个黑色的中等圆形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "large", "left"], ["yellow", "square", "small", "left"], ["blue", "square", "middle", "left"], ["black", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个大黄色圆形，一个大蓝色圆形，一个大蓝色圆形，一个大蓝色三角形，一个小黄色圆形。在中间的盒子里，有一个中等大小的黄色正方形，一个小黑色三角形，一个中等大小的蓝色三角形，一个大蓝色圆形，一个小黑色圆形。在右边的盒子里，有一个中等大小的黄色正方形，一个大黄色正方形，一个大黄色三角形，一个小黑色圆形，一个小蓝色正方形，一个中等大小的黑色正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "large", "right"], ["black", "triangle", "small", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形和一个蓝色的中等正方形。中间的盒子里有一个黄色的中等三角形、一个黄色的大圆形、一个黑色的中等圆形和两个蓝色的中等正方形。右边的盒子里有两个黄色的小圆形和一个黑色的中等正方形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "middle", "left"], ["blue", "square", "middle", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黑色的大圆形、一个黑色的大正方形、一个黄色的中等圆形、一个黑色的小圆形、一个黄色的小三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的小圆形。右边的盒子里有一个黑色的小三角形、一个蓝色的小圆形、一个蓝色的大正方形、一个黄色的小三角形、一个黑色的小正方形。如何将所有的正方形移到中间的盒子里？", "label": [["black", "square", "large", "left"], ["blue", "square", "large", "right"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个黄色的小圆形，一个黄色的小圆形，一个黄色的大正方形。中间的盒子里有一个黑色的中等三角形，一个黑色的大圆形，一个黑色的大正方形，一个黑色的大三角形。右边的盒子里有一个蓝色的小正方形，一个黑色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形、一个黄色的中间三角形、一个黄色的大正方形、一个黄色的大三角形。中间的盒子里有一个蓝色的中间圆形、一个蓝色的小圆形、一个黑色的小三角形。右边的盒子里有一个黑色的小正方形、一个蓝色的中间正方形、一个黑色的大三角形、一个黄色的大三角形、一个黑色的中间正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "middle", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黄色的小正方形、一个黑色的小正方形、一个黑色的中等三角形、一个黑色的小三角形和一个黄色的中等三角形。中间的盒子里有一个黄色的小圆形、一个黑色的小圆形、一个蓝色的大正方形、一个黄色的大圆形和一个黄色的大正方形。右边的盒子里有一个黄色的小圆形、一个蓝色的大正方形、一个黄色的小圆形、一个黑色的中等圆形、一个蓝色的小正方形和一个蓝色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["yellow", "round", "small", "right"], ["black", "round", "middle", "right"], ["yellow", "round", "small", "middle"], ["black", "round", "small", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个黄色的小正方形和一个黄色的中等圆形。中间的盒子里有一个黑色的中等三角形、一个蓝色的中等圆形和一个黄色的小三角形。右边的盒子里有一个黑色的中等正方形、一个蓝色的小圆形和一个中等的黑色正方形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的大三角形，两个黄色的中等三角形和一个黄色的大正方形。在中间的盒子里，有一个黑色的小圆形和一个蓝色的中等三角形。在右边的盒子里，有一个黑色的大正方形，一个黑色的小三角形和一个黑色的小正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个黄色的大三角形，一个黄色的小正方形，一个黄色的大三角形，一个蓝色的大三角形。在中间的盒子里，有一个黄色的中间正方形，一个蓝色的小圆形，一个黄色的小正方形。在右边的盒子里，有一个黄色的中间正方形，一个蓝色的中间三角形，一个黄色的大正方形，一个黄色的大正方形，一个黄色的大正方形，一个黄色的小正方形。如何将所有蓝色物品移动到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个蓝色的中等正方形。中间的盒子里有一个黑色的小三角形和一个蓝色的大三角形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的大圆形和一个黑色的大三角形。如何将所有三角形移动到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "small", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个蓝色的中等三角形、一个蓝色的大圆形、一个黑色的小正方形、一个黄色的大正方形、一个蓝色的小正方形。在中间的盒子里，有一个黑色的中等正方形、一个黑色的小圆形、一个蓝色的大正方形、一个黄色的大正方形、一个黑色的中等三角形、一个黄色的小三角形。在右边的盒子里，有一个黄色的中等正方形、一个蓝色的中等圆形、一个蓝色的大三角形、一个黑色的大正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "small", "left"], ["yellow", "square", "large", "left"], ["blue", "square", "small", "left"], ["black", "square", "middle", "middle"], ["blue", "square", "large", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的小圆形，一个黄色的大圆形，一个黄色的中等大小的正方形，一个黄色的大三角形。在中间的盒子里，有一个黄色的大三角形，一个蓝色的大三角形，一个蓝色的小正方形，一个黄色的小三角形，一个黑色的小三角形，一个黄色的中等大小的正方形。在右边的盒子里，有一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的小三角形，一个黑色的大圆形，一个蓝色的小正方形，一个黄色的小三角形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["yellow", "round", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形、一个黑色的大正方形、一个黑色的小正方形、一个黑色的小圆形、一个黑色的中等大小的正方形和一个蓝色的中等大小的圆形。在中间的盒子里，有一个黑色的中等大小的正方形和一个黄色的小正方形。在右边的盒子里，有一个黑色的中等大小的三角形、一个黄色的中等大小的正方形、一个黄色的大圆形、一个黄色的大三角形和一个黑色的大圆形。如何将所有黄色物品移动到中间的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "square", "middle", "right"], ["yellow", "round", "large", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑三角形和一个小黑三角形。中间的盒子里有一个小蓝三角形、一个小蓝正方形和一个大黄圆形。右边的盒子里有一个中等大小的黄三角形、一个大蓝三角形、一个小黄正方形、一个中等大小的黑三角形和一个小蓝圆形。如何将所有三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "small", "left"], ["yellow", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黄色的小三角形，一个蓝色的小圆形，一个黑色的小正方形，一个黑色的小三角形，一个蓝色的小正方形。在中间的盒子里，有一个蓝色的中等三角形，一个黑色的小圆形。在右边的盒子里，有一个黄色的中等正方形，一个黑色的小正方形，一个蓝色的大正方形，一个黄色的大三角形，一个蓝色的大圆形。如何将所有黄色物品移动到左边的盒子中？请将以上文本翻译成中文。", "label": [["yellow", "square", "middle", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的中圆形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的小正方形，一个黑色的小三角形，一个黑色的中圆形，一个黑色的中正方形，一个蓝色的小三角形，一个蓝色的大三角形。在右边的盒子里，有一个黄色的中正方形，一个蓝色的中正方形，一个黄色的小三角形，一个蓝色的小圆形，一个蓝色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "small", "right"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的中等三角形、一个蓝色的小三角形和一个黄色的大正方形。中间的盒子里有一个蓝色的大圆形、一个蓝色的中等圆形、一个蓝色的小正方形、一个黄色的大正方形、一个黑色的中等圆形和一个蓝色的小圆形。右边的盒子里有一个黑色的大圆形和一个黄色的小三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "large", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的小圆形，一个黄色的中等三角形，一个黑色的中等圆形。在中间的盒子里，有一个蓝色的中等三角形，一个蓝色的小正方形，一个黑色的大三角形，一个黑色的小正方形，一个黄色的大正方形。在右边的盒子里，有一个黄色的小正方形，一个黑色的大圆形，一个黄色的小圆形，两个黄色的大圆形，一个黑色的大三角形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["yellow", "triangle", "middle", "left"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形和一个黑色的小三角形。中间的盒子里有一个黑色的小圆形、一个蓝色的中等三角形和一个蓝色的大三角形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的小三角形、一个蓝色的大三角形、一个黄色的中等三角形、一个黄色的小正方形和一个黑色的大三角形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "round", "middle", "right"], ["blue", "triangle", "small", "right"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个蓝色的大三角形和一个黄色的小三角形。中间的盒子里有一个蓝色的小圆形、一个蓝色的小正方形、一个黄色的大三角形和一个蓝色的中等正方形。右边的盒子里有一个黄色的大三角形和一个黑色的大正方形。如何将所有正方形移到右边的盒子中？", "label": [["blue", "square", "small", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黄色的大正方形，一个黑色的大三角形，一个黑色的大三角形，一个黄色的小三角形。在中间的盒子里，有一个黄色的中等正方形，一个黑色的小正方形，一个黄色的大正方形。在右边的盒子里，有一个黑色的小圆形，一个黑色的中等三角形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "middle", "middle"], ["black", "square", "small", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个大黑色圆形，一个大黑色正方形，一个大黑色圆形，一个黄色中等圆形，一个小黑色三角形。在中间的盒子里，有一个黄色小正方形，一个黑色中等三角形，一个蓝色小三角形，一个蓝色中等三角形，一个黄色小三角形。在右边的盒子里，有一个黄色中等三角形，一个黄色中等圆形，一个蓝色小三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的中圆形，一个蓝色的大圆形，一个黑色的大三角形，一个蓝色的中三角形，一个黄色的大圆形。在中间的盒子里，有一个黄色的中圆形，一个蓝色的小圆形，一个黑色的小正方形，一个蓝色的大正方形，一个蓝色的大三角形，一个黑色的中圆形。在右边的盒子里，有一个蓝色的小圆形，一个黄色的小圆形，一个黑色的大正方形，一个蓝色的小三角形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "small", "right"], ["yellow", "round", "small", "right"], ["yellow", "round", "middle", "middle"], ["blue", "round", "small", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的中等正方形，一个黑色的大正方形，一个蓝色的小圆形，一个黄色的中等三角形，一个蓝色的中等圆形。在中间的盒子里，有一个黄色的大三角形，一个蓝色的小三角形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的大三角形，一个黄色的大正方形，一个蓝色的中等正方形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黄色的大正方形、一个蓝色的小正方形和一个蓝色的小三角形。中间的盒子里有一个黑色的小三角形、一个蓝色的小三角形和一个黄色的中等大小的正方形。右边的盒子里有一个黑色的大三角形、一个黑色的小正方形、一个黄色的小三角形、一个黄色的中等大小的圆形、一个黄色的中等大小的正方形和一个黑色的中等大小的三角形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "small", "left"], ["blue", "triangle", "small", "left"], ["black", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形，一个蓝色的大正方形，一个蓝色的小圆形，一个蓝色的中等圆形，一个黄色的小正方形。在中间的盒子里，有一个黄色的中等三角形，一个黄色的中等三角形，一个黄色的小圆形，一个黑色的小圆形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的中等三角形，一个黄色的小正方形，一个蓝色的中等三角形，一个黄色的大三角形，一个蓝色的小圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["blue", "round", "small", "left"], ["blue", "round", "middle", "left"], ["yellow", "round", "small", "middle"], ["black", "round", "small", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形、一个大黑色圆形和一个大黑色圆形。中间的盒子里有一个蓝色的大圆形、一个蓝色的中等大小的正方形、一个蓝色的大三角形、一个黄色的小三角形、一个蓝色的大正方形和一个黑色的大三角形。右边的盒子里有一个蓝色的中等大小的圆形、一个蓝色的小三角形和一个黄色的大三角形。如何将所有的正方形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的大正方形，一个蓝色的大圆形，一个黑色的大圆形，一个黄色的中等三角形，一个黑色的小正方形。在中间的盒子里，有一个蓝色的小三角形，一个黄色的中等圆形，一个黑色的大三角形，一个蓝色的中等三角形，一个蓝色的大圆形，一个黑色的大圆形。在右边的盒子里，有一个黑色的小三角形，一个黑色的大正方形，一个蓝色的中等圆形，一个黑色的中等三角形，一个黑色的大正方形。如何将所有黑色物体移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["black", "round", "large", "left"], ["black", "square", "small", "left"], ["black", "triangle", "small", "right"], ["black", "square", "large", "right"], ["black", "triangle", "middle", "right"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的小正方形，一个蓝色的小正方形，一个蓝色的小正方形，一个黄色的小正方形，一个黑色的小正方形。在中间的盒子里，有一个蓝色的中等三角形，一个黑色的中等三角形，一个蓝色的小圆形。在右边的盒子里，有一个黄色的大正方形，一个黄色的大正方形，一个蓝色的大圆形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、两个黄色的小正方形、一个蓝色的大号圆形和一个黄色的大号正方形。中间的盒子里有一个黄色的小三角形、一个黑色的小号圆形和一个蓝色的中号正方形。右边的盒子里有一个蓝色的小号正方形、一个黑色的大号正方形、两个黑色的小号圆形和一个黄色的中号三角形和一个黄色的小号正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的小圆形，一个黄色的小三角形，一个黑色的大三角形，一个黑色的小三角形。在中间的盒子里，有一个黑色的中等大小的正方形，一个黑色的大正方形。在右边的盒子里，有一个黄色的中等大小的三角形，一个蓝色的中等大小的圆形，两个黄色的小三角形，一个黄色的大正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "small", "left"], ["black", "triangle", "large", "left"], ["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个蓝色小三角形和一个蓝色大三角形。中间的盒子里有一个黑色大正方形、一个蓝色中等三角形、一个黑色小三角形和一个蓝色大三角形。右边的盒子里有一个黄色大圆形、一个蓝色大圆形和一个蓝色小三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等圆形，一个蓝色的小三角形，一个黑色的小正方形，一个黑色的小圆形，一个黑色的小圆形，一个黄色的大正方形。在中间的盒子里，有一个黑色的大正方形，一个黄色的小圆形，一个蓝色的小三角形，一个蓝色的中等圆形。在右边的盒子里，有一个蓝色的小正方形，一个蓝色的大正方形，一个黄色的大三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "large", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个黑色的大正方形，一个蓝色的大正方形，一个蓝色的大三角形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的小三角形，一个黑色的小正方形，一个蓝色的中等正方形。在右边的盒子里，有一个蓝色的大圆形，一个黄色的大圆形，一个黑色的小正方形，一个黑色的中等正方形，一个黑色的中等正方形，一个黄色的中等三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "large", "right"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "small", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形和一个黑色的小三角形。中间的盒子里有一个黄色的大正方形、一个黄色的小圆形和一个蓝色的中等大小的正方形。右边的盒子里有一个蓝色的中等大小的三角形、一个黄色的大三角形和一个黑色的大圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "triangle", "middle", "right"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个中黑三角形，一个黄色小正方形，一个蓝色小正方形，一个黄色大三角形。在中间的盒子里，有一个黑色大三角形，一个蓝色大三角形，一个黑色大三角形。在右边的盒子里，有一个中黑三角形，一个中黑三角形，一个黄色小圆形，一个蓝色中圆形，一个黄色中正方形，一个中黑三角形。如何将所有三角形移动到左边的盒子里？", "label": [["black", "triangle", "middle", "right"], ["black", "triangle", "middle", "right"], ["black", "triangle", "middle", "right"], ["black", "triangle", "large", "middle"], ["blue", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的大三角形，一个黄色的大圆形，一个黄色的中等圆形，一个黄色的中等圆形，一个黑色的小正方形。在中间的盒子里，有一个黄色的小三角形，一个黄色的大正方形，一个黑色的中等三角形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的中等三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个蓝色的小圆形。中间的盒子里有一个蓝色的大正方形、一个黑色的大圆形、一个蓝色的小圆形和一个黄色的中等三角形。右边的盒子里有一个黑色的小圆形、一个黑色的大圆形和一个黄色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "right"], ["black", "round", "large", "right"], ["yellow", "round", "small", "right"], ["black", "round", "large", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个黑色的中等圆形、一个黄色的大圆形、一个黑色的大圆形、一个黄色的小三角形、一个蓝色的大三角形。中间的盒子里有一个黄色的大正方形、一个蓝色的小正方形。右边的盒子里有一个黄色的中等圆形、一个蓝色的大圆形、一个蓝色的大正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "large", "left"], ["yellow", "triangle", "small", "left"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的大三角形、一个黑色的大三角形、一个蓝色的小正方形、一个黄色的中等圆形和一个黑色的中等正方形。中间的盒子里有一个蓝色的中等三角形、一个蓝色的大圆形、一个黑色的大圆形和一个蓝色的小圆形。右边的盒子里有一个黑色的小圆形、一个蓝色的小正方形和一个蓝色的大三角形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "middle", "left"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形和一个黑色的大正方形。在中间的盒子里，有一个蓝色的大三角形、一个黑色的大三角形和一个黄色的中等圆形。在右边的盒子里，有一个蓝色的小圆形、一个蓝色的大正方形、一个蓝色的中等三角形、一个黑色的中等正方形、一个蓝色的中等正方形和一个蓝色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形和一个黑色的中等正方形。在中间的盒子里，有一个黄色的大三角形、一个黄色的小三角形、一个黑色的中等正方形、一个蓝色的大三角形、一个黑色的小正方形和一个黄色的小三角形。在右边的盒子里，有一个黑色的小正方形、一个黑色的小正方形、一个黑色的大正方形、一个黑色的中等圆形、一个黑色的中等正方形和一个蓝色的小正方形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个蓝色的中等三角形，一个黄色的中等正方形，一个蓝色的中等正方形。在中间的盒子里，有一个黑色的小三角形，一个黄色的中等三角形，一个黄色的大三角形。在右边的盒子里，有一个蓝色的中等圆形，一个蓝色的小圆形，一个黄色的大三角形，一个蓝色的中等三角形。如何将所有黑色物体移动到中间的盒子？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的中等三角形，一个黑色的小三角形，一个蓝色的小圆形，一个黄色的中等三角形，一个黄色的中等圆形。在中间的盒子里，有一个蓝色的大正方形，一个黑色的大正方形，一个蓝色的中等正方形，一个黑色的大圆形，一个黑色的大正方形。在右边的盒子里，有一个黑色的中等正方形，一个蓝色的小三角形，一个黑色的大三角形，一个蓝色的大三角形，一个黄色的小三角形，一个蓝色的小三角形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "small", "left"], ["blue", "square", "large", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的中等三角形，一个黄色的大圆形，一个黄色的小圆形，一个蓝色的小三角形。在中间的盒子里，有一个蓝色的中等三角形，一个黑色的大正方形，一个蓝色的中等正方形，一个黄色的小圆形，一个黄色的小正方形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的小三角形，一个黄色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黑色的小正方形，一个黑色的中号圆形，一个黄色的小圆形，一个黑色的大圆形。在中间的盒子里，有一个黑色的小圆形，一个蓝色的大圆形，一个黑色的小三角形。在右边的盒子里，有一个黑色的中号圆形，一个蓝色的小圆形，一个蓝色的大正方形，一个黑色的大三角形，一个黄色的小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "triangle", "large", "right"], ["black", "round", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形、一个黄色的大正方形和一个黑色的小三角形。中间的盒子里有一个黄色的小圆形、一个黄色的中等三角形和一个蓝色的小正方形。右边的盒子里有一个黄色的小圆形和一个黄色的中等圆形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个大黄圆形，一个大蓝圆形，一个大黑圆形，一个小蓝正方形，一个小蓝三角形。在中间的盒子里，有一个大黑三角形，一个大黄三角形，一个大黄圆形，一个中等黄三角形，一个大黄正方形，一个中等蓝圆形。在右边的盒子里，有一个小蓝三角形，一个小黑圆形，一个小黄三角形。如何将所有三角形移动到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["yellow", "triangle", "small", "right"], ["black", "triangle", "large", "middle"], ["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的大三角形和一个黄色的小三角形。中间的盒子里有一个蓝色的大三角形、一个黑色的中等大小正方形和一个黑色的中等大小正方形。右边的盒子里有一个黑色的大三角形、一个黄色的中等大小三角形、一个蓝色的中等大小圆形和一个蓝色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形和一个蓝色的大正方形。中间的盒子里有一个黄色的小三角形、一个黄色的大圆形和一个黑色的大正方形。右边的盒子里有一个蓝色的小三角形、一个蓝色的大圆形、一个黄色的小圆形、一个黑色的大圆形和一个蓝色的大三角形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个黑色的大三角形，一个蓝色的大正方形，一个黑色的小三角形，一个黑色的中等三角形。在中间的盒子里，有一个蓝色的小正方形，一个黄色的大圆形。在右边的盒子里，有一个黑色的中等正方形，一个蓝色的小三角形，一个黄色的大正方形，一个蓝色的中等三角形，一个黄色的中等正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "large", "left"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的中等三角形，一个蓝色的大圆形，一个蓝色的中等三角形，一个黄色的小正方形。在中间的盒子里，有一个黑色的中等正方形，一个蓝色的中等圆形，一个黑色的中等圆形，一个黄色的小正方形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的大圆形，一个黄色的大正方形，一个黑色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黑色的小圆形、一个黑色的小三角形和一个黄色的小圆形。中间的盒子里有一个黄色的小正方形、一个黄色的小正方形。右边的盒子里有一个黄色的小圆形、一个蓝色的小正方形和一个黄色的中等三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "small", "left"], ["black", "round", "small", "left"], ["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等大小的正方形、一个黄色的小圆形、一个黄色的大正方形和一个黑色的大三角形。中间的盒子里有一个黄色的小三角形和一个蓝色的大正方形。右边的盒子里有两个黑色的中等大小的圆形和一个黄色的大正方形。如何将所有蓝色物品移到左边的盒子？", "label": [["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形和一个黄色的大圆形。中间的盒子里有两个黑色的大三角形和两个黑色的中等正方形。右边的盒子里有一个黑色的小三角形和一个黑色的中等圆形。如何将所有蓝色物品移动到中间的盒子中？", "label": [["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小正方形和一个蓝色的小三角形。在中间的盒子里，有一个蓝色的大三角形、一个蓝色的小正方形、一个蓝色的小三角形、一个黄色的中等三角形、一个黑色的小三角形和一个黑色的小圆形。在右边的盒子里，有一个蓝色的中等三角形、一个黄色的中等圆形、一个黄色的中等圆形和一个蓝色的大三角形。如何将所有黑色物品移动到中间的盒子中？", "label": [["black", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个蓝色的中等三角形和一个黑色的小三角形。中间的盒子里有一个黑色的小圆形、一个蓝色的中等三角形、一个蓝色的中等圆形、一个蓝色的大三角形、一个蓝色的大圆形和一个蓝色的小正方形。右边的盒子里有一个蓝色的小正方形和一个黄色的中等正方形。如何将所有蓝色物品移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"], ["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "middle"], ["blue", "round", "middle", "middle"], ["blue", "triangle", "large", "middle"], ["blue", "round", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个黑色的中等三角形，一个黑色的小圆形。中间的盒子里有一个黄色的小圆形，一个蓝色的大三角形，一个黄色的大三角形。右边的盒子里有一个黑色的大正方形，一个黄色的大正方形，一个黑色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"], ["blue", "triangle", "large", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个蓝色中圆形、一个蓝色大圆形、一个蓝色大正方形。中间的盒子里有一个黑色小圆形、一个黄色小三角形、一个蓝色中等三角形、一个黑色小正方形。右边的盒子里有一个蓝色大正方形、一个小黄色圆形。如何将所有圆形移到右边的盒子里？", "label": [["yellow", "round", "small", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "large", "left"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的大三角形、一个黑色的中圆形、一个蓝色的大三角形、一个蓝色的大圆形、一个黄色的中三角形。中间的盒子里有一个黑色的小正方形、一个黄色的中三角形。右边的盒子里有一个黄色的中正方形、一个黑色的大三角形、一个黄色的小圆形、一个蓝色的大三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["black", "round", "middle", "left"], ["blue", "round", "large", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的中圆形，一个黄色的大正方形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的中等三角形，一个黑色的小三角形，一个黄色的大三角形，一个蓝色的中等正方形。在右边的盒子里，有一个蓝色的中等三角形，一个黄色的大三角形，一个黑色的中等正方形，一个黄色的中等三角形，一个黄色的大三角形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "triangle", "middle", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形和一个蓝色的大正方形。中间的盒子里有一个黑色的中等圆形、一个黑色的中等正方形、一个蓝色的中等正方形、一个黄色的大圆形和一个蓝色的中等三角形。右边的盒子里有一个蓝色的大正方形、一个黄色的大圆形、一个黑色的大三角形、一个黄色的小三角形和一个黑色的小三角形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "round", "large", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形和一个黑色的大正方形。中间的盒子里有一个黄色的大正方形、一个蓝色的大三角形、一个蓝色的小圆形、一个蓝色的中等三角形和一个黄色的小三角形。右边的盒子里有一个蓝色的小三角形和一个蓝色的中等正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"], ["blue", "square", "middle", "right"], ["blue", "triangle", "large", "middle"], ["blue", "round", "small", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个蓝色的中号正方形和一个蓝色的大号正方形。中间的盒子里有一个黑色的小号圆形、一个黑色的小号正方形和一个黑色的中号圆形。右边的盒子里有一个黄色的中号圆形和一个黄色的中号三角形。如何将所有蓝色物品移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "middle", "left"], ["blue", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个黑色的大圆形。中间的盒子里有一个黑色的大三角形、一个黑色的小三角形、一个黑色的中圆形、一个蓝色的小三角形和一个黑色的中三角形。右边的盒子里有一个蓝色的大正方形、一个蓝色的大圆形、一个蓝色的中正方形、一个蓝色的大圆形、一个黄色的中圆形和一个蓝色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黄色的小正方形，一个蓝色的小三角形，一个黄色的大三角形。在中间的盒子里，有一个黄色的中等三角形，一个黄色的小三角形，一个蓝色的中等正方形，一个黄色的大圆形，一个黑色的小三角形，一个黑色的小三角形。在右边的盒子里，有一个黑色的小圆形，一个黑色的大正方形，一个蓝色的大圆形，一个蓝色的小正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "triangle", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形和一个黑色的小三角形。中间的盒子里有一个黑色的大正方形和一个蓝色的大正方形。右边的盒子里有一个黑色的小圆形、一个蓝色的中等圆形、一个黑色的小正方形、一个黄色的中等正方形和一个黑色的中等三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "middle", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个蓝色的小圆形，一个黄色的中等正方形，一个黄色的大三角形，一个蓝色的中等正方形，一个黑色的小圆形。在中间的盒子里，有一个蓝色的中等三角形，一个黄色的中等圆形，一个黑色的大三角形，一个黑色的大圆形。在右边的盒子里，有一个黑色的小正方形，一个黄色的中等圆形，一个黄色的小圆形。如何将所有正方形移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "middle", "left"], ["blue", "square", "middle", "left"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黄色的大三角形，一个黄色的大圆形，一个黄色的小圆形，一个黑色的中等正方形，一个黑色的小圆形。在中间的盒子里，有一个蓝色的小正方形，一个黑色的小三角形，一个蓝色的大圆形，一个黑色的小圆形，一个黑色的小三角形，一个蓝色的中等三角形。在右边的盒子里，有一个蓝色的小圆形，一个黄色的中等圆形，一个黑色的小圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "round", "small", "left"], ["black", "triangle", "small", "middle"], ["black", "round", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中间正方形，一个黄色的中间圆形。中间的盒子里有一个黑色的中间正方形，一个小黑色圆形，一个小黑色三角形。右边的盒子里有一个黄色的小正方形，一个蓝色的大正方形，一个黑色的大圆形，一个黑色的大圆形。如何将所有的圆形移到右边的盒子？", "label": [["yellow", "round", "middle", "left"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个黄色的中等三角形，一个蓝色的中等圆形，一个蓝色的大正方形。中间的盒子里有一个蓝色的大正方形，一个黑色的中等三角形，一个黑色的小正方形，一个黄色的中等圆形。右边的盒子里有一个黄色的小圆形，一个黄色的小正方形，一个黄色的中等三角形，一个黄色的小三角形，一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形和一个黄色的小正方形。在中间的盒子里，有一个黑色的大三角形、一个黑色的小圆形、一个蓝色的大三角形、一个黑色的大圆形和一个黄色的中等大小的正方形。在右边的盒子里，有一个蓝色的大圆形和一个黄色的小三角形。如何将所有黑色物品移动到中间的盒子中？", "label": [["black", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形，一个黄色的中等三角形，一个蓝色的大正方形。中间的盒子里有一个黄色的中等圆形，一个蓝色的小圆形，一个黄色的小三角形，一个蓝色的中等正方形，一个蓝色的小三角形。右边的盒子里有一个黄色的大正方形，一个蓝色的小圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "large", "left"], ["blue", "round", "small", "middle"], ["blue", "square", "middle", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个蓝色的大正方形、一个黄色的中等三角形和一个蓝色的小三角形。中间的盒子里有一个蓝色的大正方形、一个黑色的小正方形和一个蓝色的中等三角形。右边的盒子里有一个黑色的大圆形、一个黄色的中等正方形和两个黑色的大三角形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "large", "left"], ["blue", "square", "large", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的小三角形，一个蓝色的小圆形，一个黄色的大圆形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的小圆形，一个黄色的大三角形，一个黄色的中等三角形，一个黄色的大正方形，一个黑色的中等三角形。在右边的盒子里，有一个蓝色的大三角形，一个黄色的中等正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "triangle", "middle", "middle"], ["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形和一个蓝色的中圆形。在中间的盒子里，有一个黑色的小三角形、一个黑色的小正方形和一个黄色的中正方形。在右边的盒子里，有一个黄色的大正方形、一个蓝色的中圆形、一个蓝色的小三角形、一个黑色的中圆形和一个黑色的中正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "middle", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的大三角形和一个蓝色的大三角形。中间的盒子里有一个黑色的大圆形、一个黄色的小正方形、一个黄色的大三角形、一个黑色的大正方形、一个黄色的小三角形和一个黑色的小圆形。右边的盒子里有一个黑色的大正方形、一个黄色的大三角形和一个黑色的大三角形。如何将所有的正方形移到中间的盒子里？", "label": [["black", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个黄色的小三角形和一个蓝色的中等圆形。中间的盒子里有一个蓝色的大正方形，一个黄色的小圆形和一个黑色的大圆形。右边的盒子里有一个黄色的大正方形，一个黄色的大三角形，一个黄色的大正方形和一个蓝色的小圆形。如何将所有三角形移动到左边的盒子中？", "label": [["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形和一个蓝色的小正方形。中间的盒子里有一个黑色的小三角形和一个蓝色的大三角形。右边的盒子里有一个黄色的大三角形、两个黄色的中等三角形、一个蓝色的中等三角形和一个黑色的小圆形。如何将所有黑色物品移到右边的盒子中？", "label": [["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的中等正方形，一个蓝色的小三角形，一个蓝色的大正方形，一个黄色的小三角形，一个黑色的中等圆形。在中间的盒子里，有一个黄色的中等正方形，一个蓝色的大圆形，一个黑色的小三角形。在右边的盒子里，有一个黄色的中等三角形，一个黑色的大三角形，一个蓝色的小三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "left"], ["black", "round", "middle", "left"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形，一个黑色的中等三角形。中间的盒子里有一个黄色的小三角形，一个蓝色的大正方形，一个蓝色的小三角形，一个黄色的小圆形。右边的盒子里有一个蓝色的中等三角形，一个黄色的中等正方形，一个黄色的中等正方形，一个黑色的小圆形，一个蓝色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形和一个蓝色的小正方形。中间的盒子里有一个蓝色的大圆形、一个黑色的小圆形、一个黄色的大三角形、一个黑色的大正方形、一个黄色的小圆形和一个蓝色的大正方形。右边的盒子里有一个蓝色的中等三角形、一个黄色的中等正方形、一个黑色的大正方形和一个黄色的中等圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的大三角形和一个蓝色的大三角形。中间的盒子里有一个蓝色的中等圆形、一个黑色的中等正方形、一个蓝色的中等三角形、一个黄色的大三角形和一个黑色的中等正方形。右边的盒子里有一个蓝色的中等正方形和一个蓝色的大圆形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的中圆形，一个蓝色的中等三角形，一个蓝色的中等正方形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个黄色的中等三角形，一个黑色的中等三角形。在右边的盒子里，有一个蓝色的小圆形，一个黄色的大圆形，一个蓝色的中等正方形，一个蓝色的大三角形，一个黄色的中圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["blue", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中圆形、一个黄色的小圆形、一个黄色的小圆形、一个黑色的中方形。在中间的盒子里，有一个黑色的中三角形、一个黄色的大三角形、一个黄色的小方形、一个蓝色的大圆形、一个蓝色的大方形。在右边的盒子里，有一个蓝色的大三角形、一个蓝色的中圆形、一个蓝色的中圆形、一个蓝色的小圆形、一个黄色的大方形、一个黑色的大圆形。如何将所有黄色物品移动到中间的盒子里？", "label": [["yellow", "round", "middle", "left"], ["yellow", "round", "small", "left"], ["yellow", "round", "small", "left"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的小正方形，一个蓝色的中等正方形，一个黑色的大圆形。在中间的盒子里，有一个黑色的小三角形，一个黄色的中等正方形，一个黑色的小正方形，一个黑色的小三角形，一个黄色的中等圆形，一个黑色的中等正方形。在右边的盒子里，有一个蓝色的中等正方形，一个蓝色的小正方形，一个蓝色的大圆形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["blue", "square", "small", "right"], ["yellow", "square", "middle", "middle"], ["black", "square", "small", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个黄色的中等正方形、一个黄色的大圆形和一个黄色的小圆形。在中间的盒子里，有一个黄色的中等圆形、一个黄色的中等三角形、一个黑色的大圆形、一个黑色的大正方形、一个黄色的大正方形和一个黑色的小正方形。在右边的盒子里，有一个黑色的大三角形、一个黄色的大三角形、一个黑色的中等圆形和一个黑色的小三角形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "right"], ["yellow", "triangle", "large", "right"], ["black", "triangle", "small", "right"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的大三角形，一个黄色的大三角形，一个蓝色的大三角形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的中等大小的正方形，一个黄色的中等大小的圆形，一个黄色的小三角形，一个黑色的中等大小的正方形，一个蓝色的大三角形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的小圆形，一个黑色的大三角形，一个黑色的小圆形，一个蓝色的大圆形，一个黑色的小三角形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "square", "middle", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个黄色的小圆形、一个黑色的小正方形。中间的盒子里有一个蓝色的小三角形、一个蓝色的中等大小的正方形。右边的盒子里有一个黑色的小三角形、一个蓝色的大圆形、一个黄色的中等大小的圆形、一个蓝色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "round", "small", "left"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形，一个蓝色的中圆形，一个蓝色的中圆形，一个黄色的中圆形，一个黑色的小圆形。中间的盒子里有一个黄色的中等三角形，一个黄色的中等正方形。右边的盒子里有一个蓝色的大三角形，一个黄色的中圆形，一个蓝色的大正方形，一个蓝色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个蓝色的中等三角形。中间的盒子里有一个黄色的中等圆形和一个黄色的小正方形。右边的盒子里有一个蓝色的大三角形、一个蓝色的大正方形和一个黑色的大三角形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的大三角形，一个黄色的中等三角形，一个黑色的中等圆形，一个黄色的小三角形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的小三角形，一个黑色的中等圆形，一个蓝色的中等圆形，一个蓝色的中等正方形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的大圆形，一个蓝色的大圆形，一个黑色的中等三角形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "large", "right"], ["blue", "round", "large", "right"], ["black", "round", "middle", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中号圆形、一个黑色的中号圆形、一个黑色的大正方形、一个黑色的小圆形、一个黑色的小三角形。在中间的盒子里，有一个蓝色的小正方形、一个黄色的大圆形、一个黄色的大圆形、一个蓝色的小圆形。在右边的盒子里，有一个蓝色的中号圆形、一个蓝色的中号圆形、一个蓝色的大圆形、一个蓝色的小圆形、一个黑色的小正方形、一个黄色的大圆形。如何将所有蓝色物品移动到左边的盒子里？", "label": [["blue", "round", "middle", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "large", "right"], ["blue", "round", "small", "right"], ["blue", "square", "small", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形和一个黑色的中间正方形。中间的盒子里有一个黄色的小圆形、一个黄色的大三角形、一个黄色的小正方形、一个黑色的小圆形和一个黄色的小三角形。右边的盒子里有一个黄色的小三角形、一个黄色的中间圆形、一个蓝色的小正方形和一个黑色的大圆形。如何将所有黑色物体移动到中间的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形和一个黑色的中圆形。在中间的盒子里，有一个蓝色的中圆形、一个蓝色的大圆形和一个蓝色的中三角形。在右边的盒子里，有两个黑色的大三角形和两个黑色的大圆形以及两个蓝色的小圆形。如何将所有黑色物品移到右边的盒子里？", "label": [["black", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色圆形，一个大黄色正方形，一个中蓝色圆形。在中间的盒子里，有一个大黑色圆形，一个中蓝色三角形，一个小黑色正方形，一个中黑色圆形，一个小蓝色三角形。在右边的盒子里，有一个中黄色圆形，一个大黄色圆形，一个大蓝色正方形，一个大黄色圆形，一个中黄色圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "square", "large", "left"], ["yellow", "round", "middle", "right"], ["yellow", "round", "large", "right"], ["yellow", "round", "large", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的大圆形，一个黄色的大三角形，一个黑色的小三角形，一个黑色的小正方形。在中间的盒子里，有一个黄色的小三角形，一个黑色的小正方形，一个蓝色的中圆形，一个黑色的小圆形。在右边的盒子里，有一个黄色的大三角形，一个黄色的大圆形，一个蓝色的中三角形，一个蓝色的中三角形，一个黑色的中三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "round", "large", "left"], ["black", "triangle", "small", "left"], ["black", "square", "small", "left"], ["black", "square", "small", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的小圆形，一个蓝色的中等三角形，一个黑色的小三角形，一个黄色的小圆形，一个蓝色的大圆形。在中间的盒子里，有一个黑色的小正方形，一个黄色的大三角形，一个蓝色的中等正方形，一个黑色的小正方形，一个黑色的大三角形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的大圆形，一个黄色的中等三角形，一个黄色的中等正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个黑色的小正方形。中间的盒子里有一个蓝色的中等三角形、一个黄色的大正方形和一个黑色的大三角形。右边的盒子里有一个蓝色的中等圆形、一个黑色的小圆形、一个黄色的中等三角形、一个黑色的小正方形和一个蓝色的小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "square", "small", "right"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色圆形，一个蓝色大三角形，一个蓝色大三角形。在中间的盒子里，有一个黄色中等三角形，一个黄色大正方形，一个黑色中等三角形，一个蓝色大三角形，一个黑色中等圆形。在右边的盒子里，有一个黄色中等正方形，一个黄色大圆形，一个黄色大三角形，一个蓝色大三角形，一个黑色小三角形，一个黑色大圆形。如何将所有三角形移动到中间的盒子？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "left"], ["yellow", "triangle", "large", "right"], ["blue", "triangle", "large", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个蓝色的大三角形、一个黑色的大圆形和一个蓝色的中等大小的正方形。中间的盒子里有一个蓝色的小圆形、一个黄色的大正方形、一个黄色的小三角形和一个黑色的中等大小的圆形。右边的盒子里有一个黑色的小正方形、一个黄色的小圆形和一个黑色的小正方形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "triangle", "large", "left"], ["blue", "square", "middle", "left"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个黄色的小三角形。中间的盒子里有一个黑色的大三角形和一个黄色的大正方形。右边的盒子里有一个黄色的小正方形和一个黄色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个小黄色圆形、一个中等黄色圆形和一个大蓝色三角形。中间的盒子里有一个小黑色正方形、一个大黑色三角形、一个小黄色圆形、一个小黑色三角形、一个大黄色三角形和一个大黑色三角形。右边的盒子里有一个小黑色正方形和一个大蓝色正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个黄色的中间三角形，一个黑色的中间正方形，一个黄色的中间三角形。在中间的盒子里，有一个黑色的大圆形，一个蓝色的中间圆形，一个黑色的大正方形，一个黄色的大圆形，一个黑色的小圆形。在右边的盒子里，有一个黄色的大正方形，一个黑色的大圆形，一个黄色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个小黑圆、一个大黑方块、一个黄色中等方块、一个黄色大方块、一个黑色中等三角形。在中间的盒子里，有一个黄色中等三角形、一个大黑方块、一个小黄方块、一个蓝色小三角形。在右边的盒子里，有一个黑色中等方块、一个黄色大三角形、一个大黑方块、一个小黄三角形、一个黑色中等方块。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "large", "left"], ["yellow", "triangle", "large", "right"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个黄色的大三角形。中间的盒子里有一个黑色的大三角形、一个黑色的小圆形、一个黄色的中等三角形、一个黄色的大三角形、一个黑色的中等圆形和一个蓝色的小三角形。右边的盒子里有一个黄色的小正方形、一个蓝色的中等正方形和一个蓝色的小圆形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "small", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的中等圆形。在中间的盒子里，有一个蓝色的中等正方形，一个黑色的大正方形，一个黑色的小圆形，一个黄色的大正方形，一个黑色的大三角形。在右边的盒子里，有一个黄色的中等三角形，一个黑色的中等三角形，一个黄色的大正方形，一个蓝色的大圆形，一个蓝色的中等圆形，一个蓝色的大圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["yellow", "triangle", "middle", "right"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形和一个蓝色的小三角形。中间的盒子里有一个黄色的中等圆形和一个蓝色的大三角形。右边的盒子里有一个蓝色的中等圆形、一个黄色的中等正方形和一个黑色的中等三角形。如何将所有黄色物体移动到中间的盒子中？", "label": [["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黄色的大圆形，一个黑色的中等正方形，一个黑色的大正方形，一个黄色的中等圆形，一个黄色的大圆形。在中间的盒子里，有一个蓝色的小正方形，一个黄色的大三角形，一个黑色的大圆形。在右边的盒子里，有一个黑色的小三角形，一个蓝色的小圆形，一个黄色的中等正方形，一个黄色的中等正方形，一个黄色的中等圆形。如何将所有正方形移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黑色的中圆形、一个黄色的小正方形、一个黄色的小三角形和一个蓝色的小圆形。中间的盒子里有一个黑色的大三角形和一个黄色的小正方形。右边的盒子里有一个黄色的小圆形、一个蓝色的大三角形和一个蓝色的小三角形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的大圆形，一个黑色的小圆形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的中等正方形，一个蓝色的中等三角形，一个蓝色的大三角形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的大圆形，一个黑色的大三角形，一个黑色的小三角形，一个黄色的大三角形，一个蓝色的中等圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"], ["blue", "round", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "square", "middle", "middle"], ["blue", "triangle", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形、一个黑色的中等三角形、一个黑色的中等三角形、一个黄色的大圆形、一个黑色的小正方形、一个黑色的大圆形。中间的盒子里有一个黄色的中等圆形、一个黑色的大圆形、一个黑色的中等圆形。右边的盒子里有一个黑色的中等三角形、一个黄色的大正方形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "large", "left"], ["black", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的小三角形、一个黄色的中等正方形、一个蓝色的大正方形和一个黑色的中等三角形。中间的盒子里有一个蓝色的小三角形和一个黑色的中等三角形。右边的盒子里有一个黑色的小三角形和一个黄色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的大三角形，一个黄色的大圆形，一个蓝色的中圆形。在中间的盒子里，有一个黑色的中方形，一个蓝色的小圆形。在右边的盒子里，有一个黄色的小方形，一个黄色的中方形，一个蓝色的大三角形，一个黄色的中圆形，一个黄色的大圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "large", "left"], ["yellow", "square", "small", "right"], ["yellow", "square", "middle", "right"], ["yellow", "round", "middle", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个蓝色的大三角形和一个蓝色的中等三角形。中间的盒子里有一个蓝色的小圆形和一个黑色的中等三角形。右边的盒子里有一个黄色的大三角形、一个黑色的中等圆形和一个蓝色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色圆形，一个大黄色正方形，一个大蓝色三角形，一个大黑色圆形。在中间的盒子里，有一个大黑色三角形，一个小黄色正方形，一个小黄色三角形，一个中等大小的黄色正方形，一个小蓝色圆形，一个中等大小的黑色正方形。在右边的盒子里，有一个中等大小的蓝色圆形，一个中等大小的黑色正方形，一个小黑色圆形，一个大黑色圆形。如何将所有圆形移动到右边的盒子中？", "label": [["yellow", "round", "small", "left"], ["black", "round", "large", "left"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个小黄色圆形、一个中等黄色圆形。中间的盒子里有一个大蓝色正方形、一个小黄色圆形、一个中等黑色三角形、一个小黑色圆形。右边的盒子里有一个中等黄色圆形、一个大蓝色圆形、一个中等黄色圆形、一个大黑色正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["black", "triangle", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个大黑色正方形，一个蓝色中圆形，一个蓝色大正方形。在中间的盒子里，有一个蓝色中圆形，一个蓝色大正方形，一个黑色大正方形，一个黑色中三角形，一个黑色大三角形，一个小蓝色三角形。在右边的盒子里，有一个黑色大圆形，一个蓝色小正方形，一个黄色中圆形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["blue", "square", "large", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个蓝色的小圆形、一个黄色的大三角形、一个蓝色的中圆形和一个黑色的大三角形。中间的盒子里有一个蓝色的大三角形、一个黑色的中方形和一个黑色的小圆形。右边的盒子里有一个黄色的小三角形和一个黄色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形，一个黄色的中圆形。中间的盒子里有一个蓝色的小圆形，一个黑色的中三角形，一个黄色的小圆形，一个黄色的大正方形。右边的盒子里有一个黄色的中正方形，一个黑色的中正方形，一个黑色的小三角形，一个黄色的中三角形，一个黄色的大正方形，一个蓝色的中正方形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["black", "square", "middle", "right"], ["yellow", "square", "large", "right"], ["blue", "square", "middle", "right"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的中等三角形，一个黄色的小圆形，一个蓝色的大圆形，一个黑色的中等三角形。在中间的盒子里，有一个黑色的中等圆形，一个黄色的小正方形，一个蓝色的小三角形，一个黄色的小正方形，一个黄色的大三角形。在右边的盒子里，有一个蓝色的中等正方形，一个黄色的小三角形，一个黑色的中等圆形，一个蓝色的大圆形，一个蓝色的中等正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "square", "small", "middle"], ["yellow", "square", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个黑色的中圆形，一个蓝色的大三角形，一个黄色的中圆形，一个蓝色的大圆形。在中间的盒子里，有一个黑色的小圆形，一个蓝色的小圆形，一个黑色的大正方形，一个黑色的中正方形，一个黑色的中三角形。在右边的盒子里，有一个黑色的小正方形，一个黄色的小正方形，一个蓝色的大三角形，一个黄色的小圆形，一个黄色的中圆形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "large", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个黄色的大正方形、一个蓝色的小正方形、一个黄色的中等大小的正方形和一个黄色的大正方形。在中间的盒子里，有一个蓝色的小圆形、一个蓝色的大三角形、一个蓝色的大三角形、一个蓝色的小三角形、一个黑色的中等大小的圆形和一个蓝色的大圆形。在右边的盒子里，有一个黄色的大正方形、一个黑色的大三角形和一个黄色的中等大小的圆形。如何将所有蓝色物品移到右边的盒子里？", "label": [["blue", "square", "small", "left"], ["blue", "round", "small", "middle"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "small", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个黄色的中等三角形。中间的盒子里有一个小黄色圆形，一个黑色的中等三角形，一个小黄色圆形，一个大黄色圆形，一个黄色的中等三角形。右边的盒子里有一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的小圆形，一个黑色的大三角形。如何将所有三角形移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "right"], ["black", "triangle", "middle", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形和一个黑色的中等三角形。中间的盒子里有一个黄色的中等圆形、一个蓝色的中等正方形和一个黄色的大圆形。右边的盒子里有一个蓝色的大圆形、一个黄色的小正方形、一个黑色的中等三角形和一个蓝色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个黑色的中等三角形、一个蓝色的大圆形、一个黑色的大正方形。中间的盒子里有一个黄色的小圆形、一个黑色的中等三角形。右边的盒子里有一个黑色的小圆形、一个黄色的大正方形、一个黄色的大圆形、一个黄色的小三角形、一个黑色的大圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "round", "large", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的大正方形，一个蓝色的中等三角形，一个蓝色的小正方形，一个黑色的小正方形。在中间的盒子里，有一个黑色的中等三角形，一个黄色的大正方形，一个黄色的大三角形，一个黑色的大圆形，一个蓝色的大正方形，一个黑色的小圆形。在右边的盒子里，有一个黄色的小圆形，一个蓝色的大正方形，一个黑色的小圆形，一个蓝色的小正方形，一个黑色的小三角形，一个蓝色的小三角形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "triangle", "small", "right"], ["black", "triangle", "middle", "middle"], ["black", "round", "large", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个蓝色的小正方形、一个蓝色的小三角形、一个蓝色的大正方形和一个蓝色的中号圆形。中间的盒子里有一个黑色的小正方形、一个黑色的大三角形和一个蓝色的中号圆形。右边的盒子里有一个黄色的小正方形、一个黄色的中号圆形和一个黑色的中号正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "large", "left"], ["blue", "square", "small", "left"], ["blue", "square", "large", "left"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的中圆形、一个蓝色的大正方形、一个黄色的中三角形。中间的盒子里有一个黄色的中圆形、一个蓝色的中正方形、一个蓝色的大正方形。右边的盒子里有一个蓝色的小三角形、一个黑色的小三角形、一个蓝色的大三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的中圆形，一个黑色的大三角形，一个黄色的大圆形和一个黄色的大圆形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大圆形和一个黄色的小正方形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的中正方形，一个黑色的大圆形和一个黄色的中三角形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "large", "left"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形，一个小黄三角形。中间的盒子里有一个中蓝圆形，一个小蓝三角形，一个中蓝三角形，一个小蓝三角形，一个中黑色正方形。右边的盒子里有一个大黑圆形，一个小黑正方形，一个大黑三角形，一个小黄正方形。如何将所有正方形移动到右边的盒子里？", "label": [["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个蓝色的大三角形和一个黄色的大三角形。中间的盒子里有一个黑色的小正方形、一个蓝色的大正方形、一个黄色的小正方形和一个黑色的小正方形。右边的盒子里有一个黄色的大正方形、一个蓝色的大三角形、一个黑色的大三角形和一个黑色的大圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形和一个蓝色的大三角形。中间的盒子里有一个蓝色的大圆形、一个蓝色的大圆形、一个蓝色的中等正方形和一个黄色的大三角形。右边的盒子里有一个黄色的大正方形、一个黄色的小三角形和一个黑色的小正方形。如何将所有正方形移到右边的盒子中？", "label": [["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形，一个黑色的大圆形。中间的盒子里有一个黑色的小三角形，一个蓝色的小正方形，一个蓝色的中等大小的三角形。右边的盒子里有一个黑色的小三角形，一个黄色的中等大小的圆形，一个黄色的中等大小的三角形，一个蓝色的小正方形，一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黑色的大正方形、一个黄色的大三角形、一个黑色的小正方形、一个黑色的中等三角形。中间的盒子里有一个黄色的中等正方形、一个黑色的大正方形、一个蓝色的中等正方形。右边的盒子里有一个蓝色的小三角形、一个蓝色的大正方形、一个蓝色的中等圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的中等三角形和一个黑色的中等圆形。中间的盒子里有一个蓝色的大圆形、一个黄色的小正方形、一个黄色的大圆形、一个黑色的大圆形、一个蓝色的大三角形和一个黄色的大正方形。右边的盒子里有一个黄色的大三角形、一个蓝色的中等三角形、一个黑色的中等圆形、一个黑色的大圆形和一个蓝色的中等正方形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["black", "round", "middle", "left"], ["blue", "round", "large", "middle"], ["yellow", "round", "large", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形、一个小黑色正方形和一个黄色小三角形。中间的盒子里有一个中等大小的黑色正方形、一个黄色小三角形、一个中等大小的黑色圆形和一个黄色中等大小的三角形。右边的盒子里有一个小黑色三角形、一个小黑色圆形和一个大蓝色圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形和一个黄色的大正方形。在中间的盒子里，有一个黄色的小正方形、一个黄色的大三角形、一个黑色的大正方形和两个黑色的大圆形。在右边的盒子里，有一个黑色的中等大小的正方形和一个蓝色的小圆形。如何将所有蓝色的物品移到中间的盒子里？", "label": [["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黑色的大三角形、一个黑色的中等正方形和一个黑色的中等圆形。中间的盒子里有一个蓝色的小圆形、一个黑色的中等正方形、两个黑色的小三角形、一个蓝色的大正方形和一个黄色的小三角形。右边的盒子里有一个蓝色的大正方形和一个蓝色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个黄色的大三角形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的中间三角形，一个蓝色的大三角形，一个黑色的大三角形，一个蓝色的中间三角形。在右边的盒子里，有一个黄色的小圆形，一个黄色的大三角形，一个黑色的大正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形、一个蓝色的大圆形、一个蓝色的大正方形和一个蓝色的中等大小的正方形。中间的盒子里有一个黄色的中等大小的正方形、一个黄色的中等大小的三角形和一个黄色的中等大小的圆形。右边的盒子里有一个黄色的大圆形、一个蓝色的中等大小的圆形、一个蓝色的小正方形、一个蓝色的大圆形和一个黑色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中间正方形、一个蓝色的中间圆形、一个黑色的中间圆形和一个蓝色的中间正方形。中间的盒子里有一个蓝色的中间正方形和一个黑色的大圆形。右边的盒子里有一个蓝色的中间三角形、一个蓝色的大正方形和一个黑色的大三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "middle", "left"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形，一个蓝色的小三角形，一个黄色的小圆形，一个黄色的中圆形。中间的盒子里有一个蓝色的大正方形，一个蓝色的大正方形。右边的盒子里有一个蓝色的小三角形，一个黑色的中正方形，一个黑色的中三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形和一个黄色的中等正方形。在中间的盒子里，有一个蓝色的中等三角形、一个黑色的小三角形、一个蓝色的大正方形、一个黑色的大三角形、一个黄色的大圆形和一个黑色的大三角形。在右边的盒子里，有一个黄色的大正方形、一个黑色的大三角形、一个蓝色的小圆形、一个黄色的中等三角形、一个黑色的小圆形和一个黄色的小三角形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "middle", "left"], ["black", "triangle", "small", "middle"], ["black", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的小正方形，一个黑色的大圆形，一个黄色的中等大小的正方形，一个蓝色的中等大小的三角形，一个蓝色的小圆形。在中间的盒子里，有一个黄色的中等大小的圆形，一个黑色的大正方形，一个黑色的小圆形，一个黑色的大三角形，两个黄色的大三角形。在右边的盒子里，有一个黄色的大圆形，一个蓝色的小三角形，一个黑色的小圆形，一个黑色的小三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "square", "large", "middle"], ["black", "round", "small", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黄色的大三角形，一个蓝色的小三角形，一个蓝色的大圆形，一个蓝色的小三角形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的大正方形，一个黑色的大圆形，一个黑色的大正方形，一个蓝色的小圆形，一个黄色的小正方形。在右边的盒子里，有一个蓝色的中等正方形，一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["blue", "round", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个大黑圆形，一个中蓝色正方形，一个小黑正方形，一个小蓝正方形。在中间的盒子里，有一个中黄圆形，一个中黑正方形，一个小黑圆形，一个中黄圆形。在右边的盒子里，有一个中蓝圆形，一个大黄三角形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "triangle", "large", "right"], ["yellow", "round", "middle", "middle"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的大圆形、一个黄色的大圆形、一个黑色的大正方形。中间的盒子里有一个黑色的大三角形、一个黄色的大正方形。右边的盒子里有一个黄色的小三角形、一个黑色的中等大小的正方形、一个黑色的中等大小的正方形、一个黑色的中等大小的正方形、一个黄色的中等大小的圆形。如何将所有的正方形移到中间的盒子里？", "label": [["black", "square", "large", "left"], ["black", "square", "middle", "right"], ["black", "square", "middle", "right"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形和一个蓝色的中等正方形。在中间的盒子里，有一个黑色的小正方形、一个黑色的中等圆形、一个蓝色的大三角形、一个黄色的大圆形、一个蓝色的小正方形和一个黑色的中等三角形。在右边的盒子里，有两个黑色的中等三角形、一个蓝色的大正方形、一个黑色的小圆形和一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形，一个蓝色的大圆形。中间的盒子里有一个黄色的大正方形，一个黑色的小正方形，一个黑色的小三角形，一个蓝色的小三角形，一个黑色的中等三角形。右边的盒子里有一个蓝色的小正方形，一个蓝色的小圆形，一个黑色的中等圆形，一个黑色的小三角形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的中等正方形、一个蓝色的中等圆形和一个黑色的小三角形。中间的盒子里有一个蓝色的大三角形和一个蓝色的大圆形。右边的盒子里有一个黑色的大三角形和一个黄色的大圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "triangle", "large", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中间正方形、一个黄色的中间正方形、一个蓝色的中间圆形、一个蓝色的中间三角形、一个蓝色的中间三角形、一个蓝色的大正方形。中间的盒子里有一个黑色的大三角形、一个黄色的大圆形、一个黑色的大正方形、一个黄色的大三角形、一个蓝色的大三角形、一个黑色的大圆形。右边的盒子里有一个黑色的大正方形、一个黄色的小三角形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形，一个黄色的小圆形，一个黑色的大三角形，一个蓝色的小三角形，一个蓝色的中等大小的圆形，一个蓝色的中等大小的正方形。在中间的盒子里，有一个蓝色的大三角形，一个黑色的大圆形，一个黑色的小正方形，一个蓝色的中等大小的正方形，一个蓝色的中等大小的正方形。在右边的盒子里，有一个蓝色的中等大小的三角形，一个蓝色的大圆形，一个蓝色的大三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "large", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的大圆形，一个蓝色的中间三角形，一个黑色的大正方形，一个黑色的大正方形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的中间圆形。在右边的盒子里，有一个蓝色的大三角形，一个蓝色的大圆形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黑色的中间三角形，一个蓝色的中间正方形，一个黑色的中间圆形，一个黑色的大三角形。在中间的盒子里，有一个蓝色的大三角形，一个黄色的中间圆形，一个黑色的大正方形。在右边的盒子里，有一个黄色的大正方形，一个黄色的大正方形，一个黄色的小三角形，一个黑色的小圆形，一个蓝色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个黄色的小三角形、一个蓝色的小三角形和一个黄色的中三角形。中间的盒子里有一个蓝色的中正方形、一个黄色的大正方形、一个蓝色的中三角形和一个黄色的小正方形。右边的盒子里有一个蓝色的中三角形和一个黑色的小三角形。如何将所有正方形移到中间的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的小三角形，一个蓝色的大圆形，一个蓝色的中圆形，一个黄色的中圆形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的中圆形，一个蓝色的中等三角形，一个蓝色的中等三角形，一个黄色的小圆形。在右边的盒子里，有一个黑色的小正方形，一个黑色的小正方形，一个蓝色的小三角形，一个黄色的大三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "large", "left"], ["blue", "round", "middle", "left"], ["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个黑色的中等正方形、一个蓝色的小圆形和一个黑色的小圆形。中间的盒子里有一个黑色的大正方形和一个蓝色的小正方形。右边的盒子里有一个蓝色的大三角形、一个黑色的大三角形、一个黄色的小圆形、一个蓝色的小三角形、一个黄色的大正方形和一个蓝色的大圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个黑色的大圆形、一个黑色的中圆形。中间的盒子里有一个黑色的中正方形、一个黑色的中圆形、一个蓝色的中三角形、一个蓝色的中圆形、一个黑色的大三角形、一个蓝色的小正方形。右边的盒子里有一个黄色的小圆形、一个蓝色的小正方形、一个黑色的小三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "middle", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的大圆形、一个黑色的中圆形和一个黑色的大三角形。中间的盒子里有一个黄色的小三角形和一个黑色的小圆形。右边的盒子里有一个蓝色的大圆形、一个蓝色的大圆形、一个黄色的大正方形、一个黄色的小圆形和一个黄色的中三角形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "round", "large", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的大三角形，一个黄色的小正方形，一个蓝色的小圆形，一个黄色的大正方形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的小正方形，一个黑色的小圆形，一个黄色的大三角形，一个蓝色的大正方形。在右边的盒子里，有一个蓝色的大正方形，一个黄色的中等正方形，一个黑色的小正方形，一个黄色的小正方形，一个黄色的小圆形，一个黑色的大圆形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "round", "large", "right"], ["black", "triangle", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形，一个蓝色的中等正方形，一个黄色的小三角形，一个黑色的中等正方形。中间的盒子里有一个蓝色的大圆形，一个黑色的小三角形，一个黑色的大圆形，一个黄色的小正方形，一个黑色的中等三角形，一个蓝色的小正方形。右边的盒子里有一个黄色的大三角形，一个黑色的中等正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "triangle", "large", "left"], ["blue", "square", "middle", "left"], ["blue", "round", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黄色的大正方形，一个蓝色的中等圆形，一个蓝色的大圆形，一个黄色的小圆形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个黑色的大三角形。在右边的盒子里，有一个黄色的大正方形，一个黑色的小圆形，一个蓝色的小三角形，一个黑色的小圆形，一个黄色的大正方形，一个黑色的中等三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的小三角形，一个蓝色的大圆形。在中间的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形，一个黄色的中圆形，一个黑色的大正方形。在右边的盒子里，有两个黄色的小正方形，一个蓝色的中三角形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个黑色中等三角形，一个黑色中等圆形，一个黄色中等三角形，一个小黑色三角形。在中间的盒子里，有一个黑色大圆形，一个蓝色小圆形，一个黑色大三角形，一个黄色大圆形，一个小黑色正方形。在右边的盒子里，有一个黄色中等正方形，一个蓝色中等圆形，一个小黑色圆形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的小正方形，一个黑色的中圆形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的中三角形，一个蓝色的大三角形，一个黄色的小正方形，一个黑色的小圆形，一个黑色的中正方形。在右边的盒子里，有一个蓝色的小三角形，一个黑色的中圆形，一个黄色的大三角形，一个黑色的大正方形，一个黄色的中三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "round", "middle", "left"], ["black", "round", "middle", "right"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的小三角形，一个黄色的小三角形，一个蓝色的小圆形，一个蓝色的中等圆形。在中间的盒子里，有一个黑色的中等圆形，一个蓝色的小正方形，一个黑色的小三角形，一个黄色的小圆形，一个蓝色的小圆形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的大三角形。如何将所有正方形移动到右边的盒子？", "label": [["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形、一个黄色的大正方形、一个黄色的大三角形、一个黄色的中等三角形。中间的盒子里有一个黄色的中等圆形、一个蓝色的大三角形、一个蓝色的小三角形、两个黑色的中等圆形、一个黄色的中等正方形。右边的盒子里有一个黄色的小圆形、一个黄色的中等三角形、一个黑色的大正方形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中圆形、一个黄色的中圆形、一个蓝色的中圆形、一个黑色的大三角形、一个黑色的中圆形。在中间的盒子里，有一个黑色的中正方形、一个蓝色的小三角形、一个黑色的小圆形、一个蓝色的中三角形、一个黄色的小正方形、一个蓝色的小圆形。在右边的盒子里，有一个蓝色的大三角形、一个黑色的小圆形、一个黄色的大正方形、一个黄色的大圆形、一个蓝色的大三角形、一个黄色的中圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "large", "left"], ["black", "round", "middle", "left"], ["black", "square", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的中等正方形，一个黑色的小圆形，一个黄色的中等圆形，一个黄色的小正方形，一个蓝色的大三角形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的大正方形，一个蓝色的小正方形，一个黄色的中等三角形，一个蓝色的小圆形，一个蓝色的中等圆形。在右边的盒子里，有一个黑色的中等三角形，一个蓝色的大正方形，一个蓝色的中等三角形，一个蓝色的大圆形，一个黑色的小正方形，一个黑色的中等正方形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形，一个黄色的小三角形，一个黄色的中圆形和一个黑色的中圆形。中间的盒子里有一个蓝色的中正方形，一个黄色的中三角形，一个蓝色的小圆形和一个黄色的大圆形。右边的盒子里有一个黑色的中圆形和一个黑色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的小正方形，一个黑色的中等正方形，一个黄色的小圆形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的中等圆形，一个黑色的小圆形，一个黑色的小圆形，一个黄色的大正方形。在右边的盒子里，有一个黑色的中等三角形，一个黑色的大正方形，一个黑色的中等圆形，一个蓝色的中等三角形，一个蓝色的中等圆形，一个黄色的小三角形。如何将所有圆形移到中间的盒子中？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "small", "left"], ["black", "round", "middle", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黑色的小圆形和一个黑色的小正方形。中间的盒子里有一个蓝色的小三角形、一个黄色的大正方形和一个黄色的大圆形。右边的盒子里有一个蓝色的大圆形、一个蓝色的小正方形、一个黑色的大正方形、一个黄色的小三角形、一个黄色的大正方形和一个蓝色的小圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "right"], ["blue", "square", "small", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个蓝色的大正方形。中间的盒子里有一个黄色的小三角形、一个黑色的中号圆形、一个黑色的大圆形、一个黄色的大三角形和一个黑色的中号正方形。右边的盒子里有一个黑色的大圆形、一个蓝色的小圆形和一个黑色的中号三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "left"], ["yellow", "triangle", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个大黄三角形。中间的盒子里有一个大黄正方形，一个小黄正方形，一个蓝色小圆形，一个大黄圆形。右边的盒子里有一个蓝色小圆形，一个蓝色小正方形，一个黄色小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["yellow", "square", "small", "right"], ["yellow", "square", "large", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黄色的大三角形。中间的盒子里有一个黄色的大三角形，一个黄色的中等圆形，一个黄色的大圆形。右边的盒子里有一个黑色的大三角形，一个蓝色的小三角形，一个黄色的小三角形，一个蓝色的大圆形，一个黑色的中等三角形。如何将所有的圆形移到右边的盒子？", "label": [["yellow", "round", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个黑色的中等正方形，一个黑色的中等圆形，一个黄色的中等正方形。中间的盒子里有一个黑色的中等圆形，一个黄色的大正方形，一个黑色的中等三角形，一个黑色的中等正方形，一个蓝色的大正方形，一个黑色的中等圆形。右边的盒子里有一个黑色的中等三角形，一个蓝色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "small", "left"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中圆形、一个蓝色的小圆形、一个蓝色的小正方形和一个黄色的中三角形。中间的盒子里有一个黑色的大正方形、一个黄色的中三角形和一个黑色的中圆形。右边的盒子里有一个蓝色的大正方形、一个蓝色的大三角形、一个黄色的小正方形和一个蓝色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个小黑色圆形、一个中等黄色圆形、一个大黄色正方形、一个小黄色圆形和一个小蓝色圆形。中间的盒子里有一个中等黄色三角形和一个大黄色圆形。右边的盒子里有一个中等黑色圆形和一个中等黄色正方形。如何将所有圆形移到右边的盒子里？", "label": [["black", "round", "small", "left"], ["yellow", "round", "middle", "left"], ["yellow", "round", "small", "left"], ["blue", "round", "small", "left"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小正方形，一个蓝色的小三角形，一个黑色的大正方形，一个黑色的大三角形。在中间的盒子里，有一个黑色的大正方形，一个黄色的大正方形，一个黄色的小三角形，一个黑色的中等三角形，一个黑色的中等正方形，一个黑色的大正方形。在右边的盒子里，有一个黄色的大三角形，一个蓝色的小正方形，一个黑色的小正方形，一个黄色的大三角形，一个蓝色的小正方形，一个黑色的大正方形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "square", "large", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形，一个黑色的中等三角形，一个黄色的小正方形，一个蓝色的大圆形，一个黑色的中等三角形，一个黄色的中等正方形。在中间的盒子里，有一个黑色的小圆形，一个黑色的小圆形，一个蓝色的小正方形，一个蓝色的中等三角形，一个黑色的小圆形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的小三角形，一个黄色的小圆形，一个黑色的中等圆形，一个蓝色的大正方形，一个蓝色的大正方形，一个蓝色的大三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "right"], ["black", "round", "middle", "right"], ["black", "round", "small", "middle"], ["black", "round", "small", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形和一个黄色的小圆形。中间的盒子里有一个黄色的小圆形、一个蓝色的小三角形和一个蓝色的中等大小的圆形。右边的盒子里有一个蓝色的大圆形、一个黄色的大三角形、一个蓝色的大正方形、一个蓝色的中等大小的圆形和一个黑色的小三角形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "middle", "left"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黄色的小正方形，一个蓝色的中等三角形，一个黄色的小圆形。在中间的盒子里，有一个黑色的小三角形，一个蓝色的中等圆形，一个黄色的大正方形，一个黑色的大三角形，一个黄色的中等正方形，一个黑色的大正方形。在右边的盒子里，有一个蓝色的中等正方形，一个黑色的小圆形，一个黑色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["black", "square", "small", "right"], ["yellow", "square", "large", "middle"], ["yellow", "square", "middle", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形，一个黑色的小三角形，一个蓝色的中等圆形。中间的盒子里有一个蓝色的中等圆形，一个黄色的大正方形，一个蓝色的大圆形，一个黑色的中等正方形。右边的盒子里有一个蓝色的大圆形，一个黑色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色正方形，一个黑色中等三角形。中间的盒子里有一个蓝色小三角形，一个蓝色中等正方形，一个黑色大三角形。右边的盒子里有一个蓝色小圆形，一个黄色中等三角形，一个黄色小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黑色的小三角形，一个黑色的小三角形，一个蓝色的大圆形。在中间的盒子里，有一个黄色的大正方形，一个黄色的大正方形，一个黑色的大正方形，一个蓝色的小正方形，一个黄色的小正方形。在右边的盒子里，有一个黄色的大三角形，一个蓝色的大正方形，一个黑色的小正方形，一个蓝色的大圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["blue", "round", "large", "right"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形，一个蓝色的大正方形，一个黄色的大三角形，一个蓝色的中等圆形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的中等圆形，一个黄色的大正方形，一个蓝色的小三角形，一个蓝色的大正方形，一个蓝色的小正方形，一个黑色的小正方形。在右边的盒子里，有一个黄色的小三角形，一个蓝色的中等三角形，一个黄色的大圆形，一个蓝色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "large", "left"], ["blue", "round", "middle", "left"], ["blue", "triangle", "middle", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个小黄圆形，一个小蓝圆形。中间的盒子里有一个中蓝三角形，一个小黑三角形，一个小黄三角形，一个大蓝三角形，一个大黄正方形，一个大蓝正方形。右边的盒子里有一个中黑三角形，一个小蓝三角形，一个大黄三角形。如何将所有三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["black", "triangle", "middle", "right"], ["blue", "triangle", "small", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的中圆形，一个黄色的中圆形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的中等三角形，一个蓝色的大正方形，一个黑色的大正方形，一个黑色的小正方形，一个蓝色的小正方形，一个黑色的大正方形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的大三角形，一个黄色的大圆形，一个黑色的中正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "middle", "right"], ["black", "square", "large", "middle"], ["black", "square", "small", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黑色的中圆形，一个黑色的小三角形，一个黄色的大三角形。在中间的盒子里，有一个黄色的大正方形，一个黄色的中圆形。在右边的盒子里，有一个黄色的大正方形，一个黄色的中三角形，一个黄色的小圆形，一个黑色的小正方形，一个黑色的中三角形，一个黑色的大正方形。如何将所有正方形移动到右边的盒子里？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的中等正方形，一个黄色的小圆形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的小圆形，一个黑色的小三角形，一个黄色的大圆形，一个蓝色的大三角形，一个黄色的中等正方形。在右边的盒子里，有一个黄色的大正方形，一个黑色的小正方形，一个黄色的大圆形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "middle", "left"], ["blue", "round", "small", "left"], ["blue", "triangle", "small", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黄色的小正方形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的大正方形，一个黑色的大三角形，一个蓝色的小正方形，一个蓝色的中等大小的正方形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的中等大小的圆形，一个蓝色的大正方形，一个黑色的小正方形，一个黄色的中等大小的正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的中圆形，一个黄色的大正方形，一个黑色的中三角形，一个黄色的大正方形，一个蓝色的中三角形。在中间的盒子里，有一个蓝色的小正方形，一个黑色的中正方形，一个黑色的小正方形，一个黄色的小三角形，一个黄色的中三角形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小正方形，一个蓝色的大圆形，一个黄色的小正方形，一个黄色的中正方形，一个黄色的中正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "middle", "left"], ["black", "square", "middle", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的小圆形，一个黄色的大三角形，一个黑色的大正方形，一个蓝色的中等正方形，一个黑色的中等正方形。在中间的盒子里，有一个黑色的中等正方形，一个黑色的小圆形，一个黄色的大圆形，一个黄色的小三角形，一个黑色的中等三角形。在右边的盒子里，有一个黄色的大圆形，一个黑色的小圆形，一个黑色的大三角形，一个黑色的大正方形，一个蓝色的小正方形。如何将所有正方形移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["blue", "square", "middle", "left"], ["black", "square", "middle", "left"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形，一个蓝色的小三角形，一个蓝色的中等圆形，一个黄色的大圆形，一个黑色的大正方形，一个黄色的大正方形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的中等圆形，一个黑色的大三角形，一个黑色的中等圆形。在右边的盒子里，有一个黄色的小正方形，一个黄色的小正方形，一个黄色的大正方形，一个蓝色的小三角形，一个蓝色的小三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "right"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形，一个蓝色的大三角形，一个黑色的大正方形。中间的盒子里有一个蓝色的大圆形，一个黑色的小三角形，一个蓝色的中等大小的正方形。右边的盒子里有一个黑色的中等大小的三角形，一个黑色的中等大小的圆形，一个黄色的小正方形，一个黑色的大圆形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "left"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形和一个蓝色的中圆形。中间的盒子里有一个黑色的大正方形和一个黑色的小三角形。右边的盒子里有一个黄色的中圆形、一个黄色的大三角形和一个黄色的中三角形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "round", "small", "left"], ["black", "square", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中号圆形、一个黄色的中号正方形、一个蓝色的中号三角形、一个蓝色的小号圆形。在中间的盒子里，有一个蓝色的中号正方形、一个蓝色的大号三角形、一个黄色的中号圆形、一个蓝色的大号正方形、一个蓝色的大号圆形。在右边的盒子里，有一个黑色的中号三角形、一个黄色的中号正方形、一个黄色的中号圆形、一个蓝色的中号圆形。如何将所有黑色的物品移到中间的盒子里？", "label": [["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形和一个蓝色的小三角形。中间的盒子里有一个黑色的中等大小的正方形、一个蓝色的小三角形、一个黄色的中等大小的三角形和一个黑色的小圆形。右边的盒子里有一个蓝色的中等大小的圆形、一个黄色的中等大小的正方形、一个黑色的大圆形和一个蓝色的中等大小的正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的小三角形，一个黄色的中等正方形，一个黑色的大圆形，一个黄色的小正方形。在中间的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个蓝色的中等圆形。在右边的盒子里，有一个黄色的小正方形，一个黑色的小圆形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "small", "left"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形，一个蓝色的小三角形，一个蓝色的中圆形，一个黄色的大圆形，一个黑色的小正方形，一个蓝色的中圆形。在中间的盒子里，有一个黄色的小三角形，一个蓝色的中圆形，一个黑色的大正方形，一个黑色的小圆形，一个黄色的中三角形。在右边的盒子里，有一个黄色的小正方形，一个黑色的小三角形，一个黄色的大圆形，一个蓝色的中正方形，一个黄色的中圆形，一个黄色的小圆形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["black", "square", "small", "left"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形、一个中等黑色三角形、一个小黄色三角形和一个小黄色圆形。中间的盒子里有一个蓝色中等圆形、一个黄色中等三角形、一个蓝色大圆形、一个小黑色圆形、一个蓝色中等三角形和一个蓝色中等圆形。右边的盒子里有一个黑色大三角形和一个黄色大三角形。如何将所有圆形移到右边的盒子里？", "label": [["black", "round", "small", "left"], ["yellow", "round", "small", "left"], ["blue", "round", "middle", "middle"], ["blue", "round", "large", "middle"], ["black", "round", "small", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个蓝色的小正方形。中间的盒子里有一个黄色的小三角形、一个蓝色的小三角形、一个黑色的中等三角形、一个蓝色的中等圆形、一个黑色的中等圆形和一个黑色的小三角形。右边的盒子里有一个蓝色的中等正方形、一个黑色的中等三角形、一个蓝色的大正方形和一个黄色的中等圆形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "middle", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黑色的大圆形，一个黑色的中等三角形，一个黄色的大正方形，一个蓝色的大三角形，一个黄色的小正方形。在中间的盒子里，有一个黑色的大正方形，一个黄色的大正方形，一个蓝色的大正方形，一个黄色的小正方形。在右边的盒子里，有一个黑色的大三角形，一个黄色的大三角形，一个蓝色的中等三角形，一个黑色的小圆形，一个黑色的中等三角形，一个黄色的大三角形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个蓝色的大圆形。在中间的盒子里，有一个黄色的大三角形，一个蓝色的中等大小的正方形，一个黄色的小圆形，一个黑色的中等大小的正方形，一个黑色的大正方形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的中等大小的正方形，一个蓝色的大正方形，一个黄色的大三角形，一个蓝色的大正方形。如何将所有正方形移动到中间的盒子？", "label": [["blue", "square", "middle", "right"], ["blue", "square", "large", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等圆形、一个蓝色的中等正方形、一个蓝色的中等圆形、一个蓝色的中等三角形、一个黑色的大圆形和一个黑色的中等三角形。在中间的盒子里，有一个蓝色的大圆形、一个黑色的中等正方形、一个黄色的小圆形、一个黑色的中等正方形、一个黄色的小三角形和一个黄色的大圆形。在右边的盒子里，有一个蓝色的小圆形、一个蓝色的大正方形、一个黄色的中等正方形、一个蓝色的大正方形和一个蓝色的小正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "round", "small", "middle"], ["yellow", "triangle", "small", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形、一个蓝色的小三角形、一个黑色的中间三角形和一个黄色的中间三角形。中间的盒子里有一个黄色的中间圆形和一个黑色的中间正方形。右边的盒子里有一个黄色的中间圆形和一个黑色的小圆形。如何将所有黑色物品移动到中间的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "triangle", "middle", "left"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形和一个黄色的中间圆形。中间的盒子里有一个蓝色的小正方形、一个黄色的大圆形、一个蓝色的小正方形和一个蓝色的中间正方形。右边的盒子里有一个黑色的中间圆形、一个黑色的大正方形、一个黄色的中间正方形、一个蓝色的小圆形、一个蓝色的大圆形和一个黑色的小正方形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形，一个蓝色的小三角形。中间的盒子里有一个黑色的小正方形，一个蓝色的中等大小的圆形，一个蓝色的大三角形，一个蓝色的中等大小的三角形，一个黄色的大正方形。右边的盒子里有一个蓝色的大三角形，一个蓝色的大正方形，一个黑色的小圆形，一个黄色的中等大小的三角形，一个黄色的大正方形，一个蓝色的小正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "small", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的大正方形，一个蓝色的大三角形，一个蓝色的小正方形，一个黑色的小圆形。在中间的盒子里，有一个黄色的中等三角形，一个黑色的小三角形，一个黑色的小正方形，一个黑色的大圆形，一个蓝色的中等圆形，一个黑色的小正方形。在右边的盒子里，有一个黑色的大正方形，一个黄色的中等圆形，一个蓝色的大三角形，一个蓝色的中等圆形，一个黑色的小圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "round", "small", "left"], ["black", "triangle", "small", "middle"], ["black", "square", "small", "middle"], ["black", "round", "large", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黄色的中等圆形，一个蓝色的大正方形，一个黑色的中等圆形，一个黑色的大圆形。在中间的盒子里，有一个黑色的大三角形，一个黄色的中等三角形，一个黑色的大正方形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的大圆形，一个黑色的大三角形，一个黄色的中等圆形，一个蓝色的小圆形，一个黑色的小三角形，一个黄色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的大三角形，一个黄色的大正方形，一个黄色的大圆形和一个蓝色的大圆形。在中间的盒子里，有一个黄色的大三角形，一个黑色的小正方形和一个黄色的大正方形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的小圆形，一个黄色的中等大小的正方形和一个蓝色的中等大小的圆形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "square", "large", "left"], ["yellow", "round", "large", "left"], ["yellow", "triangle", "large", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的小圆形，一个黑色的大圆形，一个蓝色的中等正方形，一个黄色的中等圆形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的小圆形，一个蓝色的大圆形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的大三角形，一个黄色的大三角形，一个黄色的中等三角形，一个黑色的小圆形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色圆形，一个大黑色正方形，一个小蓝色圆形，一个小蓝色三角形，一个中等大小的黑色三角形。在中间的盒子里，有一个中等大小的黑色三角形，一个小黄色圆形，一个中等大小的蓝色圆形，一个大黑色三角形，一个小蓝色正方形。在右边的盒子里，有一个小黄色正方形，一个大黄色圆形，一个小蓝色正方形，一个大黄色圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "round", "large", "right"], ["yellow", "round", "large", "right"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的中等圆形，一个黑色的小三角形，一个黑色的小三角形。在中间的盒子里，有一个黄色的小正方形，一个黑色的大正方形，一个黑色的小正方形，一个黑色的中等圆形。在右边的盒子里，有一个黑色的小圆形，一个蓝色的中等圆形，一个黑色的中等正方形，一个蓝色的小正方形，一个黄色的小正方形，一个黑色的中等圆形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的大圆形和一个蓝色的大圆形。中间的盒子里有一个黄色的小圆形和一个黄色的中等三角形。右边的盒子里有一个黑色的中等圆形和一个黄色的小正方形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个蓝色的小圆形，一个蓝色的大圆形。中间的盒子里有一个黑色的小三角形，一个蓝色的小圆形，一个黑色的小三角形。右边的盒子里有一个黄色的中等圆形，一个蓝色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "small", "left"], ["blue", "round", "large", "left"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形，一个黄色的小正方形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的中等大小正方形，一个黑色的大三角形，一个蓝色的中等大小正方形，一个黄色的小正方形，一个蓝色的大圆形。在右边的盒子里，有一个黄色的小正方形，一个黄色的中等大小圆形，一个黄色的大正方形，一个黑色的小正方形，一个蓝色的中等大小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "small", "right"], ["yellow", "round", "middle", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个蓝色的大正方形、一个黑色的中等三角形、一个蓝色的小正方形、一个黄色的小圆形和一个黑色的大圆形。中间的盒子里有一个蓝色的小圆形、一个黄色的小三角形和一个蓝色的中等圆形。右边的盒子里有一个蓝色的中等正方形和一个黄色的中等圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "large", "left"], ["yellow", "round", "small", "left"], ["black", "round", "large", "left"], ["blue", "round", "small", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形、一个黑色的中等圆形、一个黄色的大圆形、一个蓝色的小圆形、一个黑色的中等正方形和一个黑色的小正方形。中间的盒子里有一个黑色的大三角形、一个黑色的大正方形和一个黄色的大正方形。右边的盒子里有一个黑色的中等正方形和一个蓝色的大正方形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "right"], ["blue", "square", "large", "right"], ["black", "square", "large", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黄色的小三角形和一个蓝色的中等正方形。在中间的盒子里，有一个黄色的大正方形，一个黑色的中等圆形，一个蓝色的小三角形和一个黄色的大圆形。在右边的盒子里，有一个蓝色的中等圆形，一个黑色的大正方形，一个黑色的大正方形，一个蓝色的小正方形，一个蓝色的小正方形和一个蓝色的中等正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的小圆形，一个蓝色的中等圆形，一个蓝色的小三角形，一个黑色的中等三角形，一个黄色的小圆形。在中间的盒子里，有一个黄色的大三角形，一个黄色的中等三角形，一个黑色的中等正方形。在右边的盒子里，有一个黄色的小三角形，一个黄色的大正方形，一个黑色的中等正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形和一个蓝色的小正方形。中间的盒子里有一个蓝色的小圆形和一个黑色的中号三角形。右边的盒子里有一个蓝色的小圆形、一个蓝色的中号圆形、一个蓝色的大号圆形、一个黄色的小正方形和一个黄色的大号三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "middle", "left"], ["blue", "round", "small", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的大圆形，一个黄色的大圆形，一个蓝色的小三角形，一个蓝色的中等正方形，一个蓝色的中等三角形。在中间的盒子里，有一个黄色的中等圆形，一个黑色的中等圆形，一个黑色的小三角形，一个黑色的中等三角形，一个黄色的中等三角形。在右边的盒子里，有一个黑色的中等圆形，一个黑色的大圆形，一个黄色的大正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "round", "large", "right"], ["black", "round", "middle", "middle"], ["black", "triangle", "small", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的小圆形，一个黑色的小正方形，一个黑色的大三角形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的大圆形，一个蓝色的大三角形，一个蓝色的大三角形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的中等正方形，一个蓝色的大正方形，一个黄色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"], ["black", "triangle", "large", "left"], ["yellow", "triangle", "small", "left"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的大三角形和一个黄色的小正方形。中间的盒子里有一个蓝色的中等大小的圆形、一个黑色的大正方形、一个黑色的大圆形和一个黑色的大正方形。右边的盒子里有一个蓝色的大圆形、一个黑色的中等大小的三角形、一个蓝色的中等大小的三角形和一个黑色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "right"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个中等黄色正方形、一个小黑色三角形和一个大黄色三角形。中间的盒子里有一个蓝色中等正方形、一个黑色中等圆形和一个大蓝色三角形。右边的盒子里有一个黄色中等正方形、一个黄色中等正方形、一个黄色中等正方形、一个大黄色圆形、一个小黄色三角形和一个黄色中等圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的中等正方形，一个黑色的大正方形，一个黄色的中等正方形，一个黑色的中等正方形，一个黄色的中等圆形。在中间的盒子里，有一个蓝色的中等三角形，一个蓝色的中等圆形，一个黑色的大圆形，一个黑色的大圆形，一个黑色的小正方形，一个黑色的中等三角形。在右边的盒子里，有一个黑色的小正方形，一个黄色的大圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "round", "middle", "left"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形、一个蓝色的大圆形、一个黄色的大三角形、一个黄色的中等三角形、一个黑色的小三角形和一个黑色的大圆形。中间的盒子里有一个黄色的大圆形、一个蓝色的大三角形、一个蓝色的小三角形和一个黄色的中等圆形。右边的盒子里有一个蓝色的大三角形、一个黄色的中等三角形和一个黄色的大三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"], ["black", "triangle", "small", "left"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的大三角形、一个黄色的大圆形、一个黑色的大圆形、一个黑色的中等三角形和一个黄色的中等三角形。中间的盒子里有一个黄色的中等圆形、一个黑色的大三角形和一个蓝色的大正方形。右边的盒子里有一个黄色的大正方形和一个蓝色的中等圆形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "middle", "right"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形和一个黄色的小圆形。中间的盒子里有一个黑色的大正方形、一个黄色的小正方形、一个黄色的中等三角形、一个黑色的小正方形和一个黑色的中等三角形。右边的盒子里有一个黄色的大正方形、一个黄色的小圆形、一个黄色的中等正方形和一个蓝色的小正方形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["yellow", "square", "large", "right"], ["yellow", "square", "middle", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个蓝色的小正方形、一个蓝色的大三角形和一个蓝色的小圆形。中间的盒子里有一个黄色的中等大小的正方形、一个黑色的小三角形和一个黑色的中等大小的圆形。右边的盒子里有一个黑色的小三角形、一个蓝色的大正方形、一个蓝色的小正方形和一个黑色的小三角形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "small", "right"], ["black", "triangle", "small", "right"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的大正方形、一个蓝色的小圆形。中间的盒子里有一个黄色的中等三角形、一个蓝色的大圆形、一个蓝色的中等圆形。右边的盒子里有一个蓝色的大三角形、一个蓝色的中等三角形、一个蓝色的大正方形。如何将所有黑色物体移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个小黑色正方形，一个大黄色圆形，一个中等大小的黑色三角形，一个中等大小的蓝色圆形。在中间的盒子里，有一个中等大小的黄色圆形，一个大黑色三角形，一个大蓝色圆形。在右边的盒子里，有一个中等大小的黄色正方形，一个中等大小的蓝色正方形，一个中等大小的黑色正方形，一个大黑色圆形，一个大蓝色三角形，一个中等大小的黄色正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "square", "small", "left"], ["black", "triangle", "middle", "left"], ["black", "square", "middle", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的大正方形，一个黄色的大圆形，一个黄色的中等正方形，两个黄色的大三角形。在右边的盒子里，有两个黑色的大三角形，一个黄色的大圆形，一个黑色的小三角形，一个黑色的小正方形，一个黑色的中等正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的大三角形和一个黄色的中等圆形。中间的盒子里有一个黑色的大三角形和一个黄色的大正方形。右边的盒子里有一个黄色的中等圆形、一个蓝色的大三角形、一个黑色的小圆形、一个黑色的大三角形和一个黑色的小圆形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个黄色的大三角形。中间的盒子里有一个黑色的中等大小的圆形，一个蓝色的小正方形。右边的盒子里有一个蓝色的中等大小的圆形，一个蓝色的小三角形，一个黑色的小三角形，一个蓝色的小圆形，一个黑色的小正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "middle", "left"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的大正方形，一个黄色的大正方形，一个蓝色的小三角形。在中间的盒子里，有一个蓝色的大三角形，一个黄色的小三角形，一个黄色的中等大小的正方形。在右边的盒子里，有一个黑色的中等大小的圆形，一个蓝色的中等大小的圆形，一个黑色的小三角形，一个蓝色的小三角形，一个黑色的小圆形，一个黄色的大圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["blue", "triangle", "small", "left"], ["black", "triangle", "small", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形和一个黑色的大正方形。在中间的盒子里，有一个蓝色的中等三角形、一个黑色的小正方形、一个蓝色的大正方形、一个蓝色的大圆形、一个蓝色的小正方形和一个黄色的大圆形。在右边的盒子里，有一个黄色的大正方形和一个黑色的大正方形。如何将所有黄色物体移到右边的盒子里？", "label": [["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等大小的正方形和一个黑色的大正方形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大三角形、一个黑色的小正方形、一个蓝色的小正方形、一个蓝色的小三角形和一个蓝色的大圆形。右边的盒子里有一个黑色的中等大小的正方形、一个蓝色的大正方形、一个黑色的中等大小的正方形和一个黑色的大正方形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "square", "middle", "right"], ["black", "square", "middle", "right"], ["black", "square", "large", "right"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个黄色的大圆形，一个黄色的中圆形，一个黑色的大三角形。在中间的盒子里，有一个蓝色的中圆形，一个黄色的中正方形，一个黄色的小三角形。在右边的盒子里，有一个黄色的中三角形，一个黄色的小圆形，一个蓝色的中圆形，一个黄色的小圆形，一个黑色的中圆形，一个黄色的小圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "large", "left"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的中圆形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的小三角形，一个蓝色的小正方形，一个黄色的中圆形，一个黄色的小三角形，一个黑色的中三角形。在右边的盒子里，有一个黄色的小三角形，一个黑色的小正方形，一个蓝色的中正方形，一个蓝色的大正方形，一个蓝色的中正方形，一个黑色的小正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的小正方形和一个黑色的中等正方形。中间的盒子里有一个蓝色的小三角形、一个黑色的中等圆形和一个黑色的大正方形。右边的盒子里有一个黑色的中等正方形、一个蓝色的中等圆形、一个黄色的小圆形和一个黑色的中等三角形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "large", "left"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形，一个黄色的中等三角形。中间的盒子里有一个黄色的小正方形，一个黑色的大圆形，一个蓝色的小圆形，一个黄色的大三角形。右边的盒子里有一个黄色的小正方形，一个蓝色的大圆形，一个黄色的小正方形，一个黑色的大圆形，一个蓝色的小正方形，一个黄色的小圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "square", "small", "right"], ["yellow", "round", "small", "right"], ["yellow", "square", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大圆形、一个蓝色的大三角形、一个黑色的大正方形、一个黄色的中等正方形、一个蓝色的大圆形。在中间的盒子里，有一个蓝色的小三角形、一个蓝色的大三角形、一个黑色的大三角形。在右边的盒子里，有一个黄色的小三角形、一个蓝色的大圆形、一个黑色的中等圆形、一个黄色的中等圆形、一个蓝色的大圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的大正方形，一个蓝色的大三角形，一个黄色的大三角形，一个黑色的中等三角形，一个黄色的大三角形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的小三角形，一个黄色的小三角形。在右边的盒子里，有一个黑色的小三角形，一个黑色的大圆形，一个黑色的大三角形，一个蓝色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "small", "right"], ["black", "triangle", "large", "right"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "small", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个蓝色的大正方形和一个黑色的小圆形。中间的盒子里有一个黑色的小三角形、一个黄色的小圆形、一个黄色的小正方形、一个黑色的小三角形、一个黄色的大三角形和一个蓝色的大圆形。右边的盒子里有一个黄色的小正方形、一个蓝色的小圆形、一个蓝色的中号正方形、一个蓝色的大三角形和一个蓝色的小圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "small", "middle"], ["black", "triangle", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中圆形、一个黄色的小正方形、一个蓝色的小正方形、一个黑色的大三角形和一个蓝色的中正方形。中间的盒子里有一个蓝色的中正方形、一个黄色的小三角形和一个蓝色的中圆形。右边的盒子里有一个黄色的大三角形、一个黑色的小三角形、一个黑色的中圆形和一个黑色的小正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "small", "left"], ["blue", "square", "middle", "left"], ["blue", "square", "middle", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的大三角形，一个黄色的中等圆形，一个黑色的小正方形，一个黄色的小三角形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的中等正方形，一个黑色的小正方形，一个黄色的大正方形，一个蓝色的中等圆形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的大圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "large", "left"], ["black", "square", "small", "left"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黄色的中间三角形，一个黄色的大正方形，一个黄色的中间三角形，一个黄色的中间圆形，一个黑色的小三角形。在中间的盒子里，有一个黑色的中间圆形，一个黑色的小正方形，一个黄色的中间正方形，一个黄色的小圆形。在右边的盒子里，有一个黑色的小正方形，一个黑色的小圆形，一个黄色的小正方形，一个黄色的中间正方形。如何将所有正方形移动到右边的盒子里？", "label": [["blue", "square", "middle", "left"], ["yellow", "square", "large", "left"], ["black", "square", "small", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黄色的大三角形。中间的盒子里有一个黑色的大正方形、一个黄色的小圆形和一个黄色的小三角形。右边的盒子里有一个蓝色的大三角形、一个黑色的大三角形、一个蓝色的小三角形、一个黄色的中等大小的正方形、一个蓝色的中等大小的三角形和一个黑色的中等大小的三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "small", "left"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "small", "right"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的中等正方形，一个黄色的小正方形，一个黑色的小三角形。在中间的盒子里，有一个蓝色的中等三角形，一个蓝色的中等三角形。在右边的盒子里，有一个蓝色的小圆形，一个黑色的大三角形，一个黑色的小圆形，一个黄色的小三角形，一个黑色的小三角形，一个蓝色的大正方形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "middle", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个黄色中等三角形，一个黄色大三角形，一个蓝色中等正方形，一个蓝色大正方形，一个蓝色大三角形。在中间的盒子里，有一个蓝色中等圆形，一个小黄色圆形，一个蓝色大三角形，一个蓝色小三角形。在右边的盒子里，有一个黄色中等正方形，一个蓝色小圆形，一个黄色大正方形，一个黄色小圆形，一个黑色大正方形，一个蓝色小圆形。如何将所有黑色物体移动到中间的盒子？", "label": [["black", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个黄色的大圆形、一个蓝色的小三角形、一个蓝色的小圆形、一个蓝色的中等三角形和一个黄色的中等三角形。中间的盒子里有一个黑色的中等圆形和一个黄色的大正方形。右边的盒子里有一个黄色的大三角形、一个蓝色的小圆形、一个黄色的大三角形和一个黑色的中等正方形。如何将所有黑色物品移到右边的盒子中？", "label": [["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黑色的中等圆形，一个黑色的小正方形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的中等三角形，一个黄色的大正方形，一个黄色的小三角形，一个黄色的小正方形。在右边的盒子里，有一个黄色的小三角形，一个黑色的大圆形，一个黄色的小三角形，一个黑色的小圆形，一个蓝色的小正方形，一个黑色的中等正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中号圆形、一个蓝色的中号正方形、一个黑色的小正方形、两个黑色的小圆形和一个黑色的大正方形。在中间的盒子里，有一个黑色的中号圆形和两个黄色的小正方形。在右边的盒子里，有一个黄色的中号正方形、一个黑色的小三角形、一个黄色的大圆形和一个黑色的中号三角形。如何将所有蓝色物品移到右边的盒子里？", "label": [["blue", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的小三角形，一个黄色的小圆形，一个蓝色的小正方形，一个黄色的小圆形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的小圆形，一个黑色的大圆形。在右边的盒子里，有一个蓝色的中等三角形，一个黑色的大正方形，一个蓝色的小圆形，一个黑色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小三角形、一个蓝色的中等三角形、一个蓝色的小圆形和一个蓝色的大圆形。中间的盒子里有一个蓝色的大三角形、一个黑色的小正方形和一个黄色的中等正方形。右边的盒子里有一个蓝色的中等三角形、一个黑色的小正方形和一个蓝色的中等圆形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["blue", "triangle", "middle", "left"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个蓝色的中等正方形、一个黄色的小三角形和一个黑色的中等三角形。中间的盒子里有一个蓝色的大正方形和一个蓝色的大三角形。右边的盒子里有一个黑色的小三角形、一个蓝色的中等圆形、一个黄色的中等正方形和一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["black", "triangle", "middle", "left"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个蓝色的中间圆形，一个黑色的中间圆形，一个黑色的小正方形，一个蓝色的小正方形。在中间的盒子里，有一个黄色的中间三角形，一个蓝色的大正方形，一个黑色的中间圆形，一个蓝色的中间三角形，一个黄色的大三角形，一个蓝色的中间圆形。在右边的盒子里，有一个黑色的中间圆形，一个蓝色的中间正方形，一个蓝色的小圆形，一个黑色的中间正方形，一个黑色的中间三角形，一个黄色的小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "square", "middle", "right"], ["black", "triangle", "middle", "right"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等大小的正方形，一个蓝色的小圆形，一个黑色的大正方形，一个黄色的小正方形，一个黑色的大正方形，一个黑色的小正方形。在中间的盒子里，有一个黑色的小三角形，一个蓝色的大正方形，一个黄色的小三角形，一个黑色的大三角形，一个蓝色的小正方形，一个蓝色的中等大小的圆形。在右边的盒子里，有一个黄色的大圆形，一个黑色的大正方形，一个黑色的小三角形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "middle", "left"], ["blue", "round", "small", "left"], ["blue", "square", "large", "middle"], ["blue", "square", "small", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黑色的小三角形，一个蓝色的大正方形，一个黑色的小三角形，一个黑色的大圆形。在中间的盒子里，有一个黄色的大圆形，一个黑色的大圆形。在右边的盒子里，有一个黑色的中等圆形，一个黑色的中等三角形，一个黄色的中等三角形，一个黑色的小正方形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个黑色的大正方形、一个黑色的大圆形、一个黑色的大三角形。中间的盒子里有一个黄色的小圆形、一个黑色的小圆形、一个黑色的大圆形、一个黑色的小圆形、一个黄色的大圆形、一个黑色的中号圆形。右边的盒子里有一个蓝色的中号圆形、一个黄色的小三角形、一个黄色的大三角形、一个黄色的中号正方形、一个黄色的小三角形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黑色的大三角形，一个蓝色的中等圆形，一个黑色的小三角形，一个黄色的大圆形，一个黄色的大三角形。在中间的盒子里，有一个蓝色的中等圆形，一个黑色的中等圆形，一个黑色的中等正方形，一个黄色的大圆形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的中等三角形，一个黑色的小圆形，一个黄色的中等三角形，一个黄色的中等圆形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "large", "left"], ["black", "triangle", "small", "left"], ["yellow", "triangle", "large", "left"], ["blue", "triangle", "middle", "right"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小黄三角形和一个蓝色中等三角形。中间的盒子里有一个黄色中等三角形、一个黑色中等三角形、一个蓝色中等正方形、一个黑色大圆形、一个小黄正方形和一个小黄三角形。右边的盒子里有一个黑色小三角形、一个蓝色中等正方形、一个蓝色中等圆形、一个黄色大三角形和一个黄色中等三角形。如何将所有圆形移到左边的盒子中？", "label": [["blue", "round", "middle", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黑色的大圆形、一个黄色的大三角形、一个黄色的小圆形和一个黑色的中等大小的圆形。中间的盒子里有一个黄色的大正方形和一个黑色的中等大小的圆形。右边的盒子里有一个黄色的大正方形、一个蓝色的小三角形和一个黑色的大三角形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的小圆形，一个蓝色的大正方形。在中间的盒子里，有一个黑色的中等三角形，一个黄色的小三角形，一个黄色的中等圆形，一个黄色的大正方形，一个黑色的大三角形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的大正方形，一个黑色的大正方形，一个黑色的小正方形，一个黄色的中等圆形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "small", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黄色的中间正方形，一个黑色的中间正方形，一个蓝色的大圆形，一个蓝色的大圆形。在中间的盒子里，有一个黄色的中间正方形，一个黑色的中间三角形，一个蓝色的大三角形，一个黄色的小圆形，一个黑色的小三角形，一个黄色的中间正方形。在右边的盒子里，有一个蓝色的中间圆形，一个蓝色的大三角形，一个蓝色的中间正方形，一个黑色的小圆形，一个黑色的小圆形，一个黄色的小正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "left"], ["blue", "round", "large", "left"], ["blue", "round", "large", "left"], ["blue", "round", "middle", "right"], ["blue", "triangle", "large", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个黑色中圆形，一个黑色中三角形，一个蓝色小三角形。在中间的盒子里，有一个大黄色圆形，一个大黄色正方形。在右边的盒子里，有一个蓝色小三角形，一个蓝色小三角形，一个黑色中圆形，一个大黄色三角形。如何将所有蓝色物品移动到中间的盒子中？", "label": [["blue", "triangle", "small", "left"], ["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个黄色的大圆形。中间的盒子里有一个黑色的小三角形和一个黄色的小三角形。右边的盒子里有一个黄色的大三角形，一个黄色的中等大小的正方形和一个蓝色的中等大小的正方形。如何将所有的圆形移到左边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形和一个黑色的小正方形。中间的盒子里有一个黑色的小三角形、一个黑色的中号圆形和一个黑色的中号三角形。右边的盒子里有一个黑色的大圆形、一个黑色的大正方形、一个黑色的中号正方形、一个黄色的大三角形、一个黑色的小正方形和一个蓝色的中号三角形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形和一个黑色的大圆形。中间的盒子里有一个蓝色的小三角形、一个黄色的小正方形、一个蓝色的中等三角形、一个黄色的小三角形、一个黑色的小圆形和一个黑色的大圆形。右边的盒子里有一个黑色的大三角形、一个黄色的小正方形和一个蓝色的中等正方形。如何将所有黑色物品移到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "round", "large", "left"], ["black", "round", "small", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的大三角形，一个蓝色的中等三角形，一个黄色的小三角形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的大三角形，一个黄色的中等正方形，一个黄色的中等圆形，一个黄色的中等圆形，一个蓝色的大圆形。在右边的盒子里，有一个蓝色的中等三角形，一个蓝色的大三角形，两个蓝色的小三角形，一个黄色的中等三角形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"], ["yellow", "triangle", "small", "left"], ["blue", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "right"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的小正方形，一个黑色的小圆形，一个黄色的中等三角形，一个黑色的大圆形。在中间的盒子里，有一个黄色的中等圆形，一个黑色的小正方形，一个黑色的大正方形，一个蓝色的小三角形，一个黄色的大三角形，一个蓝色的小三角形。在右边的盒子里，有一个黄色的中等正方形，一个黄色的小三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "round", "middle", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "你好，有三个盒子。在左边的盒子里，有一个小黑色圆形，一个黄色中等三角形，一个黄色中等圆形，一个蓝色中等正方形。在中间的盒子里，有一个小黑色三角形，一个黄色中等圆形，一个蓝色大圆形。在右边的盒子里，有一个蓝色大三角形，一个小黑色圆形，一个小黑色三角形，一个蓝色大正方形，一个蓝色小圆形，一个蓝色小三角形。请问如何将所有正方形移动到右边的盒子里？", "label": [["blue", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的中圆形，一个黑色的小圆形，一个黄色的小圆形，一个蓝色的中正方形。在中间的盒子里，有一个蓝色的中圆形，一个蓝色的小三角形，一个黑色的小正方形，一个黄色的小三角形，一个黑色的小圆形，一个黄色的小圆形。在右边的盒子里，有一个黑色的中圆形，一个蓝色的大正方形，一个黄色的大圆形，一个黑色的大三角形，一个蓝色的中三角形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "left"], ["yellow", "triangle", "small", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个小黄色圆形，一个小黄色圆形，一个小蓝色正方形，一个小蓝色正方形，一个中等大小的黄色圆形。在中间的盒子里，有一个小蓝色三角形，一个中等大小的黄色圆形。在右边的盒子里，有一个中等大小的黑色圆形，一个大蓝色圆形，一个小蓝色圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "small", "left"], ["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的中等正方形，一个黑色的中等正方形，一个蓝色的中等三角形。在中间的盒子里，有一个黑色的小正方形，一个蓝色的大三角形。在右边的盒子里，有一个黄色的小圆形，一个黄色的中等正方形，一个黄色的小三角形，一个蓝色的大圆形，一个黄色的大三角形。如何将所有黑色物体移动到中间的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形和一个黑色的中间三角形。在中间的盒子里，有一个蓝色的大圆形、一个蓝色的大三角形、一个黑色的中间圆形、一个黑色的中间圆形和一个黄色的中间正方形。在右边的盒子里，有一个蓝色的大圆形、一个蓝色的大圆形、一个蓝色的小三角形和一个黑色的大正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "round", "large", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的大圆形，一个黄色的小正方形，一个蓝色的大正方形，一个黄色的大三角形，一个黑色的中圆形。在中间的盒子里，有一个黑色的小圆形，一个黄色的中圆形，一个黑色的小正方形，一个黄色的小圆形，一个黄色的大三角形。在右边的盒子里，有一个黄色的中圆形，一个黄色的小三角形，一个黄色的中圆形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个黑色中等三角形，一个黑色中等三角形，一个黑色大三角形，一个黄色中等圆形，一个蓝色中等正方形。在中间的盒子里，有一个小黑色正方形，一个黄色中等三角形，一个黄色大正方形，一个蓝色中等圆形，一个黑色大三角形，一个蓝色大圆形。在右边的盒子里，有一个黑色中等正方形，一个黑色大三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个蓝色的大圆形，一个蓝色的小正方形，一个黄色的小三角形，一个蓝色的大圆形，一个黑色的小圆形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的小圆形，一个黄色的大三角形。在右边的盒子里，有一个黄色的中等正方形，一个蓝色的中等三角形，一个黑色的中等三角形，一个黄色的中等圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "large", "left"], ["blue", "square", "small", "left"], ["blue", "round", "large", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形和一个黄色的中等圆形。中间的盒子里有一个黑色的大三角形和一个黑色的中等正方形。右边的盒子里有一个小黄色的圆形、一个蓝色的中等圆形、一个小黄色的圆形、一个蓝色的中等圆形、一个黄色的中等正方形和一个黑色的大正方形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "large", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个黑色中等正方形、一个小黄色圆形、一个黄色中等三角形、一个黑色中等正方形。中间的盒子里有一个蓝色大圆形、一个黄色大圆形、一个蓝色大圆形、一个小黄色三角形。右边的盒子里有一个黑色中等三角形、一个小黄色圆形。如何将所有圆形移到左边的盒子中？", "label": [["yellow", "round", "small", "right"], ["blue", "round", "large", "middle"], ["yellow", "round", "large", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的中等正方形，一个黑色的大正方形。在中间的盒子里，有一个黄色的中等正方形，一个黑色的小圆形，一个黑色的中等三角形，一个黄色的大三角形，一个黄色的小正方形，一个蓝色的中等正方形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的大正方形，一个黄色的大圆形，一个黑色的大圆形。如何将所有黑色物体移动到中间的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["black", "triangle", "large", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个黑色的中圆形、一个蓝色的中三角形、一个黄色的小圆形、一个黑色的小三角形。中间的盒子里有一个黑色的中正方形、一个黑色的小正方形、一个黄色的大圆形。右边的盒子里有一个黑色的大三角形、一个黑色的中圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "middle", "left"], ["black", "triangle", "small", "left"], ["black", "triangle", "large", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的大圆形，一个黑色的小三角形，一个黑色的大圆形，一个黑色的中等圆形。在中间的盒子里，有一个黄色的小圆形，一个蓝色的小三角形，一个黑色的中等三角形。在右边的盒子里，有一个蓝色的中等正方形，一个黄色的中等三角形，一个黄色的中等圆形，一个黄色的中等三角形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "round", "large", "left"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形，一个黑色的小圆形，一个黑色的小圆形。中间的盒子里有一个蓝色的小正方形，一个黑色的中等圆形，一个黑色的中等正方形，一个黑色的中等三角形，一个黄色的小三角形。右边的盒子里有一个蓝色的小三角形，一个黑色的小圆形，一个黄色的小三角形，一个黄色的大三角形，一个黑色的中等圆形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "small", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形，一个蓝色的大圆形，一个黑色的大圆形，一个黑色的中等正方形。中间的盒子里有一个蓝色的小圆形，一个蓝色的中等正方形，一个黄色的中等正方形，一个蓝色的大三角形，一个黑色的小三角形。右边的盒子里有一个蓝色的大正方形，一个蓝色的小三角形，一个蓝色的小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黄色的大正方形，一个蓝色的大三角形，一个黄色的中等三角形，一个黑色的小正方形，一个蓝色的大正方形。在中间的盒子里，有一个黑色的小圆形，一个蓝色的中等三角形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的中等正方形，一个蓝色的小圆形，一个黄色的小三角形，一个蓝色的小三角形，一个黑色的小三角形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "large", "left"], ["black", "square", "small", "left"], ["blue", "square", "large", "left"], ["black", "square", "middle", "right"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄圆形、一个黑色中等正方形、一个黑色大正方形、一个黄色中等正方形、两个蓝色小圆形。在中间的盒子里，有一个蓝色大正方形和一个蓝色中等三角形。在右边的盒子里，有一个黑色大正方形、两个蓝色小圆形、一个黄色中等三角形和一个黑色中等三角形。如何将所有圆形移到左边的盒子中？", "label": [["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形，一个黄色的大正方形。中间的盒子里有一个蓝色的中等圆形，一个蓝色的大圆形，一个蓝色的大圆形，一个黄色的小圆形，一个黄色的大正方形，一个蓝色的中等圆形。右边的盒子里有一个蓝色的小三角形，一个蓝色的小正方形，一个黄色的小正方形，一个蓝色的中等正方形，一个黄色的小圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "left"], ["blue", "triangle", "small", "right"], ["blue", "square", "small", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的小三角形，一个黄色的中等三角形，一个黄色的中等正方形，一个蓝色的中等圆形，一个黄色的大三角形。在中间的盒子里，有一个蓝色的大圆形，一个黑色的大圆形，一个蓝色的小三角形，一个蓝色的小正方形，一个黑色的中等正方形。在右边的盒子里，有一个黑色的小正方形，一个黄色的大三角形，一个黑色的中等三角形，一个黄色的小三角形，一个蓝色的中等三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "large", "right"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的大三角形，一个蓝色的大正方形，一个黄色的大圆形，一个蓝色的大三角形。在中间的盒子里，有一个蓝色的中等大小的正方形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小三角形，一个蓝色的中等大小的圆形，一个黑色的大圆形，一个蓝色的大三角形，一个黄色的大圆形。如何将所有的正方形移到左边的盒子里？", "label": [["blue", "square", "large", "right"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个中等黑色正方形，一个大黑色正方形，一个大蓝色正方形，一个小蓝色三角形。在中间的盒子里，有一个黄色中等圆形，一个黑色中等圆形，一个蓝色中等圆形，一个黄色中等三角形。在右边的盒子里，有一个蓝色小正方形，一个黄色小圆形，一个大蓝色三角形，一个黄色中等圆形，一个蓝色中等三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个黄色的小三角形，一个黄色的中等正方形，一个黑色的大正方形。中间的盒子里有一个黑色的中等三角形，一个黑色的小圆形，一个蓝色的小正方形，一个蓝色的小三角形。右边的盒子里有一个黑色的小正方形，一个黑色的中等正方形，一个黑色的小正方形，一个蓝色的中等圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "small", "left"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形和一个黑色的大正方形。中间的盒子里有一个蓝色的小圆形、一个蓝色的小三角形、一个黑色的中等圆形和一个黑色的大三角形。右边的盒子里有一个黑色的小三角形、一个蓝色的中等圆形和一个蓝色的小正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个中黄色正方形。在中间的盒子里，有一个小黄色正方形，一个小黑色三角形，一个中黑色圆形，一个小黑色正方形，一个小黑色正方形，一个中黑色圆形。在右边的盒子里，有一个小黄色正方形，一个大黑色正方形，一个中黑色三角形，一个大黑色正方形，一个小蓝色三角形。如何将所有圆形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黑色的大圆形，一个黄色的中等圆形，一个蓝色的中等圆形，一个黑色的小圆形，一个黄色的大正方形。在中间的盒子里，有一个蓝色的中等圆形，一个黄色的大圆形，一个黑色的中等三角形，一个黑色的大圆形，一个黑色的中等圆形。在右边的盒子里，有一个黑色的小正方形，一个黑色的中等正方形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黄色的大正方形，一个黄色的小正方形。中间的盒子里有一个黄色的小三角形，一个蓝色的小圆形，一个黄色的中等三角形，一个黄色的小三角形，一个黄色的中等正方形，一个黑色的中等圆形。右边的盒子里有一个黄色的小三角形，一个黑色的中等三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形，一个黄色的中等三角形，一个黑色的小三角形，一个蓝色的小圆形，一个黑色的中等圆形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的中等三角形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的中等三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "small", "left"], ["black", "round", "middle", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黄色的大正方形，一个黑色的大圆形，一个黄色的中等正方形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的中等圆形，一个黑色的中等圆形，一个黄色的中等正方形，一个蓝色的大正方形。在右边的盒子里，有一个黄色的大正方形，一个黄色的中等正方形，一个蓝色的大圆形，一个黑色的小圆形，一个黄色的中等圆形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形，一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的小正方形，一个黑色的中圆形。在中间的盒子里，有一个黄色的中三角形，一个黄色的小正方形。在右边的盒子里，有一个黑色的中正方形，一个蓝色的中正方形，一个黑色的中三角形，一个黑色的大圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "left"], ["black", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个小黑圆形，一个大黄三角形，一个小黄三角形，一个小黄圆形，一个蓝色小正方形。在中间的盒子里，有一个中等大小的黑色圆形，一个蓝色中等大小的三角形。在右边的盒子里，有一个大黑色正方形，一个小黄三角形，一个黄色中等大小的正方形，一个小黄三角形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "small", "left"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形，一个中等黑色正方形。中间的盒子里有一个小黄三角形，一个小黑三角形，一个大黄圆形。右边的盒子里有一个中等黄三角形，一个小黄圆形，一个大黑正方形，一个中等黄正方形，一个小黑圆形，一个大蓝色三角形。如何将所有圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["black", "round", "small", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形、一个黑色的中等圆形、一个黄色的中等正方形、一个蓝色的小圆形和一个黑色的中等正方形。中间的盒子里有一个黑色的中等三角形和一个黄色的中等正方形。右边的盒子里有一个黑色的小正方形、两个黄色的中等三角形和两个黄色的大三角形。如何将所有正方形移到右边的盒子里？ \n\n您好，我是一名有用的助手。要将所有正方形移动到右边的盒子中，您需要将左边的盒子中的所有正方形取出并将它们放入右边的盒子中。", "label": [["yellow", "square", "middle", "left"], ["black", "square", "middle", "left"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的小三角形，一个黄色的大正方形，一个黑色的小圆形，一个黄色的小正方形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的中等正方形，一个黄色的小三角形，一个黑色的中等正方形，一个蓝色的中等正方形，一个黑色的大正方形。在右边的盒子里，有一个黑色的大正方形，一个黄色的中等正方形，一个黑色的小圆形，一个黑色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形，一个黄色的中间圆形，一个黑色的大三角形，一个黄色的大三角形。中间的盒子里有一个黄色的大正方形，一个蓝色的小三角形，一个蓝色的中等三角形。右边的盒子里有一个黑色的大圆形，一个蓝色的小圆形，一个蓝色的中等圆形，一个蓝色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["blue", "triangle", "small", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形，一个黑色的中间三角形，一个黑色的中间圆形。中间的盒子里有一个黄色的中间三角形，一个蓝色的大正方形，两个黄色的小三角形。右边的盒子里有一个黄色的小三角形，一个黑色的大三角形，一个蓝色的小三角形，一个黄色的大三角形，一个黑色的小圆形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的中圆形、一个蓝色的小三角形、一个黄色的小正方形、一个黄色的中正方形、一个蓝色的大正方形。中间的盒子里有一个黑色的中正方形、一个黄色的大正方形。右边的盒子里有一个黄色的小圆形、一个蓝色的中圆形、一个黑色的中圆形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形，一个黑色的小圆形，一个蓝色的大正方形。中间的盒子里有一个黄色的小三角形，一个黄色的中等三角形。右边的盒子里有一个黄色的中等圆形，一个黄色的中等正方形，一个黄色的小正方形，一个蓝色的中等圆形，一个黄色的中等三角形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等圆形，一个黄色的中等正方形，一个黑色的小三角形，一个黄色的小正方形，一个黄色的大三角形，一个黑色的中等圆形。在中间的盒子里，有一个黄色的中等圆形，一个黑色的小正方形，一个黑色的中等圆形，一个黑色的小三角形，一个黄色的中等正方形，一个蓝色的大三角形。在右边的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个黄色的中等三角形。如何将所有黄色物品移动到右边的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "round", "middle", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的中圆形和一个蓝色的大圆形。中间的盒子里有一个蓝色的中正方形、一个蓝色的大三角形、一个黄色的大正方形和一个蓝色的小三角形。右边的盒子里有两个黄色的大正方形。如何将所有正方形移到左边的盒子里？", "label": [["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"], ["blue", "square", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黑色的小圆形、一个蓝色的小正方形、一个黄色的中等圆形、一个黑色的大三角形、一个蓝色的小三角形。中间的盒子里有一个黄色的小三角形、一个黑色的小三角形。右边的盒子里有一个黑色的中等正方形、一个黑色的小圆形、一个黄色的小圆形、一个黑色的中等圆形、一个黑色的中等三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "large", "left"], ["yellow", "round", "middle", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的中圆形，一个黄色的中三角形，一个蓝色的小正方形，一个蓝色的大三角形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的小正方形，一个黑色的大正方形，一个黑色的小三角形，一个黑色的中圆形，一个黑色的小三角形，一个黄色的中正方形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的小圆形，一个蓝色的大圆形，一个黑色的大圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个蓝色的大圆形。中间的盒子里有一个蓝色的小圆形和一个蓝色的大圆形。右边的盒子里有一个黄色的中等三角形和一个黑色的大正方形。如何将所有圆形移动到左边的盒子中？", "label": [["blue", "round", "small", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黄色的大正方形，一个蓝色的大三角形，一个黄色的中等正方形。在中间的盒子里，有一个蓝色的大三角形，一个蓝色的中等三角形，一个黑色的小圆形，一个黄色的中等三角形。在右边的盒子里，有一个黄色的小三角形，一个黑色的中等圆形，两个黑色的中等正方形，一个蓝色的大圆形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个蓝色的大正方形、一个黑色的小正方形、一个黄色的大三角形和一个蓝色的中圆形。中间的盒子里有一个黑色的中等三角形、一个黑色的大圆形、一个黄色的大三角形和一个蓝色的大正方形。右边的盒子里有一个黑色的大圆形、一个黑色的大三角形和一个黄色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["black", "round", "large", "right"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的小圆形、一个黄色的小三角形、一个蓝色的中等大小圆形和一个黄色的小三角形。中间的盒子里有一个黄色的中等大小三角形和一个黑色的大三角形。右边的盒子里有一个黄色的中等大小三角形、一个黑色的小圆形、一个蓝色的中等大小圆形和一个蓝色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "large", "left"], ["blue", "round", "small", "left"], ["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形和一个黄色的中等正方形。中间的盒子里有一个蓝色的大正方形、一个黄色的大圆形、一个蓝色的大圆形和一个黑色的大圆形。右边的盒子里有一个黑色的大圆形、一个蓝色的小三角形和一个黑色的中等正方形。如何将所有正方形移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形、一个黄色的中等正方形、一个黑色的大正方形和一个蓝色的大圆形。在中间的盒子里，有一个黄色的大正方形、一个黄色的中等正方形和一个蓝色的中等三角形。在右边的盒子里，有一个黄色的大正方形、一个黄色的大圆形、一个蓝色的大正方形和一个黑色的大正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "large", "left"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的中等三角形、一个蓝色的中等三角形、一个蓝色的大三角形、三个蓝色的中等三角形。中间的盒子里有一个蓝色的小三角形和一个蓝色的小正方形。右边的盒子里有一个黄色的中等正方形、一个蓝色的中等圆形、一个黄色的大正方形和一个黑色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["blue", "round", "middle", "right"], ["black", "round", "small", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个蓝色的大正方形和一个黑色的大三角形。中间的盒子里有一个黑色的小三角形、一个中等大小的黑色圆形和一个蓝色的小正方形。右边的盒子里有一个黄色的大三角形、一个黄色的小三角形、一个黑色的大三角形和一个黄色的大三角形。如何将所有黄色物品移到右边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个黄色的大正方形、一个黑色的大圆形和一个黄色的小圆形。中间的盒子里有一个黑色的大三角形、一个蓝色的大圆形和一个黑色的中号圆形。右边的盒子里有一个蓝色的大圆形和一个蓝色的中号圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "triangle", "large", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个大黑色圆形、一个小黑色圆形和一个小蓝色圆形。中间的盒子里有一个大蓝色正方形、一个大蓝色圆形、一个大蓝色圆形和一个大蓝色正方形。右边的盒子里有一个大黄色正方形、一个小黑色圆形、一个大蓝色三角形和一个中等大小的蓝色圆形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小黄正方形、一个中等黄三角形。中间的盒子里有一个中等黑色正方形、一个小黄圆形。右边的盒子里有一个大蓝色正方形、一个中等黄圆形。如何将所有圆形移动到左边的盒子中？", "label": [["yellow", "round", "middle", "right"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个蓝色的小正方形，一个蓝色的小圆形，一个黄色的中等圆形。中间的盒子里有一个黑色的小圆形，一个黑色的中等正方形，一个黄色的小正方形，一个黄色的大圆形，一个黄色的小圆形。右边的盒子里有一个黑色的中等三角形，一个蓝色的大正方形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "triangle", "small", "left"], ["black", "round", "small", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形和一个蓝色的中等正方形。中间的盒子里有一个蓝色的大圆形、一个黄色的中等正方形、一个黄色的大圆形和一个蓝色的大正方形。右边的盒子里有一个黄色的大正方形、一个蓝色的中等三角形和一个黑色的小三角形。如何将所有的圆形移到右边的盒子中？", "label": [["blue", "round", "large", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形，一个黄色的小三角形。中间的盒子里有一个蓝色的大三角形，一个黄色的中等正方形，一个黑色的大三角形，一个黑色的小三角形，一个黄色的大圆形，一个蓝色的小正方形。右边的盒子里有一个黄色的大三角形，一个黄色的小正方形。如何将所有的圆形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黄色的小三角形，一个黄色的小圆形，一个黑色的大圆形，一个蓝色的小三角形，一个黑色的小三角形。在中间的盒子里，有一个黑色的小圆形，一个黄色的大三角形，一个黄色的中等大小的正方形。在右边的盒子里，有一个黑色的大正方形，一个黄色的大正方形，一个蓝色的大正方形，一个黑色的中等大小的三角形，一个黄色的小圆形，一个黑色的大圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "round", "small", "right"], ["yellow", "triangle", "large", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黄色的大三角形。中间的盒子里有一个黑色的大三角形、一个蓝色的小圆形、一个蓝色的中等三角形、一个黑色的大正方形和一个黄色的中等圆形。右边的盒子里有一个蓝色的小三角形、一个黑色的小三角形、一个黑色的大三角形和一个黑色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形，一个蓝色的小正方形，一个蓝色的小三角形，一个黄色的小三角形，一个黑色的小三角形。中间的盒子里有一个黄色的大正方形，一个黄色的中等三角形。右边的盒子里有一个蓝色的中等三角形，一个黄色的大正方形，一个蓝色的小三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"], ["yellow", "triangle", "small", "left"], ["black", "triangle", "small", "left"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个小黄三角形，一个黑色中等正方形，一个小黑三角形，一个小黄三角形，一个黑色中等正方形。中间的盒子里有一个小黑正方形，一个小黑正方形。右边的盒子里有一个黄色中等三角形，一个大黄色圆形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "triangle", "small", "left"], ["black", "square", "middle", "left"], ["black", "square", "small", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的小三角形，一个黑色的小正方形，一个黑色的中等正方形，一个蓝色的小正方形，一个黑色的大三角形。在中间的盒子里，有一个黄色的大三角形，一个黄色的小圆形，一个黄色的大三角形，一个蓝色的大正方形，一个蓝色的大三角形。在右边的盒子里，有一个黄色的小正方形，一个黄色的大三角形，一个黄色的大三角形，一个蓝色的中等圆形，一个黄色的中等正方形。如何将所有黑色物体移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形和一个蓝色的小圆形。在中间的盒子里，有一个黄色的大三角形、一个黄色的小三角形、一个蓝色的小三角形、一个蓝色的大正方形和一个蓝色的大三角形。在右边的盒子里，有一个黄色的中等大小的圆形、一个黑色的小正方形、一个黑色的中等大小的三角形、一个蓝色的中等大小的圆形和一个黑色的中等大小的三角形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的中等圆形，一个蓝色的小三角形，一个黑色的小正方形，一个蓝色的大三角形。在中间的盒子里，有一个蓝色的大正方形，一个黄色的大三角形，一个黄色的大正方形，一个黑色的中等正方形，一个黑色的大三角形。在右边的盒子里，有一个黄色的大三角形，一个黄色的小三角形，一个蓝色的大圆形，一个蓝色的中等三角形，一个黑色的小三角形，一个黄色的大正方形。如何将所有正方形移动到中间的盒子里？", "label": [["black", "square", "small", "left"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的小三角形和一个黄色的小三角形。中间的盒子里有一个黑色的小圆形、一个黄色的小正方形和一个黑色的中等正方形。右边的盒子里有一个黑色的小圆形、一个黄色的中等圆形、一个蓝色的小圆形和一个蓝色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄圆形、一个大黄三角形、一个大蓝三角形、一个小蓝三角形、一个中蓝正方形和一个中蓝三角形。在中间的盒子里，有一个小黑正方形、一个小黄圆形和一个中蓝圆形。在右边的盒子里，有一个小黄三角形、一个小蓝圆形、一个大蓝圆形和一个小蓝圆形。如何将所有三角形移到右边的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "small", "left"], ["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的小正方形，一个蓝色的中等三角形，一个黄色的大正方形，一个黄色的中等三角形，一个蓝色的小圆形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的大圆形，一个蓝色的中等正方形，一个黄色的大正方形。在右边的盒子里，有一个黑色的大正方形，一个黄色的中等正方形，一个黄色的小正方形，一个黄色的小圆形，一个黄色的中等正方形，一个黄色的大正方形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["yellow", "square", "middle", "right"], ["yellow", "square", "small", "right"], ["yellow", "square", "middle", "right"], ["yellow", "square", "large", "right"], ["yellow", "square", "small", "middle"], ["blue", "square", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小三角形，一个蓝色的中圆形，一个黄色的中方形，一个蓝色的中圆形，一个黑色的大圆形，一个蓝色的大方形。中间的盒子里有一个蓝色的中三角形，一个黑色的小方形，一个黑色的小三角形，一个蓝色的小三角形。右边的盒子里有一个黑色的中三角形，一个黑色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "middle", "right"], ["black", "round", "small", "right"], ["black", "square", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小黑圆形、一个大黄三角形、一个中蓝圆形。中间的盒子里有一个小蓝正方形、一个中黄三角形、一个中黄三角形、一个中黑圆形、一个小黑圆形。右边的盒子里有一个小黄正方形、一个中黄圆形、一个大黄圆形、一个小黑圆形。如何将所有正方形移到右边的盒子里？", "label": [["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个大蓝色正方形，一个小黑色正方形，一个大黄色圆形，一个大黑色圆形，一个小黄色圆形。在中间的盒子里，有一个大黑色圆形，一个中等大小的黑色正方形，一个小黄色圆形，一个小黄色三角形，一个大黄色三角形。在右边的盒子里，有一个蓝色中等大小的三角形，一个大蓝色三角形，一个小黑色三角形，一个蓝色中等大小的三角形，一个大黑色三角形，一个蓝色中等大小的圆形。如何将所有正方形移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["blue", "square", "large", "left"], ["black", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形和一个蓝色的大三角形。中间的盒子里有一个黑色的大正方形、一个黑色的大圆形、一个黑色的小三角形和一个黄色的小三角形。右边的盒子里有一个蓝色的大圆形、一个蓝色的小圆形、一个蓝色的中等大小的正方形、一个黑色的大三角形、一个黑色的小三角形和一个黑色的中等大小的正方形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个黑色中等正方形、一个蓝色大圆形、一个蓝色中等三角形。中间的盒子里有一个小黄色三角形、一个蓝色大三角形、一个小黄色正方形、一个黑色大圆形、一个蓝色小正方形。右边的盒子里有一个黄色大三角形、一个蓝色大正方形、一个黑色中等圆形。如何将所有黑色物品移动到左边的盒子？", "label": [["black", "round", "middle", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个小黄圆形，一个大黑圆形，一个大黄三角形，一个小蓝圆形，一个大蓝正方形。在中间的盒子里，有一个小黄圆形，一个小蓝三角形，一个小黑正方形，一个大黄三角形，一个大黑圆形，一个大黄正方形。在右边的盒子里，有一个大黄三角形，一个大蓝正方形，一个大黄三角形，一个中黄正方形，一个中黄三角形，一个大蓝圆形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "square", "small", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的大圆形和一个黄色的大正方形。中间的盒子里有一个黑色的小圆形、一个黄色的小正方形、一个黑色的大正方形和一个黄色的小正方形。右边的盒子里有一个黑色的小圆形和一个黄色的中等大小的正方形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "square", "small", "middle"], ["black", "square", "large", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形，一个蓝色的中圆形。中间的盒子里有一个蓝色的小圆形，一个黑色的中方形。右边的盒子里有一个蓝色的小圆形，一个黄色的大三角形，一个黄色的大圆形，一个黑色的大三角形，一个黑色的大圆形，一个黄色的小三角形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的中间圆形，一个黑色的小三角形，一个黑色的中间正方形。在中间的盒子里，有一个黄色的大正方形，一个黄色的中间正方形，一个蓝色的中间圆形。在右边的盒子里，有一个黑色的中间三角形，一个黑色的中间三角形，一个黄色的小圆形，一个黄色的小圆形，一个黑色的小圆形，一个黑色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形，一个黄色的大三角形。中间的盒子里有一个黄色的小正方形，一个蓝色的中等三角形。右边的盒子里有一个蓝色的大三角形，一个黑色的中等正方形。如何将所有的三角形移动到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形和一个黑色的中等正方形。在中间的盒子里，有一个蓝色的小正方形，一个黄色的大正方形，一个黄色的大正方形，一个黄色的大正方形。在右边的盒子里，有一个黄色的大圆形，一个黄色的大三角形和一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的中圆形，一个黄色的中正方形，一个黄色的小圆形，一个黑色的小正方形，一个黄色的大三角形。在中间的盒子里，有一个黄色的中圆形，一个黑色的大正方形，一个黑色的大圆形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的小三角形，一个黄色的中三角形，一个黄色的中三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["blue", "triangle", "small", "right"], ["yellow", "triangle", "middle", "right"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个蓝色的中间正方形，一个黑色的大正方形，一个黄色的中间圆形。在中间的盒子里，有一个黑色的小正方形，一个蓝色的小正方形，一个蓝色的中间圆形，一个黑色的小三角形，一个黄色的中间正方形。在右边的盒子里，有一个黑色的大圆形，一个黄色的大三角形，一个黄色的大三角形，一个黑色的小正方形，一个蓝色的小正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["black", "square", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个黑色的大圆形。中间的盒子里有一个黄色的小正方形、一个黑色的大正方形、一个蓝色的大正方形、一个黄色的中等三角形、一个黄色的中等圆形和一个黑色的小三角形。右边的盒子里有一个黄色的小正方形和一个黄色的大正方形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形，一个黑色的小三角形，一个黄色的小圆形，一个黄色的小圆形，一个黑色的中等圆形。在中间的盒子里，有一个黄色的大圆形，一个黄色的小正方形，一个黄色的中等圆形，一个蓝色的大圆形。在右边的盒子里，有一个黑色的大正方形，一个黑色的中等正方形，一个蓝色的大正方形，一个黄色的中等三角形，一个黄色的大三角形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["black", "square", "middle", "right"], ["blue", "square", "large", "right"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个黑色中等三角形。在中间的盒子里，有一个蓝色中等正方形，一个黑色中等圆形，一个小黑色三角形，一个蓝色大圆形，一个黄色大三角形。在右边的盒子里，有一个蓝色小圆形，一个蓝色大圆形，一个黑色中等正方形，一个黄色小三角形，一个黄色中等圆形，一个黑色大三角形。如何将所有三角形移动到右边的盒子中？", "label": [["black", "triangle", "middle", "left"], ["black", "triangle", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的大正方形，一个黄色的小圆形，一个蓝色的小三角形，一个蓝色的大正方形，一个黄色的小正方形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的中等三角形，一个黑色的小三角形，一个黄色的小圆形，一个黑色的大圆形，一个蓝色的小正方形。在右边的盒子里，有一个黄色的大正方形，一个黑色的中等正方形，一个黄色的小圆形，一个黑色的小正方形，一个蓝色的中等正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["black", "square", "large", "left"], ["black", "square", "middle", "right"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黑色的小正方形、一个黑色的大正方形和一个黄色的大三角形。中间的盒子里有一个黄色的中等大小的正方形、一个黄色的小正方形、两个黄色的中等大小的圆形。右边的盒子里有一个蓝色的中等大小的正方形和一个黄色的小圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形、一个蓝色的小圆形、一个黄色的大三角形、一个蓝色的中等圆形和一个黄色的中等圆形。中间的盒子里有一个黑色的大三角形、一个蓝色的小三角形、一个黑色的小正方形、一个蓝色的中等三角形和一个黄色的大三角形。右边的盒子里有一个黑色的中等三角形和一个黑色的中等圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "large", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形、一个黑色的大圆形、一个黄色的小三角形、一个蓝色的中等正方形和一个黄色的中等正方形。中间的盒子里有一个黑色的大正方形、一个蓝色的大正方形和一个黑色的小三角形。右边的盒子里有一个黄色的中等正方形、一个黄色的大圆形和一个黑色的中等正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黑色正方形，一个大黑色正方形，一个大黑色三角形，一个大蓝色三角形，一个小黑色三角形，一个小黑色正方形。在中间的盒子里，有一个大黑色正方形，一个小蓝色圆形，一个大黑色三角形。在右边的盒子里，有一个中等大小的黑色正方形，一个中等大小的蓝色圆形。如何将所有正方形移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "square", "large", "left"], ["black", "square", "small", "left"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个蓝色的中间正方形，一个黄色的大三角形，一个黄色的小圆形，一个黄色的大三角形。在中间的盒子里，有一个黑色的中间圆形，一个黑色的大正方形，一个黄色的大正方形，一个黑色的小三角形，一个蓝色的小圆形。在右边的盒子里，有一个黄色的大三角形，一个黑色的中间圆形，一个黑色的大三角形，一个黄色的中间三角形，一个蓝色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "large", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形和一个蓝色的大三角形。在中间的盒子里，有一个蓝色的小三角形、一个黑色的小三角形、一个蓝色的中间正方形和一个黄色的中间圆形。在右边的盒子里，有一个黄色的大正方形、一个黄色的大三角形、一个黑色的小圆形、一个黑色的小正方形、一个蓝色的中间圆形和一个蓝色的中间正方形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "triangle", "large", "right"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中圆形、一个黄色的中圆形、一个黄色的中方形、一个黑色的小三角形、一个蓝色的大方形和一个黄色的小圆形。中间的盒子里有一个蓝色的中三角形和一个黄色的中方形。右边的盒子里有一个黑色的小圆形和一个黄色的大圆形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "square", "middle", "left"], ["yellow", "round", "small", "left"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的大三角形，一个黑色的中间三角形，一个黄色的小三角形，一个黑色的中间圆形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的小正方形，一个黑色的大三角形，一个黄色的小三角形，一个黄色的小正方形，一个黑色的中间三角形，一个黄色的大圆形。在右边的盒子里，有一个黄色的小圆形，一个黄色的大圆形，一个黄色的大正方形，一个蓝色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "middle"], ["yellow", "triangle", "small", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个小黑三角形，一个小黑正方形，一个小黑正方形，一个小蓝三角形，一个大蓝圆形。在中间的盒子里，有一个大黄圆形，一个大黄圆形。在右边的盒子里，有一个中等黑圆形，一个中等黄圆形，一个大黄正方形，一个小黄正方形，一个小黄圆形。如何将所有三角形移动到左边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形、一个蓝色的中等正方形、一个蓝色的中等正方形、一个蓝色的小三角形。中间的盒子里有一个黄色的大三角形、一个蓝色的中等正方形、一个黄色的中等正方形。右边的盒子里有一个黑色的小三角形、一个黄色的小正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "square", "middle", "left"], ["blue", "square", "middle", "left"], ["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形、一个黄色的大圆形、一个蓝色的小圆形和一个黄色的中等大小的正方形。中间的盒子里有一个蓝色的大圆形、一个蓝色的中等大小的正方形、一个黑色的大三角形和一个蓝色的大正方形。右边的盒子里有一个蓝色的大三角形、一个黑色的小正方形和一个蓝色的中等大小的三角形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "middle", "left"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形，一个黄色的小圆形。中间的盒子里有一个黑色的中等三角形，一个黑色的大三角形，一个蓝色的小圆形，一个蓝色的小圆形，一个黑色的小正方形。右边的盒子里有一个蓝色的小正方形，一个蓝色的大三角形，一个黑色的小三角形，一个黄色的大圆形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个黑色的小三角形，一个蓝色的大正方形。中间的盒子里有一个黑色的中等三角形，一个黑色的小圆形，一个黄色的小正方形，一个黄色的中等圆形，一个黑色的中等圆形。右边的盒子里有一个黑色的中等正方形，一个蓝色的大圆形，一个黄色的小三角形，一个黄色的中等正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "square", "middle", "right"], ["yellow", "square", "small", "middle"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色圆形，一个中等黄色正方形，一个小蓝色三角形，一个小蓝色正方形，一个中等黄色正方形，一个小黑色三角形。在中间的盒子里，有一个大黄色三角形，一个中等黑色圆形，一个大黄色圆形，一个小黑色圆形，一个大黄色三角形，一个小黑色三角形。在右边的盒子里，有一个小黄色正方形，一个中等黄色正方形，一个大黑色正方形，一个小蓝色圆形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "round", "small", "left"], ["yellow", "square", "middle", "left"], ["yellow", "square", "middle", "left"], ["yellow", "triangle", "large", "middle"], ["yellow", "round", "large", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个黄色的小正方形、一个蓝色的小正方形和一个蓝色的大号圆形。中间的盒子里有一个黑色的大号三角形、一个黄色的中号圆形和一个黑色的中号三角形。右边的盒子里有一个黑色的小号圆形、一个蓝色的小正方形和一个黑色的小号圆形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "small", "left"], ["blue", "square", "small", "left"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形、一个黑色的小正方形、一个黄色的大三角形和一个黄色的中等大小的正方形。中间的盒子里有一个黑色的大三角形、一个黄色的小三角形和一个黑色的小三角形。右边的盒子里有一个黑色的小三角形、一个黑色的中等大小的三角形、一个黑色的中等大小的正方形和一个黄色的大圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "triangle", "small", "right"], ["black", "triangle", "middle", "right"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的中圆形、一个蓝色的小圆形、一个蓝色的小圆形、一个蓝色的大三角形和一个黑色的大三角形。中间的盒子里有一个黄色的中圆形、一个蓝色的大圆形、一个蓝色的小圆形和一个蓝色的小正方形。右边的盒子里有一个黑色的大圆形、一个黄色的大正方形和一个黑色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "large", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "small", "left"], ["blue", "round", "small", "left"], ["yellow", "round", "middle", "middle"], ["blue", "round", "large", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个黄色的大正方形和一个黑色的大正方形。中间的盒子里有一个黑色的中等圆形、一个黄色的小正方形和一个蓝色的中等正方形。右边的盒子里有一个蓝色的中等正方形、一个黑色的小正方形、一个黑色的大正方形、一个黑色的大三角形和一个黑色的中等正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的大正方形，一个黄色的大圆形，一个蓝色的中圆形，一个黑色的大三角形，一个蓝色的大三角形。在中间的盒子里，有一个黑色的大正方形，一个黑色的中等三角形，一个蓝色的中等三角形，一个黄色的小圆形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的中等三角形，一个黄色的大圆形，一个蓝色的大正方形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "large", "left"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的中间三角形，一个蓝色的小正方形，一个黑色的大圆形，一个蓝色的大三角形，一个蓝色的中间三角形。在中间的盒子里，有一个黄色的大正方形，一个黄色的大正方形，一个蓝色的中间正方形。在右边的盒子里，有一个蓝色的大三角形，一个黄色的小圆形，一个黑色的中间圆形，一个黄色的大三角形，一个黄色的小圆形，一个黑色的中间正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个黑色的大三角形和一个黑色的中等大小的正方形。中间的盒子里有一个黄色的大正方形、一个黄色的小三角形和一个黄色的小圆形。右边的盒子里有一个黄色的大三角形、一个黑色的小三角形、一个黑色的中等大小的三角形、一个蓝色的中等大小的三角形和一个蓝色的中等大小的圆形。如何将所有蓝色物品移动到中间的盒子中？", "label": [["blue", "square", "large", "left"], ["blue", "triangle", "middle", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个蓝色的中等正方形、一个黑色的中等圆形、一个蓝色的中等三角形、一个黑色的中等正方形、一个蓝色的小圆形。在中间的盒子里，有一个蓝色的中等正方形、一个蓝色的中等三角形、一个黄色的小三角形、一个黄色的中等正方形、两个蓝色的小三角形。在右边的盒子里，有两个黑色的大圆形、一个蓝色的小圆形、一个黑色的小三角形、一个黄色的中等三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "middle", "left"], ["black", "square", "middle", "left"], ["black", "round", "large", "right"], ["black", "round", "large", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形和一个黑色的中号圆形。中间的盒子里有一个蓝色的大号圆形和一个黑色的小正方形。右边的盒子里有一个蓝色的中号正方形和一个黄色的大号圆形。如何将所有正方形移动到中间的盒子中？", "label": [["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个蓝色的中等圆形和一个黄色的中等正方形。中间的盒子里有一个蓝色的小正方形和一个黑色的大正方形。右边的盒子里有一个蓝色的中等圆形、一个黑色的中等正方形和一个蓝色的中等圆形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个中等黑色正方形。在中间的盒子里，有一个大黑色圆形，一个中等黄色圆形，一个小黑色圆形。在右边的盒子里，有一个中等黑色圆形，一个小黑色圆形，一个中等黄色正方形，一个小黑色正方形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "round", "small", "right"], ["black", "square", "small", "right"], ["black", "round", "large", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黄色的大圆形，一个黄色的中等三角形，一个蓝色的小圆形，一个黄色的小正方形，一个黑色的小三角形。在中间的盒子里，有一个黄色的大正方形，一个蓝色的中等正方形。在右边的盒子里，有一个黑色的大正方形，一个黑色的小三角形，一个黑色的小圆形，一个黑色的小正方形，一个蓝色的中等圆形，一个黄色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "round", "small", "left"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形和一个黑色的小三角形。中间的盒子里有一个黑色的中号圆形和一个蓝色的小正方形。右边的盒子里有一个黑色的大号圆形、一个黑色的中号三角形和一个蓝色的小号圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的中间三角形，一个蓝色的小圆形，一个黑色的中间正方形，一个黄色的中间正方形，一个黑色的大三角形。在中间的盒子里，有一个黑色的中间三角形，一个蓝色的中间三角形，一个黑色的大圆形，一个黄色的小圆形，一个蓝色的大三角形，一个黄色的中间三角形。在右边的盒子里，有一个黄色的中间圆形，一个黑色的大三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "square", "middle", "left"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个黑色中圆形，一个黄色中三角形，一个小黑三角形。在中间的盒子里，有一个蓝色小正方形，一个蓝色大圆形，一个蓝色小三角形，一个黄色大三角形，一个蓝色中三角形。在右边的盒子里，有一个黄色中圆形，一个小黄圆形，一个黄色中圆形，一个小黄正方形，一个小黄圆形，一个蓝色中圆形。如何将所有三角形移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "middle", "left"], ["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的小三角形，一个黄色的小正方形，一个蓝色的大三角形，一个黄色的小三角形，一个黄色的中等三角形。在中间的盒子里，有一个黑色的中等圆形，一个黄色的大圆形，一个蓝色的大圆形，一个黄色的大正方形，一个黑色的中等正方形。在右边的盒子里，有一个黄色的小圆形，一个黄色的大三角形，一个黑色的大圆形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形、一个黄色的小正方形、一个黄色的中等三角形和一个蓝色的中等三角形。中间的盒子里有一个黑色的大正方形、一个黄色的中等三角形、一个黄色的小圆形和一个黑色的大正方形。右边的盒子里有一个黄色的中等三角形、一个蓝色的小正方形、一个黄色的大圆形和一个蓝色的中等正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "square", "small", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形、一个黄色的大三角形和一个蓝色的中等正方形。中间的盒子里有一个黑色的大圆形和一个黑色的大三角形。右边的盒子里有一个黄色的大三角形、一个蓝色的大正方形、一个黄色的大圆形、一个黄色的小正方形、一个蓝色的小三角形和一个黑色的小正方形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "round", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个黄色中等三角形，一个蓝色大三角形，一个蓝色中等三角形，一个黄色中等圆形，一个蓝色中等正方形。在中间的盒子里，有一个蓝色大圆形，一个黑色小三角形，一个蓝色大圆形。在右边的盒子里，有一个黑色小圆形，一个黑色小圆形，一个蓝色中等圆形，一个黑色小圆形。如何将所有圆形移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["black", "round", "small", "right"], ["black", "round", "small", "right"], ["blue", "round", "middle", "right"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黑色的小三角形，一个黄色的小圆形，一个黑色的小三角形，一个蓝色的大三角形。在中间的盒子里，有一个黑色的中等正方形和一个蓝色的小三角形。在右边的盒子里，有一个黑色的中等圆形，一个蓝色的中等正方形，一个黑色的中等三角形，一个黑色的小圆形，一个黑色的大三角形和一个黑色的中等三角形。如何将所有正方形移动到右边的盒子中？", "label": [["blue", "square", "middle", "left"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的大圆形，一个黑色的小圆形，一个蓝色的小三角形，一个黑色的小圆形。在中间的盒子里，有一个黑色的中等大小的圆形，一个蓝色的小三角形，一个蓝色的大正方形。在右边的盒子里，有一个黄色的小正方形，一个黑色的中等大小的圆形，一个黑色的中等大小的正方形，一个蓝色的中等大小的正方形，一个蓝色的小三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个黄色的大三角形。中间的盒子里有一个蓝色的小正方形、一个黑色的大正方形、一个中等大小的黑色正方形、一个黄色的大正方形、一个黄色的小正方形和一个黄色的小三角形。右边的盒子里有一个黄色的大三角形和一个黑色的大三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "square", "large", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黑色的中间三角形，一个黑色的大正方形，一个黑色的大三角形，一个黄色的大三角形，一个黄色的小正方形。在中间的盒子里，有一个蓝色的中间正方形，一个蓝色的中间圆形，一个蓝色的小正方形。在右边的盒子里，有一个黑色的大圆形，一个蓝色的中间三角形，一个蓝色的中间正方形，一个黄色的小正方形，一个蓝色的中间正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "left"], ["blue", "triangle", "middle", "right"], ["blue", "square", "middle", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个黑色的小三角形。中间的盒子里有一个蓝色的大正方形、一个黑色的大三角形、一个黄色的中等大小的正方形、一个黑色的小圆形、一个黑色的大三角形和一个蓝色的大正方形。右边的盒子里有一个蓝色的大三角形、一个黄色的大三角形和一个黄色的中等大小的圆形。如何将所有蓝色的物品移到左边的盒子？", "label": [["blue", "triangle", "large", "right"], ["blue", "square", "large", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的中等正方形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的中等三角形，一个黄色的小正方形，一个蓝色的大圆形，一个蓝色的小三角形，一个黄色的小正方形。在右边的盒子里，有一个黄色的中等三角形，一个蓝色的中等正方形，一个蓝色的中等正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的小圆形，一个蓝色的小正方形，一个蓝色的大三角形，一个黄色的小圆形，一个黑色的大正方形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的大三角形，一个黑色的小三角形，一个黄色的大三角形，一个蓝色的大圆形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的中等正方形，一个黄色的大三角形，一个黄色的大圆形，一个黄色的大正方形，一个黄色的中等正方形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黄色的大三角形，一个蓝色的大正方形。在中间的盒子里，有一个蓝色的大正方形，一个黑色的中等正方形，一个黑色的小正方形，一个黄色的中等圆形，一个黑色的中等正方形，一个黄色的小圆形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的小正方形，一个黑色的大三角形，一个蓝色的大正方形，一个蓝色的中等圆形，一个黑色的大正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个蓝色的大正方形、一个蓝色的中等圆形、一个黑色的大正方形、一个蓝色的小正方形、一个黄色的中等三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大三角形、一个黄色的中等三角形。右边的盒子里有一个黄色的中等圆形、一个黑色的大正方形、一个黄色的大正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中圆形、一个蓝色的大圆形、一个黑色的中等三角形、一个黑色的中等三角形、一个黑色的小三角形、一个蓝色的小正方形。在中间的盒子里，有一个黑色的中等正方形、一个黑色的中等三角形、一个黄色的小正方形。在右边的盒子里，有一个黄色的小圆形、一个黑色的大圆形、一个黄色的大圆形、一个黑色的大三角形、一个黄色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["black", "round", "large", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个蓝色的大三角形、一个蓝色的中圆形、一个黑色的中圆形、一个蓝色的小三角形和一个黄色的小正方形。在中间的盒子里，有一个黄色的小三角形、一个黄色的小圆形、一个蓝色的中正方形、一个蓝色的小圆形、一个黄色的中圆形和一个黄色的大三角形。在右边的盒子里，有一个蓝色的中正方形、一个蓝色的大正方形、两个黄色的中正方形和一个黄色的大三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["yellow", "square", "middle", "right"], ["yellow", "triangle", "large", "right"], ["yellow", "triangle", "small", "middle"], ["yellow", "round", "small", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形和一个蓝色的小三角形。中间的盒子里有一个黄色的大正方形和一个蓝色的大圆形。右边的盒子里有一个蓝色的小三角形、一个黑色的小正方形和一个蓝色的大圆形。如何将所有的正方形移到左边的盒子里？", "label": [["black", "square", "small", "right"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的小圆形、一个黄色的大正方形。中间的盒子里有一个黑色的小圆形、一个黑色的小三角形、一个蓝色的大正方形、一个黄色的小圆形、一个黑色的大正方形、一个黄色的大圆形。右边的盒子里有一个黑色的中等大小的圆形、一个黄色的中等大小的正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形、一个黄色的大圆形和一个蓝色的中等圆形。中间的盒子里有两个蓝色的大圆形和一个黑色的大三角形。右边的盒子里有一个黄色的小圆形、一个黄色的小正方形和一个黄色的小正方形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "large", "left"], ["blue", "round", "middle", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的大圆形，一个蓝色的大三角形，一个蓝色的大三角形，一个蓝色的中等三角形，一个黑色的中等正方形。在中间的盒子里，有一个黄色的大圆形，一个黄色的大圆形，一个黑色的大三角形。在右边的盒子里，有一个黑色的大正方形，一个蓝色的小三角形，一个蓝色的小三角形，一个蓝色的大正方形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黑色的中间正方形，一个黄色的小三角形，一个蓝色的大圆形，一个黑色的大正方形。在中间的盒子里，有一个黑色的小正方形，一个黄色的大圆形，一个黄色的小圆形。在右边的盒子里，有一个蓝色的小三角形，一个黑色的小三角形，一个黑色的中等三角形，一个黄色的小圆形，一个黄色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "right"], ["black", "triangle", "middle", "right"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黄色的小正方形、一个黑色的小圆形。中间的盒子里有一个蓝色的大正方形、一个黄色的大圆形、一个蓝色的中等圆形、一个黄色的大正方形、一个蓝色的大正方形。右边的盒子里有一个黄色的中等正方形、一个蓝色的大正方形、一个蓝色的大三角形。如何将所有的三角形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形，一个黄色的小正方形。中间的盒子里有一个蓝色的大正方形，两个黑色的小圆形。右边的盒子里有一个黑色的中号正方形，一个蓝色的大正方形，一个黄色的小三角形，一个黄色的大正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "middle", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个蓝色的大圆形，一个黄色的中等正方形，一个黑色的大正方形，一个蓝色的大正方形，一个黄色的大圆形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的大正方形，一个黑色的大圆形，一个黑色的小圆形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的大圆形，一个黄色的中等三角形，一个黄色的小正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "left"], ["blue", "square", "large", "left"], ["blue", "round", "small", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形和一个黄色的小正方形。中间的盒子里有一个蓝色的中等大小的三角形、一个黑色的小正方形和一个黑色的小圆形。右边的盒子里有一个黄色的大正方形、一个蓝色的大三角形、一个蓝色的中等大小的三角形、一个黄色的大三角形和一个蓝色的中等大小的正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黄色的小三角形、一个蓝色的大圆形、一个黑色的中等正方形和一个黄色的小正方形。中间的盒子里有一个黑色的小圆形和一个黄色的小三角形。右边的盒子里有一个蓝色的小三角形、一个黑色的中等正方形和一个黄色的中等正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黄色的小三角形、一个黄色的小圆形、一个黑色的中等三角形和一个黑色的小正方形。中间的盒子里有一个蓝色的小圆形、一个蓝色的小三角形、一个蓝色的大正方形、一个黑色的小三角形和一个蓝色的小圆形。右边的盒子里有一个黑色的大正方形和一个蓝色的大正方形。如何将所有的正方形移到左边的盒子里？", "label": [["black", "square", "large", "right"], ["blue", "square", "large", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形和一个黑色的中间圆形。中间的盒子里有一个蓝色的小正方形和一个黄色的大正方形。右边的盒子里有一个黑色的小圆形、一个黄色的中间圆形、一个蓝色的大三角形和一个蓝色的小三角形、一个黄色的中间圆形。如何将所有三角形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小正方形、一个黑色的大正方形、一个蓝色的中等大小正方形和一个黑色的小圆形。中间的盒子里有一个黄色的大圆形、一个蓝色的中等大小正方形、一个黄色的小三角形和一个蓝色的大圆形。右边的盒子里有一个黄色的中等大小三角形和一个蓝色的中等大小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黄色的小三角形、一个蓝色的中等圆形、一个黄色的大圆形、一个蓝色的大正方形、一个黑色的小三角形。中间的盒子里有一个黑色的大正方形、一个黄色的小圆形、一个黑色的中等正方形、一个黑色的小三角形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "large", "middle"], ["black", "square", "middle", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个蓝色的中等大小的圆形，一个黑色的大圆形。中间的盒子里有一个黄色的小正方形，一个蓝色的大正方形。右边的盒子里有一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形，一个中等大小的黑色圆形。中间的盒子里有一个小黑色圆形，两个小黄色正方形，一个中等大小的蓝色正方形。右边的盒子里有一个小蓝色三角形，一个中等大小的蓝色圆形，一个小黄色正方形，一个小黄色三角形，一个大黄色圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形，一个黄色的小三角形，一个黑色的中等正方形，一个蓝色的小正方形，一个蓝色的大三角形。在中间的盒子里，有一个黑色的中等正方形，一个蓝色的中等圆形，一个蓝色的大正方形，一个黑色的小圆形，一个黄色的大正方形，一个黑色的中等正方形。在右边的盒子里，有一个黄色的中等正方形，一个黄色的小圆形。如何将所有蓝色物品移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["blue", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形、一个黑色的大圆形和一个黑色的大正方形。中间的盒子里有一个黄色的大三角形和一个黄色的小正方形。右边的盒子里有一个黄色的中等三角形、一个蓝色的大三角形、一个黄色的大三角形和一个蓝色的小圆形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "triangle", "large", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形，一个黑色的小正方形，一个黄色的中等正方形，一个黄色的大正方形。在中间的盒子里，有一个黑色的中等三角形，一个黑色的中等圆形，一个蓝色的中等三角形，一个黑色的小圆形，一个黑色的中等三角形。在右边的盒子里，有一个黑色的小正方形，一个黄色的大三角形，一个蓝色的小正方形，一个黑色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "large", "left"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的大三角形，一个蓝色的小三角形，一个黄色的大圆形，一个黄色的小正方形。在中间的盒子里，有一个蓝色的中等正方形，一个黑色的中等三角形，一个蓝色的小正方形，一个黑色的中等三角形，一个蓝色的大三角形。在右边的盒子里，有一个黑色的小正方形，一个黑色的中等正方形，一个蓝色的小正方形，一个蓝色的中等三角形，一个蓝色的中等圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "large", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的小圆形，一个黄色的小圆形，一个黄色的大圆形，一个黑色的大圆形。在中间的盒子里，有两个黄色的小圆形，一个黑色的大圆形，一个黄色的小正方形。在右边的盒子里，有一个黑色的中等大小的正方形，一个黑色的中等大小的圆形，一个黑色的小正方形。如何将所有黄色物品移动到左边的盒子里？", "label": [["yellow", "round", "small", "middle"], ["yellow", "round", "small", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黄色的小圆形，一个黑色的小三角形，一个蓝色的大三角形，一个蓝色的中等圆形。在中间的盒子里，有一个黄色的中等三角形，一个黄色的中等三角形，一个黑色的中等三角形，一个蓝色的中等正方形，一个黑色的中等正方形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的小正方形，一个黑色的中等正方形，一个黑色的小圆形，一个蓝色的大圆形，一个黄色的大正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "small", "left"], ["blue", "triangle", "large", "left"], ["yellow", "triangle", "middle", "middle"], ["yellow", "triangle", "middle", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形，一个黄色的小正方形，一个黑色的大正方形。中间的盒子里有一个蓝色的小圆形，一个黑色的小三角形，一个黄色的大圆形，一个蓝色的大三角形。右边的盒子里有一个蓝色的中等三角形，一个黑色的中等正方形，一个黑色的大三角形，一个蓝色的小三角形，一个黑色的大三角形，一个黑色的中等三角形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "small", "left"], ["black", "square", "large", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黑色的大圆形，一个蓝色的中等三角形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的大正方形，一个蓝色的大三角形，一个黄色的大正方形，一个黄色的小正方形，一个黄色的大正方形。在右边的盒子里，有一个黑色的小正方形，一个黄色的小三角形，一个黑色的小圆形，一个蓝色的小正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "middle", "left"], ["blue", "triangle", "middle", "left"], ["blue", "square", "large", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黄色正方形，一个中黄色圆形，一个小黄色三角形，一个中黄色圆形，一个小黄色圆形，一个蓝色中等三角形。在中间的盒子里，有一个中黄色圆形，一个小黄色正方形，一个蓝色小正方形，一个黑色小正方形，一个黑色小圆形。在右边的盒子里，有一个大黑色三角形，一个小黄色正方形，一个蓝色小正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "round", "middle", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的大正方形，一个蓝色的小正方形，一个黄色的大正方形，一个蓝色的小圆形。在中间的盒子里，有一个黑色的大三角形，一个黄色的小正方形，一个黄色的小三角形，一个蓝色的大圆形。在右边的盒子里，有一个蓝色的小三角形，一个黄色的大圆形，一个蓝色的中间三角形，一个黑色的小圆形，一个黄色的大正方形，一个蓝色的大正方形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "large", "right"], ["black", "round", "small", "right"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个蓝色的小圆形，一个蓝色的大正方形。中间的盒子里有一个黄色的小三角形，一个蓝色的中等圆形，一个蓝色的大正方形，一个黑色的小三角形，一个黄色的大圆形，一个黄色的大三角形。右边的盒子里有一个黄色的中等三角形，一个黄色的大圆形，一个黑色的大正方形，一个黑色的中等正方形，一个黑色的大三角形，一个蓝色的小圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["blue", "round", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黑色的大圆形、一个黄色的中等三角形、一个蓝色的中等圆形、一个黄色的小正方形和一个蓝色的大正方形。中间的盒子里有一个黄色的大三角形、一个黄色的中等正方形和一个黑色的中等三角形。右边的盒子里有一个黄色的大圆形、一个蓝色的小圆形和一个黄色的中等三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["black", "round", "large", "left"], ["blue", "round", "middle", "left"], ["yellow", "round", "large", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黄色的小圆形，一个黄色的中等正方形，一个黑色的大圆形，一个蓝色的小正方形，一个蓝色的中等圆形。在中间的盒子里，有一个蓝色的小圆形，一个黄色的中等三角形，一个蓝色的中等三角形，一个黑色的小正方形，一个黄色的小三角形。在右边的盒子里，有一个黄色的大正方形，一个蓝色的大圆形，一个黑色的大圆形，一个黑色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "left"], ["black", "round", "large", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "large", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黑色的中等正方形、一个蓝色的中等圆形、一个蓝色的大正方形和一个蓝色的中等三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大圆形和一个蓝色的大三角形。右边的盒子里有一个蓝色的大正方形和一个黑色的小圆形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "square", "small", "middle"], ["blue", "round", "large", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黄色的中等三角形，一个黄色的中等正方形，一个黄色的中等正方形，一个黑色的大三角形。在中间的盒子里，有一个黄色的小圆形，一个黑色的中等正方形，一个黄色的小圆形，一个蓝色的大正方形。在右边的盒子里，有一个黑色的中等三角形，一个黄色的大正方形，一个黄色的中等正方形，一个黑色的大三角形，一个黄色的大三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的中等正方形、一个蓝色的中等三角形和一个黄色的大圆形。中间的盒子里有一个黑色的中等三角形、一个黑色的中等圆形、一个黑色的小正方形、一个黄色的大正方形、一个黑色的中等正方形和一个黑色的大圆形。右边的盒子里有一个黄色的大正方形、一个蓝色的小三角形和一个蓝色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的大正方形，一个黄色的小正方形，一个蓝色的小正方形，一个黑色的大三角形，一个黄色的小圆形。在中间的盒子里，有一个黄色的中等正方形，一个蓝色的大圆形，一个蓝色的小正方形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的中等三角形，一个黄色的小圆形，一个黄色的小三角形，一个黑色的大圆形，一个黑色的大圆形。如何将所有正方形移动到右边的盒子中？", "label": [["blue", "square", "large", "left"], ["yellow", "square", "small", "left"], ["blue", "square", "small", "left"], ["yellow", "square", "middle", "middle"], ["blue", "square", "small", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形、一个黄色的小正方形、一个黑色的中等三角形、一个蓝色的大圆形和一个黑色的中等圆形。中间的盒子里有一个黑色的大圆形、一个黄色的大圆形和一个蓝色的中等圆形。右边的盒子里有一个黄色的中等三角形和一个黄色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黑色的中圆形，一个蓝色的大正方形，一个蓝色的中圆形。在中间的盒子里，有一个黄色的大三角形，一个黑色的中三角形，一个黄色的大正方形。在右边的盒子里，有一个黑色的中正方形，一个黑色的大正方形，一个黄色的中三角形，一个黄色的中圆形，一个蓝色的大正方形，一个蓝色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "middle", "right"], ["black", "square", "large", "right"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的小圆形，一个蓝色的中等正方形，一个蓝色的大正方形，一个蓝色的小三角形。在中间的盒子里，有一个蓝色的大圆形，一个蓝色的大圆形，一个黑色的大圆形，一个黑色的小圆形，一个蓝色的中等正方形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的大圆形，一个黑色的中等三角形，一个蓝色的小圆形，一个黑色的中等圆形，一个黑色的小三角形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "left"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的中等正方形，一个蓝色的小圆形，一个黄色的大正方形，一个蓝色的大三角形。在中间的盒子里，有一个黑色的中等正方形，一个黑色的大三角形，一个蓝色的小三角形，一个黑色的大正方形，一个黑色的中等正方形，一个蓝色的中等正方形。在右边的盒子里，有一个黄色的中等三角形，一个蓝色的小三角形，一个黑色的小圆形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "square", "large", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的小圆形、一个黑色的中圆形和一个蓝色的中方形。中间的盒子里有一个黄色的大三角形、一个黄色的中圆形、一个黄色的小方形、一个黑色的中三角形和一个蓝色的小圆形。右边的盒子里有一个黑色的大三角形和一个蓝色的中三角形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "triangle", "large", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "你好，有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黄色的小正方形，一个黑色的小正方形，一个黑色的中等三角形，一个黄色的大三角形。在中间的盒子里，有一个黄色的小正方形，一个黄色的中等正方形，一个蓝色的大正方形，一个黄色的中等圆形，一个蓝色的中等圆形，一个黑色的中等三角形。在右边的盒子里，有一个蓝色的大正方形，一个黑色的小三角形。请问如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色正方形和一个小黑色正方形。中间的盒子里有一个小蓝色圆形、一个大蓝色三角形和一个大蓝色正方形。右边的盒子里有一个大黑色三角形、一个小黑色三角形和一个大蓝色正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "small", "right"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黄色的中圆形、一个黄色的小圆形和一个黑色的大圆形。中间的盒子里有一个黄色的中方形和一个黄色的大圆形。右边的盒子里有一个蓝色的大圆形、一个黑色的小方形和一个黄色的大三角形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "round", "middle", "left"], ["yellow", "round", "small", "left"], ["yellow", "square", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等大小的正方形和一个黑色的大圆形。中间的盒子里有一个黄色的小正方形、一个黄色的小正方形、一个黄色的小三角形和一个黄色的大正方形。右边的盒子里有一个黑色的大圆形、一个黑色的中等大小的三角形和一个蓝色的中等大小的三角形。如何将所有蓝色物品移到右边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的小正方形，一个蓝色的小正方形，一个黄色的大圆形。在中间的盒子里，有一个蓝色的大三角形，一个黑色的中等大小的正方形，一个黑色的小三角形。在右边的盒子里，有一个黄色的大三角形，一个黄色的中等大小的圆形，一个蓝色的大圆形，一个黑色的大三角形，一个黑色的中等大小的三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的大正方形，两个黑色的中等大小的正方形。在中间的盒子里，有一个蓝色的大圆形，三个蓝色的大三角形，一个黄色的大正方形，一个黄色的中等大小的正方形，一个蓝色的大圆形。在右边的盒子里，有一个蓝色的大正方形，两个黄色的小三角形，一个蓝色的中等大小的圆形，一个黑色的大圆形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "square", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "large", "middle"], ["blue", "triangle", "large", "middle"], ["blue", "triangle", "large", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的大正方形，一个蓝色的中等正方形，一个黄色的大正方形，一个蓝色的小圆形。在中间的盒子里，有一个黄色的小正方形，一个黑色的小圆形，一个黄色的中等圆形，一个黄色的大三角形，一个黄色的中等正方形。在右边的盒子里，有一个黑色的中等三角形，一个黄色的中等正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黄色圆形、一个大黑色圆形、一个大黄色三角形、一个大黄色圆形。在中间的盒子里，有一个大黄色正方形、一个中等大小的黑色三角形、一个中等大小的蓝色三角形、一个大黄色圆形。在右边的盒子里，有一个小黑色三角形、一个小黑色圆形、一个中等大小的黄色正方形、一个大黄色三角形、一个大黄色三角形、一个大黑色三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "large", "left"], ["black", "triangle", "small", "right"], ["black", "round", "small", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个蓝色的中等三角形、一个蓝色的小三角形、一个黄色的小圆形、一个蓝色的大三角形、一个蓝色的中等圆形。在中间的盒子里，有一个黑色的中等圆形、一个黑色的中等正方形、一个蓝色的小圆形、一个黄色的中等圆形、一个黄色的小圆形、一个黄色的中等正方形。在右边的盒子里，有一个黑色的中等正方形、一个蓝色的中等圆形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "middle", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形，一个蓝色的小圆形，一个蓝色的中等圆形，一个黄色的大三角形。中间的盒子里有一个蓝色的中等正方形，一个黑色的大正方形，两个蓝色的大圆形，一个蓝色的中等三角形。右边的盒子里有一个黑色的小正方形，一个蓝色的小圆形。如何将所有正方形移到中间的盒子里？", "label": [["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形和一个黄色的中间三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大三角形、一个黄色的小三角形、一个蓝色的中间圆形、一个黄色的小正方形和一个黄色的大三角形。右边的盒子里有一个黄色的大正方形和一个黄色的大三角形。如何将所有蓝色物品移动到中间的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个蓝色的大三角形和一个蓝色的大正方形。中间的盒子里有一个蓝色的中等三角形、一个蓝色的小正方形、一个黑色的中等正方形和一个黄色的小圆形。右边的盒子里有一个蓝色的大正方形、一个黄色的小正方形、一个蓝色的大三角形、一个黑色的大圆形和一个蓝色的中等圆形。如何将所有黄色物品移到中间的盒子？", "label": [["yellow", "square", "small", "right"]]}, {"data": "你好，有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的中圆形，一个黑色的小三角形，一个黄色的小正方形，一个黑色的大圆形。在中间的盒子里，有一个黄色的中等三角形，一个黑色的大三角形，一个黑色的大三角形，一个黑色的中圆形，一个黄色的中等三角形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的小圆形和一个黄色的大正方形。请问如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "small", "right"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个黑色的大三角形，一个黄色的大三角形。中间的盒子里有一个蓝色的中等大小的正方形，一个蓝色的中等大小的圆形，一个黄色的中等大小的正方形，一个黄色的大圆形。右边的盒子里有一个黑色的大圆形，一个蓝色的中等大小的三角形，一个黑色的小三角形。如何将所有正方形移到左边的盒子中？", "label": [["blue", "square", "middle", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形和一个黑色的中圆形。中间的盒子里有一个蓝色的大圆形、一个蓝色的中圆形和一个蓝色的大圆形。右边的盒子里有一个蓝色的中正方形、一个黄色的大三角形、一个蓝色的中圆形、一个蓝色的中圆形、一个黄色的小三角形和一个蓝色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "middle", "right"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黑色的大圆形、一个蓝色的中等三角形和一个蓝色的大三角形。中间的盒子里有一个黄色的小正方形、一个黑色的小圆形和一个蓝色的小正方形。右边的盒子里有一个蓝色的中等三角形、一个黄色的大圆形、一个黄色的中等三角形、一个蓝色的中等正方形和一个黄色的小正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "small", "left"], ["black", "round", "large", "left"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形，一个黄色的小三角形，一个蓝色的中等大小正方形。中间的盒子里有一个蓝色的中等大小三角形，一个蓝色的大圆形，一个黑色的小正方形，一个黑色的小正方形。右边的盒子里有一个蓝色的小圆形，一个黑色的小三角形，一个黑色的大圆形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["blue", "square", "middle", "left"], ["black", "square", "small", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黄色的大三角形，一个蓝色的中等三角形，一个蓝色的中等三角形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的小圆形，一个黄色的小圆形，一个黄色的大正方形。在右边的盒子里，有一个蓝色的中等圆形，一个黑色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "left"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个蓝色的中等圆形，一个黑色的大正方形。中间的盒子里有一个蓝色的大正方形，一个黄色的中等三角形，一个蓝色的小圆形。右边的盒子里有一个蓝色的小正方形，一个蓝色的小三角形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "large", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形，一个黑色的中等三角形，一个黑色的中等三角形，一个黑色的小正方形，一个蓝色的大正方形。中间的盒子里有一个黑色的大正方形，一个蓝色的中等圆形，一个黄色的中等三角形，一个蓝色的大三角形。右边的盒子里有一个黄色的中等三角形，一个黄色的小正方形，一个黄色的大正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个蓝色的小三角形。中间的盒子里有一个黄色的大三角形和一个黑色的小圆形。右边的盒子里有一个蓝色的中等大小的圆形和一个蓝色的大圆形。如何将所有黑色物体移动到中间的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色圆形、一个大黑色圆形、一个蓝色大三角形、一个蓝色小正方形、一个蓝色大正方形和一个蓝色大正方形。在中间的盒子里，有一个小蓝色圆形、一个黑色中等大小的正方形和一个黑色大三角形。在右边的盒子里，有一个黄色大正方形、一个黄色中等大小的圆形、一个黑色中等大小的圆形、一个小黄色正方形和一个黄色中等大小的正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "small", "left"], ["black", "round", "large", "left"], ["yellow", "round", "middle", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形和一个黄色的小圆形。中间的盒子里有一个黑色的大正方形、一个黑色的大圆形、一个黄色的大圆形和一个蓝色的中等大小的圆形。右边的盒子里有一个蓝色的大圆形、一个黑色的大三角形、一个蓝色的中等大小的圆形、一个蓝色的中等大小的正方形和一个黄色的中等大小的三角形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "middle", "left"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的中等圆形，一个黄色的中等圆形，一个黄色的小圆形，一个蓝色的小三角形，一个蓝色的中等正方形。在中间的盒子里，有一个蓝色的小三角形，一个黄色的小三角形，一个黑色的小圆形，一个黑色的小正方形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的中等圆形，一个黄色的大三角形，一个黑色的中等圆形，一个蓝色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "round", "middle", "right"], ["black", "round", "small", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的中等正方形，一个黄色的小圆形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的中等三角形，一个蓝色的大三角形，一个蓝色的大三角形，一个黄色的小圆形。在右边的盒子里，有一个黄色的中等三角形，一个黄色的中等圆形，一个黑色的中等圆形，一个蓝色的大圆形，一个黑色的大圆形，一个黄色的中等圆形。如何将所有正方形移动到中间的盒子中？", "label": [["black", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黑色的小圆形，一个黑色的小三角形，一个黑色的小三角形，一个蓝色的小圆形，一个蓝色的中等圆形。在中间的盒子里，有一个黄色的小圆形，一个蓝色的中等正方形，一个蓝色的小正方形。在右边的盒子里，有一个黑色的中等三角形，一个黄色的大三角形，一个黑色的小三角形，一个黑色的中等正方形，一个蓝色的中等正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "large", "left"], ["blue", "round", "small", "left"], ["blue", "round", "middle", "left"], ["blue", "square", "middle", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黄色的中等正方形和一个蓝色的大正方形。中间的盒子里有一个黑色的中等圆形、一个黄色的大正方形、一个黑色的小三角形、一个黄色的中等正方形和一个黑色的中等正方形。右边的盒子里有一个黄色的小正方形和一个黑色的大三角形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形、一个黄色的小正方形和一个黄色的中等圆形。中间的盒子里有一个蓝色的小正方形、一个蓝色的小正方形、一个黄色的中等三角形、一个黄色的小正方形和一个蓝色的大圆形。右边的盒子里有一个黑色的小圆形、一个蓝色的中等三角形和一个蓝色的中等圆形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个小黄三角形，一个黑色中等正方形，一个小黑正方形，一个蓝色中等三角形，一个蓝色大圆形。在中间的盒子里，有一个黄色大圆形，一个黄色大圆形，一个蓝色中等圆形，一个蓝色大圆形，一个小黄三角形，一个黄色大圆形。在右边的盒子里，有一个小黄圆形，一个黄色大圆形，一个黄色大正方形，一个蓝色小正方形。如何将所有黑色物品移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的中等三角形、一个黄色的中等正方形、一个黑色的大正方形。中间的盒子里有一个黄色的中等三角形、一个黄色的小正方形、一个黄色的中等正方形、一个蓝色的大圆形、一个黑色的大三角形、一个黄色的中等三角形。右边的盒子里有一个黑色的中等圆形、一个黄色的中等三角形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "right"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形、一个蓝色的大圆形、一个黄色的小正方形、一个黑色的小圆形和一个黑色的中等大小的三角形。中间的盒子里有一个蓝色的大三角形和一个黄色的大圆形。右边的盒子里有一个黄色的大三角形、一个蓝色的中等大小的三角形和一个黑色的小圆形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形、一个蓝色的小三角形、一个蓝色的中等三角形和一个黄色的大圆形。中间的盒子里有一个黑色的大正方形、一个蓝色的中等三角形、一个黄色的小正方形和一个蓝色的大圆形。右边的盒子里有一个蓝色的中等正方形和一个黄色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "large", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黑色的大三角形，一个蓝色的中间三角形，一个蓝色的中间三角形，一个蓝色的中间三角形，一个黑色的中间正方形。在中间的盒子里，有一个黑色的小圆形，一个黑色的大正方形，一个蓝色的中间圆形，一个蓝色的大正方形，一个黄色的大圆形，一个黑色的小正方形。在右边的盒子里，有一个黄色的小圆形，一个黑色的大三角形，一个黑色的小圆形，一个黄色的中间三角形，一个黑色的中间正方形，一个黄色的小圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黄色三角形，一个大黄色圆形，一个大黄色三角形，一个中等黄色圆形。在中间的盒子里，有一个中等蓝色圆形，一个小黑色圆形，一个小蓝色三角形，一个小黄色正方形，一个大黄色正方形。在右边的盒子里，有一个小蓝色三角形，一个小黑色三角形，一个大蓝色正方形，一个小蓝色正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "large", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形和一个蓝色的中间三角形。中间的盒子里有一个黑色的中间正方形和一个黄色的小圆形。右边的盒子里有一个蓝色的中间三角形和一个黑色的大正方形。如何将所有的圆形移到左边的盒子中？", "label": [["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的大圆形、一个黑色的大三角形、一个蓝色的中等三角形、一个蓝色的大三角形、一个黄色的大三角形。中间的盒子里有一个蓝色的大三角形、一个蓝色的大圆形。右边的盒子里有一个蓝色的小正方形、一个黄色的小三角形。如何将所有正方形移动到右边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个黄色的大圆形，一个蓝色的大圆形。中间的盒子里有一个蓝色的大正方形，一个黄色的中等大小的正方形。右边的盒子里有一个黄色的小圆形，一个黄色的中等大小的圆形，一个黄色的中等大小的正方形，一个黑色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "large", "left"], ["blue", "round", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的小三角形，一个黑色的中等三角形，一个黄色的大圆形，一个黄色的中等圆形，一个黑色的大正方形。在中间的盒子里，有一个黑色的中等圆形，一个蓝色的中等圆形，一个黄色的大三角形。在右边的盒子里，有一个黑色的中等圆形，一个蓝色的中等正方形，一个黑色的大正方形，一个蓝色的小圆形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形、一个黄色的大圆形、一个黑色的大正方形、一个黄色的中等三角形。中间的盒子里有一个蓝色的小圆形、一个黄色的小圆形、一个黑色的大正方形、一个黄色的中等圆形、一个蓝色的大正方形。右边的盒子里有一个黄色的大圆形、一个黑色的中等圆形、一个黄色的小圆形。如何将所有蓝色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个大黑色圆形、一个黄色中等圆形、一个大黄色圆形、一个黑色中等圆形、一个小黑色正方形、一个黄色中等三角形。在中间的盒子里，有一个小黑色圆形、一个黄色小三角形、一个蓝色中等三角形、一个黄色中等圆形、一个黄色中等三角形、一个蓝色大三角形。在右边的盒子里，有一个小黑色圆形、一个黄色小正方形、一个蓝色小正方形、一个黑色大三角形、一个蓝色中等三角形、一个黄色大圆形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "round", "large", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "small", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黑色的中间三角形，一个蓝色的小三角形，一个黄色的中间三角形。在中间的盒子里，有一个黑色的大圆形，一个黑色的大三角形，一个蓝色的大圆形，一个黑色的大正方形，一个黄色的大正方形。在右边的盒子里，有一个蓝色的中间圆形，一个黑色的中间正方形，一个蓝色的大圆形，一个黄色的小正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个黄色的中号三角形、一个黑色的大号圆形和一个黄色的中号圆形。中间的盒子里有一个黄色的大号三角形和一个蓝色的中号圆形。右边的盒子里有一个黄色的中号圆形、一个黄色的中号圆形、一个黑色的小号正方形、一个蓝色的大号圆形和一个黑色的中号正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形、一个蓝色的中间正方形和一个黄色的中间圆形。中间的盒子里有一个蓝色的小圆形、一个蓝色的中间三角形、一个黑色的大圆形、一个黄色的小圆形、一个黑色的小三角形和一个黑色的小圆形。右边的盒子里有一个蓝色的中间正方形和一个蓝色的中间圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "small", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的中等正方形、一个黑色的小圆形、一个蓝色的小圆形和一个蓝色的中等圆形。中间的盒子里有一个黑色的中等圆形和一个蓝色的小正方形。右边的盒子里有一个黑色的小三角形和一个黄色的大三角形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形和一个黄色的大三角形。中间的盒子里有一个黑色的中等圆形、一个黄色的大正方形和一个黑色的中等正方形。右边的盒子里有一个黑色的中等圆形和一个黄色的大三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个黄色的大正方形，一个蓝色的中等圆形，一个黑色的中等圆形。中间的盒子里有一个黄色的小圆形，一个黑色的中等正方形。右边的盒子里有一个蓝色的小三角形，一个黑色的小三角形，一个黄色的大圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的大正方形，一个黄色的大圆形，一个黄色的中等正方形。在中间的盒子里，有一个蓝色的中等正方形，一个黑色的小圆形，一个蓝色的中等三角形，一个蓝色的中等正方形，一个黑色的中等圆形，一个蓝色的中等圆形。在右边的盒子里，有一个蓝色的中等三角形，一个黄色的小正方形，一个黑色的小三角形，一个蓝色的中等三角形，一个黄色的小圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "small", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形和一个黑色的大三角形。中间的盒子里有一个黑色的大圆形、一个黄色的小圆形、一个蓝色的中等圆形、一个黑色的大圆形和一个黄色的大圆形。右边的盒子里有一个黑色的中等正方形、一个黑色的小三角形、一个黑色的大三角形和一个黄色的中等圆形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黑色的小圆形、一个黄色的大三角形、一个蓝色的中等三角形和一个黄色的中等圆形。中间的盒子里有一个黄色的小正方形、一个蓝色的大正方形、一个黄色的中等正方形、两个黄色的小圆形和一个黄色的小三角形。右边的盒子里有一个黄色的小圆形、一个蓝色的大圆形、两个黄色的小圆形、一个蓝色的中等三角形、一个黑色的小三角形和一个黑色的中等正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"], ["black", "triangle", "small", "right"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黄色的中等正方形和一个黄色的小正方形。中间的盒子里有一个黑色的大三角形和一个黄色的大圆形。右边的盒子里有一个黑色的大三角形和一个黑色的中等正方形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个小黄色圆形、一个大黄色圆形。中间的盒子里有一个黑色中等大小的圆形、一个蓝色大三角形、一个黑色大正方形、一个黑色小圆形。右边的盒子里有一个蓝色大三角形、一个黑色小圆形、一个蓝色小三角形。如何将所有黄色物品移到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黄色的小圆形。中间的盒子里有一个黄色的大圆形和一个黑色的小正方形。右边的盒子里有一个蓝色的大正方形、一个黄色的小三角形、一个黄色的中等大小的正方形、一个黑色的小三角形和一个蓝色的小三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的小正方形和一个黄色的中等圆形。中间的盒子里有一个蓝色的大圆形、一个蓝色的大三角形和一个黑色的中等三角形。右边的盒子里有一个蓝色的小圆形、一个蓝色的大圆形、一个黑色的大正方形和一个蓝色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["yellow", "round", "middle", "left"], ["blue", "round", "small", "right"], ["blue", "round", "large", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黑色的大三角形和一个黄色的中等正方形。中间的盒子里有一个黄色的大三角形和一个黑色的小圆形。右边的盒子里有一个黄色的大三角形、一个蓝色的大三角形、一个黑色的小三角形和一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "large", "left"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个蓝色的大圆形，一个蓝色的大三角形，一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的中等正方形。在中间的盒子里，有一个蓝色的中等三角形，一个黄色的小三角形，一个黄色的中等三角形，一个蓝色的中等圆形，一个黄色的中等正方形。在右边的盒子里，有一个蓝色的大三角形，一个黑色的大圆形，一个蓝色的大三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "left"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黄色的中等三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大圆形和一个黄色的小三角形。右边的盒子里有一个黑色的小三角形、一个蓝色的小圆形、一个蓝色的大圆形、一个黑色的中等正方形、一个黄色的大圆形和一个黄色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "right"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黑色的小正方形，一个蓝色的大正方形。中间的盒子里有一个蓝色的中等正方形，一个黄色的小三角形，一个黄色的大正方形，一个蓝色的小正方形，一个黑色的中等三角形，一个蓝色的小圆形。右边的盒子里有一个黄色的中等三角形，一个蓝色的中等三角形，一个黄色的小正方形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "square", "large", "left"], ["blue", "square", "middle", "middle"], ["blue", "square", "small", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形，一个蓝色的小圆形，一个黄色的大正方形。中间的盒子里有一个蓝色的大三角形，一个蓝色的大三角形。右边的盒子里有一个黑色的中等大小的三角形，一个黑色的大正方形，一个黑色的小三角形，一个黑色的中等大小的三角形，一个蓝色的大三角形，一个黑色的中等大小的圆形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的中等三角形，一个黄色的大圆形，一个黑色的小三角形。在中间的盒子里，有一个黄色的中等三角形，一个黑色的中等圆形，一个黄色的大圆形，一个蓝色的小三角形，一个蓝色的中等三角形，一个蓝色的大三角形。在右边的盒子里，有一个蓝色的小圆形，一个黑色的中等三角形，一个蓝色的大三角形，一个蓝色的小正方形，一个黑色的中等圆形，一个蓝色的大正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "left"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个蓝色的大圆形，一个黑色的中圆形，一个蓝色的大三角形，一个黄色的小圆形。在中间的盒子里，有一个黄色的大三角形，一个黑色的小三角形，一个黄色的大三角形，一个黄色的大三角形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的中三角形，一个黑色的中圆形，一个蓝色的小三角形，一个黄色的中圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"], ["blue", "triangle", "small", "right"], ["yellow", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"], ["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等圆形，一个蓝色的小三角形，一个蓝色的小正方形，一个黑色的小三角形，一个黑色的大圆形。在中间的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的小圆形，一个蓝色的大正方形，一个黑色的大三角形，一个黑色的中等圆形，一个黑色的小圆形，一个黄色的小圆形。如何将所有正方形移动到右边的盒子中？", "label": [["blue", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的小三角形，一个蓝色的大正方形，一个蓝色的大正方形，一个黄色的大正方形，一个黑色的小圆形。在中间的盒子里，有一个黑色的小正方形，一个黑色的小三角形，一个黑色的小正方形。在右边的盒子里，有一个黄色的小三角形，一个蓝色的中等正方形，一个蓝色的小正方形，一个黑色的大圆形，一个蓝色的中等圆形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "square", "large", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的中圆形，一个黄色的大圆形。在中间的盒子里，有一个蓝色的中等三角形，一个黄色的小正方形，一个蓝色的中等正方形，一个蓝色的小正方形。在右边的盒子里，有一个黑色的大三角形，一个黄色的小正方形，一个蓝色的中等三角形，一个黄色的中圆形，一个蓝色的中圆形，一个黄色的大正方形。如何将所有黑色物体移动到中间的盒子中？", "label": [["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黑色的大正方形、两个蓝色的大正方形和一个黑色的小三角形。中间的盒子里有一个黑色的大圆形、一个蓝色的大三角形和一个蓝色的小圆形。右边的盒子里有一个蓝色的大三角形、一个蓝色的小正方形和一个黄色的小正方形。如何将所有黑色物品移动到右边的盒子？", "label": [["black", "square", "large", "left"], ["black", "triangle", "small", "left"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中圆、一个黄色的中圆、一个蓝色的中圆、一个黑色的中圆、一个蓝色的小圆。在中间的盒子里，有一个黄色的中圆、一个蓝色的中圆、一个黑色的小正方形、一个黑色的小正方形、一个黄色的中三角形。在右边的盒子里，有一个黄色的中三角形、一个蓝色的大三角形、一个黄色的小三角形、一个黑色的小正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形、一个黑色的中等圆形、一个黄色的中等正方形、一个黄色的中等正方形和一个蓝色的大正方形。中间的盒子里有一个黄色的中等圆形、一个蓝色的小圆形、一个蓝色的大圆形和一个黑色的小圆形。右边的盒子里有一个黑色的小圆形和一个蓝色的大三角形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "large", "left"], ["blue", "round", "small", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黑三角形、一个小黑圆形、一个小黑三角形、一个小黑圆形和一个中黑圆形。在中间的盒子里，有一个蓝色的中等圆形和一个蓝色的中等三角形。在右边的盒子里，有一个蓝色的小圆形、一个黄色的中等正方形、一个黄色的中等圆形、一个黑色的中等圆形、一个蓝色的小正方形和一个蓝色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大圆形，一个黑色的小三角形，一个蓝色的小正方形，一个黄色的小正方形，一个黑色的中等圆形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的中等正方形，两个黄色的中等圆形，一个蓝色的中等圆形。在右边的盒子里，有一个蓝色的中等圆形，一个黄色的中等正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "small", "left"], ["black", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形和一个黑色的小三角形。中间的盒子里有一个蓝色的大圆形、一个蓝色的大正方形和一个黑色的大圆形。右边的盒子里有一个黄色的小三角形、一个蓝色的中等大小的圆形、一个蓝色的小三角形、一个黄色的大正方形和一个黑色的小三角形。如何将所有的正方形移到左边的盒子里？", "label": [["yellow", "square", "large", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黑色的大三角形、一个黄色的大正方形和一个蓝色的中等三角形。中间的盒子里有一个蓝色的大圆形、一个黄色的大正方形、一个黄色的大圆形和一个黑色的小圆形。右边的盒子里有一个黄色的中等三角形、一个黑色的大圆形、一个黑色的中等圆形和一个蓝色的中等正方形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个黄色的大正方形，一个蓝色的小三角形，一个黄色的大圆形，一个蓝色的小圆形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的小三角形，一个蓝色的中圆形，一个蓝色的中圆形，一个蓝色的小三角形，一个黑色的大三角形。在右边的盒子里，有一个黄色的小圆形，一个黑色的小正方形，一个黄色的小三角形，一个蓝色的中正方形，一个黄色的小三角形，一个蓝色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "triangle", "small", "right"], ["blue", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个蓝色的大号圆形、一个黑色的小号圆形、一个黑色的中号正方形、一个黑色的大号正方形、一个黑色的中号三角形。中间的盒子里有一个黑色的中号三角形、一个黑色的中号正方形、一个蓝色的中号三角形、一个蓝色的小号圆形。右边的盒子里有一个黑色的中号三角形、一个黑色的大号圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "small", "left"], ["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["black", "triangle", "middle", "left"], ["black", "triangle", "middle", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的大正方形，一个蓝色的大三角形，一个蓝色的小圆形，一个蓝色的中等三角形，一个黑色的大正方形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大三角形，一个黄色的小三角形。在右边的盒子里，有一个黄色的小正方形，一个黑色的小圆形，一个蓝色的中等圆形，一个黄色的中等三角形。如何将所有的正方形移到左边的盒子里？", "label": [["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形，一个黑色的大圆形。中间的盒子里有一个黑色的大三角形，一个黄色的小正方形，一个黄色的大圆形，一个蓝色的大正方形。右边的盒子里有一个黄色的大圆形，一个黑色的中等大小的三角形，一个蓝色的小正方形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "large", "left"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个蓝色的大三角形、一个黑色的中等圆形和一个黑色的小圆形。中间的盒子里有一个黄色的大正方形、一个蓝色的小三角形、一个黄色的小圆形和一个黄色的大正方形。右边的盒子里有一个蓝色的小三角形、一个黄色的中等圆形、一个黑色的小正方形和一个蓝色的中等圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个蓝色的中等正方形，一个黑色的小圆形。中间的盒子里有一个黑色的大三角形，一个黑色的大圆形。右边的盒子里有一个蓝色的小圆形，一个黑色的中等圆形。如何将所有正方形移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黑色的大正方形、一个黄色的中等正方形、一个蓝色的小圆形和一个蓝色的小正方形。中间的盒子里有一个黑色的中等三角形和一个蓝色的大三角形。右边的盒子里有一个蓝色的中等正方形、一个黑色的大圆形和一个黑色的小三角形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形，一个蓝色中等大小的正方形。中间的盒子里有一个小黑色三角形，一个大黄色圆形，一个大黑色三角形，一个小黑色三角形。右边的盒子里有一个黑色中等大小的圆形，一个黑色中等大小的正方形，一个大黑色圆形，一个大黑色正方形，一个蓝色大正方形。如何将所有三角形移到右边的盒子中？", "label": [["black", "triangle", "small", "middle"], ["black", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的大三角形，一个黑色的中等三角形，一个黄色的小正方形，一个黄色的中等三角形。在中间的盒子里，有一个蓝色的大正方形，一个黄色的大圆形。在右边的盒子里，有一个黑色的中等三角形，一个黄色的中等正方形。如何将所有的圆形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个黄色的小正方形，一个蓝色的小圆形。中间的盒子里有一个蓝色的大三角形，一个黄色的大正方形，一个蓝色的中等正方形。右边的盒子里有一个黄色的小三角形，一个黑色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等大小的正方形和一个蓝色的小圆形。中间的盒子里有一个黑色的大三角形、一个蓝色的小正方形和一个蓝色的大三角形。右边的盒子里有一个黑色的中等大小的三角形和一个黄色的小正方形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个小蓝正方形，一个大黑圆形，一个中蓝三角形，一个小黑圆形。在中间的盒子里，有一个中蓝正方形，一个大蓝正方形。在右边的盒子里，有一个小黑圆形，一个中黑正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个黄色的大三角形和一个黄色的中等三角形。中间的盒子里有一个黄色的中等正方形、一个蓝色的大圆形和一个黑色的小正方形。右边的盒子里有一个黑色的小圆形、一个蓝色的中等正方形、一个黑色的大圆形、一个黄色的大三角形和一个黄色的中等三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个蓝色的大正方形和一个黑色的小正方形。中间的盒子里有两个黑色的小圆形和一个黄色的中等圆形。右边的盒子里有一个黑色的中等圆形、一个黄色的小三角形、一个蓝色的中等圆形和一个黑色的中等正方形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的中圆形，一个蓝色的小三角形，一个蓝色的中方形，一个黑色的中方形。在中间的盒子里，有一个黄色的大方形，一个黑色的小三角形，一个蓝色的小方形，一个黑色的小圆形。在右边的盒子里，有一个黄色的大三角形，一个黑色的小圆形，一个黑色的小三角形，一个蓝色的中方形。如何将所有的方形移到左边的盒子里？", "label": [["blue", "square", "middle", "right"], ["yellow", "square", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形和一个黄色的小圆形。中间的盒子里有一个蓝色的小三角形和一个黑色的小正方形。右边的盒子里有一个黑色的大三角形、一个黄色的中等正方形和一个蓝色的中等三角形。如何将所有黄色物品移动到中间的盒子？请将以上文本翻译成中文。", "label": [["yellow", "round", "small", "left"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个蓝色的大正方形。中间的盒子里有一个黄色的小圆形、一个黑色的小三角形、一个黑色的中等圆形、一个黑色的中等正方形和一个黄色的大圆形。右边的盒子里有一个黑色的中等三角形和一个蓝色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "right"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形，一个黄色的大三角形，一个黑色的小三角形。中间的盒子里有一个黑色的中间正方形，一个蓝色的大三角形，一个黄色的大三角形，一个黄色的大圆形，一个黑色的中间圆形，一个黑色的中间三角形。右边的盒子里有一个黑色的大三角形，一个黄色的大正方形，一个黄色的中间正方形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "large", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个大黑色圆形、一个小黑色圆形、一个小黄色圆形、一个中等黑色正方形。中间的盒子里有一个中等黑色三角形、一个小黑色正方形。右边的盒子里有一个大蓝色圆形、一个大黄色圆形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个蓝色的大正方形。中间的盒子里有一个蓝色的小正方形、一个蓝色的小圆形和一个黄色的小三角形。右边的盒子里有一个黄色的中号圆形、一个蓝色的中号正方形和一个蓝色的中号圆形，还有一个黄色的大号圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["blue", "round", "middle", "right"], ["blue", "square", "small", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的中等三角形、一个黄色的小圆形、一个黑色的大圆形、一个黄色的大正方形、一个蓝色的大圆形。中间的盒子里有一个黑色的中等正方形、一个黄色的中等三角形。右边的盒子里有一个黑色的中等三角形、一个蓝色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个黑色的大正方形，一个黄色的中等圆形，一个黄色的中等三角形。中间的盒子里有一个蓝色的大圆形，一个黄色的小正方形，一个黑色的大三角形。右边的盒子里有一个蓝色的小正方形，一个黄色的大正方形，一个蓝色的小圆形，一个黑色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的大正方形，一个黑色的中等圆形，一个黄色的大正方形。在中间的盒子里，有一个黄色的小圆形，一个黄色的中等三角形，一个黑色的中等三角形，一个黑色的小正方形，一个黄色的中等三角形，一个黑色的中等正方形。在右边的盒子里，有一个蓝色的中等正方形，一个黑色的中等三角形，一个蓝色的小三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个蓝色的中等三角形，一个黄色的大正方形，一个黑色的大三角形。在中间的盒子里，有一个黄色的小三角形，一个黄色的大三角形，一个蓝色的大正方形，一个蓝色的小正方形，一个黑色的大三角形。在右边的盒子里，有一个黄色的中等正方形，一个蓝色的中等三角形，一个蓝色的小三角形，一个黑色的大圆形，一个蓝色的中等圆形，一个黄色的小圆形。如何将所有圆形移到中间的盒子里？", "label": [["black", "round", "large", "right"], ["blue", "round", "middle", "right"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个黑色的大圆形，一个黄色的小圆形，一个黄色的大圆形，一个黑色的大正方形，一个黄色的中等正方形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大三角形，一个黑色的中等圆形，一个黑色的中等正方形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形，一个黑色的大三角形，一个黄色的中等正方形，一个黑色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "small", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形和一个黑色的大三角形。中间的盒子里有一个黄色的中等大小的三角形、一个黄色的大三角形、一个黄色的大正方形、一个蓝色的中等大小的圆形和一个黄色的大三角形。右边的盒子里有一个蓝色的中等大小的正方形、一个黑色的大三角形和一个黑色的中等大小的三角形。如何将所有正方形移到中间的盒子里？", "label": [["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的中等圆形，一个黄色的大三角形，一个黑色的中等正方形，一个黑色的中等圆形。在中间的盒子里，有一个黑色的中等圆形，一个黄色的大三角形，一个黑色的小正方形，一个黄色的中等正方形，一个黄色的小正方形，一个黑色的大正方形。在右边的盒子里，有一个黑色的小圆形，一个黑色的中等圆形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "right"], ["black", "round", "middle", "right"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的大三角形，一个蓝色的大圆形，一个黄色的小圆形，一个黑色的大圆形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的大圆形，一个黑色的大正方形。在右边的盒子里，有一个黄色的小正方形，一个黑色的大三角形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形、一个黑色的中等正方形和一个黑色的小正方形。中间的盒子里有一个蓝色的小圆形和一个黄色的小圆形。右边的盒子里有一个黄色的小圆形和一个黑色的中等圆形。如何将所有正方形移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形，一个黑色的小三角形，一个黄色的中等三角形，一个黄色的中等正方形，一个黑色的大圆形和一个蓝色的小三角形。中间的盒子里有一个黑色的大三角形，一个黄色的大三角形，一个蓝色的大正方形和一个黄色的中等正方形。右边的盒子里有一个黑色的小三角形和一个黑色的大圆形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "small", "left"], ["yellow", "triangle", "middle", "left"], ["blue", "triangle", "small", "left"], ["black", "triangle", "large", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个蓝色的大圆形和一个蓝色的小三角形。中间的盒子里有一个黄色的大三角形、一个蓝色的中等大小的圆形和一个黑色的大圆形。右边的盒子里有一个黑色的中等大小的三角形和一个黄色的小圆形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个黑色的小正方形、一个黄色的大号圆形、一个黑色的小圆形和一个黑色的小正方形。中间的盒子里有一个黑色的中号三角形、一个黑色的大号三角形、两个蓝色的中号正方形和一个黄色的小圆形。右边的盒子里有一个黄色的中号正方形、一个蓝色的大号圆形和两个黄色的中号正方形。如何将所有黑色物品移到右边的盒子里？", "label": [["black", "square", "small", "left"], ["black", "round", "small", "left"], ["black", "square", "small", "left"], ["black", "triangle", "middle", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黑色的小正方形，一个蓝色的小圆形。中间的盒子里有一个蓝色的中等正方形，一个蓝色的中等正方形，一个黄色的中等三角形，一个黑色的大正方形。右边的盒子里有一个黑色的小圆形，一个蓝色的中等正方形，一个蓝色的大正方形，一个黑色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "small", "left"], ["blue", "square", "middle", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形和一个黄色的小三角形。中间的盒子里有一个蓝色的小圆形和一个黄色的中等大小的三角形。右边的盒子里有一个黄色的小正方形和一个蓝色的大三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的中等圆形、一个黄色的大正方形和一个蓝色的小三角形。中间的盒子里有一个黑色的中等三角形、一个黑色的中等三角形和一个黄色的小正方形。右边的盒子里有一个黑色的大正方形、一个黑色的小三角形、一个黑色的大正方形、一个黄色的中等三角形、一个黄色的小三角形和一个黄色的小圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "triangle", "middle", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个黄色的小正方形。中间的盒子里有一个黑色的大正方形、一个蓝色的小圆形、一个黑色的中等三角形、一个蓝色的中等三角形和一个黄色的大圆形。右边的盒子里有一个蓝色的中等正方形、一个黄色的小圆形和一个黄色的大三角形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黄色的中等三角形，一个黄色的小正方形，一个黑色的中等圆形，一个蓝色的小正方形，一个蓝色的中等圆形。在中间的盒子里，有一个蓝色的中等正方形，一个黄色的中等圆形，一个蓝色的小圆形，一个黄色的大圆形，一个黄色的小正方形。在右边的盒子里，有一个蓝色的小圆形，一个黄色的小三角形，一个蓝色的小三角形，一个黑色的中等圆形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中号圆形、一个蓝色的小正方形、一个黑色的中号圆形、一个蓝色的中号圆形、一个黑色的大正方形。在中间的盒子里，有一个黑色的大正方形、一个蓝色的大正方形、一个黑色的小圆形、一个黄色的大三角形、一个黑色的中号正方形、一个蓝色的中号圆形。在右边的盒子里，有一个黑色的小正方形、一个黄色的小正方形、一个黄色的中号圆形、一个蓝色的大三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["blue", "square", "large", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形、一个黄色的小正方形、一个蓝色的大正方形、一个蓝色的大圆形。在中间的盒子里，有一个黄色的中等大小的正方形、一个黄色的中等大小的三角形、一个黑色的大三角形、一个黄色的大三角形、一个蓝色的小三角形、一个黄色的中等大小的圆形。在右边的盒子里，有一个黄色的大正方形、一个蓝色的小圆形、一个黑色的中等大小的三角形、一个蓝色的小正方形、一个黑色的大圆形、一个黑色的小正方形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "large", "left"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黄色的中等三角形和一个蓝色的小圆形。中间的盒子里有一个蓝色的小圆形、一个蓝色的中等三角形和一个黑色的中等正方形。右边的盒子里有一个黑色的中等正方形、一个黄色的小正方形和一个黑色的大圆形。如何将所有蓝色物品移到中间的盒子？", "label": [["blue", "triangle", "small", "left"], ["blue", "round", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形，一个蓝色的小三角形，一个黄色的中等大小正方形。中间的盒子里有一个蓝色的小圆形，一个黑色的中等大小圆形，一个黄色的大三角形，一个黄色的大三角形，一个黄色的中等大小三角形。右边的盒子里有一个黑色的大三角形，一个黑色的大圆形。如何将所有正方形移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["yellow", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黄色的小三角形，一个蓝色的小三角形，一个黑色的小正方形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的中等圆形，一个黄色的中等圆形，一个黄色的大三角形，一个黑色的小圆形。在右边的盒子里，有一个黑色的小三角形，一个黑色的中等三角形，一个黄色的小三角形，一个蓝色的大圆形，一个蓝色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["blue", "triangle", "small", "left"], ["black", "triangle", "small", "right"], ["black", "triangle", "middle", "right"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个黄色中圆形，一个黑色大圆形，一个黄色中三角形，一个黄色大圆形。在中间的盒子里，有一个黑色小三角形，一个蓝色小正方形。在右边的盒子里，有一个蓝色中圆形，一个黄色中三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形、一个黄色的大圆形、一个黑色的小三角形和一个黑色的中等正方形。在中间的盒子里，有一个黄色的中等正方形、一个黑色的大正方形和一个黑色的大正方形。在右边的盒子里，有一个蓝色的大三角形、一个黑色的大正方形、一个黑色的中等圆形和一个黑色的大正方形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["black", "round", "middle", "right"], ["black", "square", "large", "right"], ["black", "square", "large", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个黑色的中等三角形，一个蓝色的中等正方形。中间的盒子里有一个黄色的中等正方形，一个蓝色的中等三角形，一个黄色的大圆形，一个黑色的中等正方形，一个蓝色的小三角形，一个黑色的小三角形。右边的盒子里有一个蓝色的中等三角形，一个蓝色的小正方形，一个黑色的大圆形。如何将所有黑色物品移动到右边的盒子？", "label": [["black", "triangle", "middle", "left"], ["black", "square", "middle", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形、一个蓝色的大圆形、一个蓝色的大正方形、一个蓝色的小圆形、一个蓝色的中等三角形和一个黄色的中等三角形。在中间的盒子里，有一个蓝色的小三角形、一个黑色的小圆形、一个黑色的中等三角形、一个黑色的小圆形和一个蓝色的小三角形。在右边的盒子里，有一个黑色的大三角形、一个黑色的大圆形、一个黑色的大圆形、一个黑色的中等圆形和一个蓝色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "right"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "middle", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形、一个蓝色的中等三角形、一个蓝色的大三角形、一个蓝色的中等正方形和一个黑色的小圆形。中间的盒子里有一个黑色的大正方形和一个黑色的大三角形。右边的盒子里有一个蓝色的中等圆形和一个黑色的小正方形。如何将所有的正方形移到左边的盒子里？", "label": [["black", "square", "small", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个黄色的大正方形。中间的盒子里有一个黄色的大三角形和一个黄色的大圆形。右边的盒子里有一个黄色的中等大小的正方形和一个蓝色的小三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个蓝色的中等正方形，一个黄色的小三角形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的中等圆形，一个黑色的大正方形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的大正方形，一个黑色的小三角形，一个黑色的小正方形，一个蓝色的小圆形，一个黑色的中等正方形，一个蓝色的中等正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "middle", "left"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的中圆形，一个黑色的小正方形，一个蓝色的大圆形。在中间的盒子里，有一个黄色的中正方形，一个黄色的大正方形。在右边的盒子里，有一个黄色的小圆形，一个黄色的中三角形，两个蓝色的小三角形，一个黄色的大正方形，一个黄色的小三角形。如何将所有黑色物体移动到中间的盒子中？", "label": [["black", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色正方形、一个中黑色正方形、一个小黄色正方形、一个中黄色正方形、一个小蓝色三角形。中间的盒子里有一个大黑色正方形、一个小蓝色正方形、一个小黑色正方形、一个中黄色正方形、一个大蓝色三角形。右边的盒子里有一个小黄色圆形、一个小黄色正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "square", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形、一个中等黑色三角形、一个小黑色三角形、一个蓝色中等圆形。中间的盒子里有一个蓝色小圆形、一个黄色大正方形、一个黑色大三角形。右边的盒子里有一个黄色大三角形、一个蓝色中等三角形、一个蓝色大正方形、一个黄色中等正方形、一个蓝色大三角形。如何将所有圆形移到中间的盒子里？", "label": [["black", "round", "small", "left"], ["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个蓝色的中号圆形和一个黄色的中号圆形。中间的盒子里有一个黑色的小正方形和一个黄色的大三角形。右边的盒子里有一个黑色的大圆形、一个蓝色的大三角形、一个黑色的小三角形、一个黄色的中号正方形、一个黑色的中号三角形和一个蓝色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的大正方形和一个黄色的小三角形。中间的盒子里有一个蓝色的中等大小的三角形、一个黄色的大圆形、一个黑色的小圆形和一个黑色的小三角形。右边的盒子里有一个黄色的中等大小的三角形、一个黑色的小三角形、一个黄色的小圆形和一个蓝色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["yellow", "round", "small", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黄色的小圆形、一个黑色的小三角形和一个黄色的小三角形。中间的盒子里有一个蓝色的大三角形、一个黄色的小三角形和一个黄色的大三角形。右边的盒子里有一个蓝色的小圆形、一个黑色的小圆形、一个黄色的小三角形、一个黄色的大三角形、一个黑色的中等三角形和一个黄色的中等圆形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "left"], ["blue", "round", "small", "right"], ["black", "round", "small", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黑色的中间正方形，一个黑色的大圆形。在中间的盒子里，有一个黑色的小圆形，一个蓝色的大圆形，一个黑色的小圆形，一个黄色的小三角形，一个蓝色的小正方形，一个黄色的大正方形。在右边的盒子里，有一个黑色的大正方形，一个黑色的小圆形，一个蓝色的小三角形，一个黄色的小正方形，一个黑色的中间三角形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "right"], ["black", "round", "small", "middle"], ["blue", "round", "large", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黑色的大三角形，一个黑色的中等三角形。在中间的盒子里，有一个黄色的大三角形，一个黄色的中等正方形，一个黄色的大正方形，一个黄色的中等正方形，一个蓝色的中等圆形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小三角形，一个黄色的小正方形，一个黑色的小正方形，一个蓝色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["blue", "triangle", "large", "right"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的大三角形，一个黑色的大正方形，一个黄色的大圆形，一个黄色的小圆形。在中间的盒子里，有一个黑色的小正方形，一个蓝色的大圆形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的大三角形，一个黄色的中等正方形，一个黄色的大正方形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个蓝色的中圆形，一个黄色的中圆形，一个黑色的大三角形。中间的盒子里有一个蓝色的小圆形，一个黑色的大正方形，一个黄色的大圆形，一个蓝色的中三角形。右边的盒子里有一个黄色的中三角形，一个蓝色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "round", "middle", "left"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中圆和一个蓝色的中三角形。中间的盒子里有一个蓝色的小正方形、一个蓝色的中正方形和一个黑色的大三角形。右边的盒子里有一个蓝色的小正方形、一个黑色的小圆形、一个黑色的大正方形、一个蓝色的大圆形和一个蓝色的中正方形。如何将所有正方形移到左边的盒子里？", "label": [["blue", "square", "small", "right"], ["black", "square", "large", "right"], ["blue", "square", "middle", "right"], ["blue", "square", "small", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形、一个黄色的中等圆形、一个黑色的中等圆形、一个黑色的大三角形和一个蓝色的大三角形。中间的盒子里有一个黑色的中等三角形、一个蓝色的大正方形、一个黑色的中等三角形、一个黄色的中等圆形、一个黄色的中等正方形和一个蓝色的小正方形。右边的盒子里有一个蓝色的大圆形和一个黑色的大圆形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "large", "right"], ["black", "round", "large", "right"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形、一个黄色的小正方形、一个黄色的大三角形、一个黄色的大三角形、一个黑色的小圆形。中间的盒子里有一个黑色的中号三角形、一个黑色的中号圆形、一个黄色的小三角形、一个黑色的中号三角形、一个蓝色的大圆形。右边的盒子里有一个黄色的小圆形、一个黑色的中号圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "square", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个蓝色的中等正方形、一个黄色的小圆形和一个蓝色的小正方形。中间的盒子里有一个蓝色的小正方形、一个黄色的中等正方形和一个黄色的中等三角形。右边的盒子里有一个黑色的大三角形和一个蓝色的大三角形。如何将所有黑色物体移到右边的盒子中？", "label": [["black", "round", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个黑色的小三角形。中间的盒子里有一个蓝色的中等大小的三角形、一个蓝色的小正方形、一个黄色的小正方形和一个黄色的小圆形。右边的盒子里有一个黑色的小圆形、一个黑色的大圆形和一个蓝色的大圆形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个小黄三角形。中间的盒子里有一个大黄三角形，一个蓝色中等三角形，一个小蓝色圆形。右边的盒子里有一个黄色中等三角形，一个小黄色圆形，一个黄色中等正方形，一个黑色中等圆形，一个小黑色三角形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个蓝色的小正方形、一个黑色的大三角形和一个黄色的大三角形。在中间的盒子里，有一个黑色的中等大小的正方形、一个黑色的大圆形、一个蓝色的中等大小的三角形、一个黑色的中等大小的圆形、一个黄色的小正方形和一个蓝色的小正方形。在右边的盒子里，有一个黄色的大三角形、一个黄色的小正方形、一个黑色的大正方形、一个黑色的大三角形、一个黄色的小正方形和一个黑色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形和一个蓝色的中号正方形。中间的盒子里有一个蓝色的中号正方形、一个黑色的中号圆形、一个黄色的大号圆形、一个黑色的中号圆形、一个黄色的大号三角形和一个黑色的大号三角形。右边的盒子里有一个蓝色的小号正方形、一个蓝色的中号正方形、一个蓝色的大号三角形、一个黑色的大号圆形和一个黑色的大号三角形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的中等三角形，一个黑色的小正方形，一个蓝色的小正方形，一个蓝色的中等三角形。在中间的盒子里，有一个黄色的大正方形，一个黑色的小三角形，一个蓝色的大三角形，一个蓝色的大正方形，一个黑色的大圆形，一个蓝色的中等圆形。在右边的盒子里，有一个黄色的大三角形，一个黄色的小正方形，一个黄色的大圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的大三角形，一个黑色的中等正方形，一个蓝色的小正方形，一个黄色的大三角形。在中间的盒子里，有一个黑色的大圆形，一个黄色的中等圆形，一个黑色的大圆形，一个蓝色的大圆形，一个蓝色的小三角形。在右边的盒子里，有一个黄色的大正方形，一个黄色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "square", "large", "right"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个蓝色的中等圆形。中间的盒子里有一个黑色的小正方形，一个黄色的大正方形。右边的盒子里有一个蓝色的大圆形，一个蓝色的小圆形，一个蓝色的大三角形，一个蓝色的大正方形，一个黑色的小圆形，一个黄色的中等圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "large", "right"], ["blue", "round", "small", "right"], ["blue", "triangle", "large", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个蓝色的中圆形。中间的盒子里有一个黑色的小圆形、一个蓝色的中圆形、一个黄色的中正方形和一个蓝色的小三角形。右边的盒子里有一个黑色的中正方形和一个黑色的大正方形。如何将所有正方形移到右边的盒子里？", "label": [["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个黑色的大圆形，一个黄色的大圆形。中间的盒子里有一个蓝色的小圆形，一个黑色的中等大小的圆形。右边的盒子里有一个蓝色的小三角形，一个黑色的小圆形，一个黑色的大圆形，一个黄色的大圆形，一个黄色的小三角形，一个蓝色的中等大小的三角形。如何将所有正方形移动到左边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的小正方形，一个黑色的中圆形，一个黄色的中等三角形，一个蓝色的中等正方形。在中间的盒子里，有一个蓝色的中等圆形，一个蓝色的小三角形，一个蓝色的大三角形，一个蓝色的中等三角形，一个黑色的小三角形，一个黑色的大圆形。在右边的盒子里，有一个黄色的大圆形，一个蓝色的小正方形，一个黑色的大圆形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "square", "small", "left"], ["yellow", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的大三角形，一个黄色的中等正方形，一个蓝色的大正方形，一个黑色的大三角形。在中间的盒子里，有一个黄色的小圆形，一个蓝色的中等三角形，一个黄色的中等三角形，一个蓝色的中等圆形，一个蓝色的小圆形，一个黑色的大正方形。在右边的盒子里，有一个黑色的中等圆形，一个黑色的小三角形，一个蓝色的小正方形，一个蓝色的中等三角形，一个黄色的中等正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "large", "left"], ["black", "round", "middle", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的大正方形和一个黄色的小三角形。中间的盒子里有一个黑色的中等三角形和一个黄色的大正方形。右边的盒子里有一个蓝色的大圆形、一个蓝色的中等圆形、一个黄色的大三角形、一个黄色的大正方形和一个蓝色的小正方形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黑色的中等正方形、一个黑色的大正方形、一个黄色的中等圆形和一个蓝色的小正方形。中间的盒子里有一个蓝色的中等圆形、一个黄色的小正方形、一个蓝色的中等正方形和一个黑色的大正方形。右边的盒子里有一个蓝色的大正方形、一个黑色的小正方形、一个蓝色的大圆形、一个黄色的小三角形、一个黄色的大三角形和一个黄色的中等正方形。如何将所有正方形移动到中间的盒子？", "label": [["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["blue", "square", "small", "left"], ["blue", "square", "large", "right"], ["black", "square", "small", "right"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个黑色的小圆形。中间的盒子里有一个黑色的大三角形、一个蓝色的中等大小的圆形、一个蓝色的大三角形和一个蓝色的大正方形。右边的盒子里有一个蓝色的中等大小的正方形、一个蓝色的小三角形和一个黄色的小三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["yellow", "triangle", "small", "right"], ["black", "triangle", "large", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形和一个黑色的中等正方形。中间的盒子里有一个蓝色的中等三角形、一个黑色的中等正方形、一个蓝色的小正方形和一个黑色的中等正方形。右边的盒子里有一个黄色的大圆形、一个黄色的小三角形和一个黑色的小圆形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "triangle", "middle", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形、一个蓝色的大圆形和一个黄色的中等正方形。中间的盒子里有一个黄色的中等正方形、一个蓝色的大三角形、一个蓝色的中等圆形、一个黄色的大圆形、一个蓝色的大三角形和一个黑色的大三角形。右边的盒子里有一个黑色的小圆形、一个黑色的大正方形和一个黄色的大圆形。如何将所有黑色物品移到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "square", "large", "right"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的中号圆形，一个黄色的小号圆形，一个黄色的中号三角形，一个黄色的大号圆形。在中间的盒子里，有一个黄色的中号正方形，一个蓝色的中号三角形。在右边的盒子里，有一个蓝色的大号三角形，一个黑色的中号正方形，一个蓝色的小号三角形。如何将所有正方形移动到中间的盒子里？", "label": [["black", "square", "large", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黄色的中等三角形，一个黑色的小正方形，一个黑色的大三角形，一个黄色的中等圆形，一个黄色的中等正方形。在中间的盒子里，有一个黑色的小三角形，一个黑色的中等正方形，一个黑色的大圆形，一个黑色的小圆形，一个黄色的中等圆形，一个黄色的中等圆形。在右边的盒子里，有一个黄色的小正方形，一个蓝色的中等圆形。如何将所有蓝色物品移到右边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等圆形、一个蓝色的大圆形、一个蓝色的中等正方形、一个蓝色的中等圆形、一个黄色的小三角形。在中间的盒子里，有一个蓝色的中等圆形、一个黑色的小圆形、一个黑色的小三角形、一个黑色的中等圆形。在右边的盒子里，有一个蓝色的中等正方形、一个黑色的小三角形、一个黑色的中等圆形、一个黄色的大正方形、一个黑色的中等三角形、一个黑色的大圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "triangle", "small", "left"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个大黄色圆形、一个小黑色三角形、一个小黄色三角形、一个大蓝色三角形和一个中等大小的黑色圆形。中间的盒子里有一个小蓝色圆形、一个大蓝色圆形和一个大黄色圆形。右边的盒子里有一个中等大小的黑色圆形、一个大蓝色正方形、一个小黄色正方形和一个中等大小的黑色圆形。如何将所有圆形移到右边的盒子里？", "label": [["yellow", "round", "large", "left"], ["black", "round", "middle", "left"], ["blue", "round", "small", "middle"], ["blue", "round", "large", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个大黑正方形，一个小黄圆形，一个大黄正方形，一个大黄圆形。在中间的盒子里，有一个小黑三角形，一个中黄正方形，一个中蓝圆形，一个大黄圆形，一个小蓝正方形，一个小蓝正方形。在右边的盒子里，有一个小黑正方形，一个小黄三角形，一个中黑正方形。如何将所有圆形移到左边的盒子里？", "label": [["blue", "round", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的大三角形，一个黑色的小正方形，一个黑色的小三角形，一个黄色的小三角形，一个蓝色的中圆形。在中间的盒子里，有一个黑色的中圆形，一个黄色的中正方形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的大三角形，一个黄色的大正方形，一个蓝色的大三角形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "small", "left"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色圆形，一个蓝色中等三角形，一个黄色中等圆形，一个蓝色小正方形，一个黄色小三角形，一个黑色大正方形。在中间的盒子里，有一个黄色大圆形，一个黑色大圆形，一个蓝色大正方形，一个黑色大正方形。在右边的盒子里，有一个黑色大正方形，一个黑色中等三角形，一个黑色小三角形，一个黑色大正方形。如何将所有三角形移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["yellow", "triangle", "small", "left"], ["black", "triangle", "middle", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形和一个蓝色的小三角形。中间的盒子里有一个黑色的小正方形、一个黄色的中号圆形和一个蓝色的大三角形。右边的盒子里有一个蓝色的大三角形、一个黑色的中号正方形、一个蓝色的中号三角形、一个蓝色的大正方形和一个蓝色的小圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["blue", "triangle", "middle", "right"], ["blue", "square", "large", "right"], ["blue", "round", "small", "right"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的小正方形和一个黑色的小三角形。中间的盒子里有一个蓝色的中等大小的圆形、一个黑色的大圆形、一个蓝色的小圆形、一个黄色的大正方形、一个黄色的大圆形和一个黑色的大正方形。右边的盒子里有一个蓝色的小正方形、一个蓝色的中等大小的正方形、一个黑色的大三角形、一个黑色的中等大小的圆形和一个蓝色的小三角形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "round", "small", "left"], ["blue", "round", "middle", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形，一个蓝色的中等正方形。中间的盒子里有一个蓝色的中等圆形，一个蓝色的中等正方形，一个黄色的中等圆形，一个黄色的大三角形，一个黄色的中等圆形。右边的盒子里有一个蓝色的大正方形，一个蓝色的小正方形，一个黑色的小三角形，一个黑色的中等圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "middle", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个蓝色的中等正方形，一个蓝色的小三角形，一个黑色的小三角形，一个黑色的中等正方形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的小正方形，一个黄色的大三角形，一个蓝色的中等圆形，一个黑色的小三角形，一个黑色的小圆形。在右边的盒子里，有一个黄色的大圆形，一个蓝色的大三角形，一个蓝色的中等圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["yellow", "triangle", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黑色的小正方形，一个黄色的大三角形，一个蓝色的中等三角形。中间的盒子里有一个黑色的小正方形，一个黑色的小圆形，一个黑色的中等正方形，一个蓝色的小圆形，一个蓝色的小正方形。右边的盒子里有一个黄色的小三角形，一个黑色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黄色正方形、一个中黄色正方形、一个大黄色三角形、一个蓝色小三角形、一个黑色大正方形、一个黄色小三角形。在中间的盒子里，有一个黄色小三角形、一个蓝色大三角形、一个蓝色中三角形。在右边的盒子里，有一个黄色中三角形、一个蓝色中三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "middle", "right"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个蓝色的大正方形和一个黄色的小圆形。中间的盒子里有一个黄色的大三角形和一个黄色的小圆形。右边的盒子里有一个黄色的小圆形、一个蓝色的大三角形、一个黄色的小三角形和一个黄色的大圆形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "left"], ["yellow", "triangle", "large", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个蓝色的大三角形，一个黑色的中等三角形，一个黄色的大正方形。在中间的盒子里，有一个蓝色的小圆形，一个黄色的大三角形，一个黑色的大圆形，一个黄色的中等正方形，一个黄色的大圆形，一个蓝色的小正方形。在右边的盒子里，有一个黑色的小圆形，一个黑色的中等圆形，两个黄色的小圆形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "round", "small", "right"], ["yellow", "round", "small", "right"], ["yellow", "triangle", "large", "middle"], ["yellow", "square", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的小正方形，一个黄色的中等正方形，一个蓝色的中等正方形，一个黄色的小圆形。在中间的盒子里，有一个黄色的小三角形，一个黄色的大三角形，一个黑色的中等圆形，一个黄色的中等正方形。在右边的盒子里，有一个黑色的中等三角形，一个蓝色的大圆形，一个黑色的大三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "small", "left"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中圆形、一个黄色的小圆形、一个黑色的小圆形、一个黄色的中正方形和一个黄色的小正方形。在中间的盒子里，有一个蓝色的大正方形、一个黑色的小正方形、一个黄色的大正方形、一个蓝色的中圆形、两个蓝色的大圆形和一个黑色的大圆形。在右边的盒子里，有一个蓝色的中正方形、两个黑色的中圆形、一个蓝色的小正方形、一个黄色的中圆形、一个黄色的中三角形和一个蓝色的大圆形。如何将所有正方形移动到中间的盒子里？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "small", "left"], ["blue", "square", "middle", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形、一个黄色的大正方形、一个黄色的大圆形和一个黄色的中等圆形。中间的盒子里有一个蓝色的中等三角形、一个黑色的中等圆形和一个黑色的小正方形。右边的盒子里有一个黑色的中等正方形和一个黑色的小正方形。如何将所有黄色物品移到左边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形，一个黑色的中圆形，一个黑色的小正方形，一个蓝色的小三角形，一个黑色的大圆形，一个黑色的小三角形。在中间的盒子里，有一个黄色的中等正方形，一个蓝色的中等三角形。在右边的盒子里，有一个黄色的中等三角形，一个黑色的大正方形，一个黄色的中等圆形，一个黄色的大三角形，一个蓝色的小正方形，一个蓝色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的大三角形，一个蓝色的大三角形，一个黑色的大正方形，一个黑色的小正方形，一个蓝色的小正方形。在中间的盒子里，有一个黄色的中等三角形，一个黑色的中等圆形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的中等正方形，一个黑色的小正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "square", "small", "left"], ["black", "round", "middle", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个黑色的大三角形。中间的盒子里有一个黄色的大正方形、一个蓝色的大正方形、一个黄色的中号圆形、一个黄色的小正方形、一个黄色的大三角形。右边的盒子里有一个蓝色的中号圆形、一个黑色的大号圆形、一个黄色的大三角形、一个蓝色的小号圆形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "middle", "right"], ["black", "round", "large", "right"], ["blue", "round", "small", "right"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个黄色中等三角形，一个小黑色三角形，一个黄色大三角形，一个黑色大圆形，一个蓝色大圆形。在中间的盒子里，有一个蓝色大三角形，一个黄色小三角形，一个蓝色小圆形，一个黑色中等正方形，一个蓝色中等三角形。在右边的盒子里，有一个黑色大正方形，一个黄色大三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黄色的大三角形、一个黄色的小正方形和一个黄色的小三角形。中间的盒子里有一个黑色的小正方形和一个蓝色的小正方形。右边的盒子里有一个黑色的中号圆形、一个黄色的大三角形、一个蓝色的小三角形、一个黄色的大号圆形、一个黑色的小号圆形和一个蓝色的小正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "small", "right"], ["blue", "square", "small", "right"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个黑色的中圆形。中间的盒子里有一个黄色的小三角形、一个黄色的中正方形、一个黄色的小圆形、一个黑色的小正方形和一个黄色的大正方形。右边的盒子里有一个蓝色的中三角形和一个黄色的大正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形，一个黄色的小三角形。中间的盒子里有一个蓝色的中等三角形，一个蓝色的小三角形，一个黑色的中等三角形，一个黑色的中等圆形，一个黄色的小三角形。右边的盒子里有一个黄色的大正方形，一个蓝色的大三角形，一个蓝色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的小三角形，一个蓝色的中等三角形，一个黑色的中等三角形，一个蓝色的大正方形，一个黑色的大三角形。在中间的盒子里，有一个黄色的大正方形，一个黑色的大圆形，一个黄色的小圆形，一个黑色的中等圆形，一个蓝色的大圆形，一个黑色的大正方形。在右边的盒子里，有一个黄色的中等三角形，一个黑色的大三角形，一个黄色的大正方形，一个黄色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "round", "large", "middle"], ["black", "round", "middle", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形和一个蓝色的中间正方形。中间的盒子里有一个蓝色的小正方形、一个蓝色的中间圆形和一个黑色的小三角形。右边的盒子里有一个蓝色的小圆形、一个黑色的中间正方形、一个蓝色的小圆形、一个黄色的大圆形和一个蓝色的中间正方形。如何将所有正方形移动到中间的盒子里？", "label": [["black", "square", "middle", "left"], ["blue", "square", "middle", "left"], ["black", "square", "middle", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个黑色的大正方形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的大三角形，一个黄色的中间圆形，一个黑色的小圆形，一个黑色的中间三角形，一个黄色的中间圆形。在右边的盒子里，有一个蓝色的小正方形，一个蓝色的大三角形，一个黄色的大正方形，一个蓝色的小正方形，一个黑色的中间正方形，一个蓝色的中间正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["blue", "triangle", "large", "right"], ["blue", "square", "small", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形、一个蓝色的大正方形和一个黑色的中等三角形。在中间的盒子里，有一个黄色的小圆形、一个黑色的小圆形、一个黄色的小三角形、一个黄色的小正方形和一个黄色的中等圆形。在右边的盒子里，有一个黑色的大圆形、一个黄色的大圆形、一个黑色的大三角形、一个蓝色的中等圆形、一个蓝色的中等圆形和一个黑色的中等三角形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "small", "left"], ["black", "round", "large", "right"], ["yellow", "round", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个蓝色的大圆形、一个蓝色的小正方形、一个黄色的小正方形、一个蓝色的大正方形和一个黄色的小三角形。中间的盒子里有一个黑色的大正方形和一个蓝色的小三角形。右边的盒子里有一个黄色的小三角形和一个黄色的中等三角形。如何将所有黄色物品移到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "triangle", "small", "left"], ["yellow", "triangle", "small", "right"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的大三角形，一个黄色的中等三角形，一个黄色的中等圆形。在中间的盒子里，有一个黑色的中等正方形，一个蓝色的小圆形，一个黑色的大正方形，一个黄色的中等正方形，一个黄色的大正方形，一个黄色的大圆形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "square", "large", "middle"], ["yellow", "square", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个黑色的小圆形、一个蓝色的中等三角形、一个黑色的大圆形和一个黄色的中等正方形。在中间的盒子里，有一个黄色的大正方形、一个蓝色的大正方形、一个黑色的中等正方形、一个蓝色的中等三角形、一个黄色的中等圆形和一个黑色的小圆形。在右边的盒子里，有一个蓝色的大圆形和一个蓝色的中等圆形。如何将所有蓝色物品移到右边的盒子里？", "label": [["blue", "round", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "square", "large", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形、一个黑色的小正方形和一个黑色的中等正方形。中间的盒子里有一个黑色的中等圆形、一个黑色的大正方形和一个黄色的大三角形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的小圆形、一个黄色的大三角形、一个黄色的大正方形、一个蓝色的中等正方形和一个蓝色的大三角形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个蓝色的小圆形和一个蓝色的小正方形。中间的盒子里有一个黑色的大圆形、一个黑色的小正方形、一个黑色的中号正方形和一个黑色的中号三角形。右边的盒子里有一个黑色的大正方形、一个蓝色的中号三角形、两个蓝色的小正方形和一个黄色的小三角形。如何将所有黑色物品移动到中间的盒子中？", "label": [["black", "round", "middle", "left"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形，一个蓝色的中等三角形，一个黄色的大正方形。中间的盒子里有一个蓝色的小圆形，一个黄色的中等正方形，一个蓝色的中等圆形，两个蓝色的小圆形和一个黑色的小圆形。右边的盒子里有一个黄色的小圆形，一个蓝色的中等正方形，一个蓝色的大三角形，一个蓝色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黑色的小三角形，一个蓝色的中等三角形。在中间的盒子里，有一个黄色的大正方形，一个蓝色的中等正方形，一个黑色的中等圆形，一个黄色的小正方形，一个黄色的小圆形，一个黄色的中等正方形。在右边的盒子里，有一个黑色的中等三角形，一个黑色的中等圆形，一个黑色的中等三角形，一个蓝色的中等正方形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "right"], ["black", "round", "middle", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个蓝色的小三角形。中间的盒子里有一个蓝色的中等大小的圆形和一个黑色的大圆形。右边的盒子里有一个蓝色的小正方形、一个黄色的中等大小的正方形、一个黑色的中等大小的三角形、一个蓝色的大三角形、一个蓝色的小圆形和一个黑色的小正方形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["blue", "triangle", "large", "right"], ["blue", "round", "small", "right"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的大圆形，一个蓝色的小圆形，一个黑色的中等圆形，一个黑色的大正方形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个蓝色的大三角形，一个黄色的大圆形，一个蓝色的小圆形，一个黄色的中等圆形。在右边的盒子里，有一个黄色的中等圆形，一个黄色的中等圆形，一个黑色的小圆形，一个蓝色的大正方形。如何将所有正方形移动到中间的盒子？", "label": [["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形，一个黄色的中等三角形，一个黑色的中等正方形。中间的盒子里有一个黄色的中等正方形，一个大黄色圆形，一个蓝色的小正方形，一个蓝色的小三角形，一个蓝色的中等三角形。右边的盒子里有一个黄色的中等三角形，一个黑色的大圆形，一个蓝色的中等三角形，一个蓝色的小三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形和一个小黄色正方形。中间的盒子里有一个中等大小的黄色三角形和一个蓝色的大正方形。右边的盒子里有一个小黄色圆形、一个小蓝色圆形、一个小蓝色正方形和一个大黄色正方形。如何将所有圆形移到左边的盒子中？", "label": [["yellow", "round", "small", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黄色的中等三角形，一个黑色的小正方形，一个蓝色的大三角形。在中间的盒子里，有一个黄色的小正方形，一个黄色的大圆形。在右边的盒子里，有一个黄色的大三角形，一个黄色的中等正方形，一个黄色的大正方形，一个黄色的小三角形，一个黑色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["yellow", "triangle", "large", "right"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形和一个蓝色的大圆形。中间的盒子里有一个黄色的中圆形、一个黑色的小圆形和一个黄色的大圆形。右边的盒子里有一个黑色的大三角形、一个蓝色的中正方形、一个黄色的小圆形、一个黄色的小正方形和一个黑色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的中等三角形和一个黄色的小正方形。中间的盒子里有一个黄色的中等圆形、一个黑色的小正方形、一个黄色的中等三角形、一个黑色的中等正方形、一个黄色的中等三角形和一个蓝色的中等正方形。右边的盒子里有一个黄色的中等圆形、一个蓝色的大三角形、一个黑色的大正方形和一个黑色的大圆形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["black", "square", "small", "middle"], ["black", "square", "middle", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "如何将所有圆形移动到左边的盒子中？\n\n有三个盒子。在左边的盒子里，有一个黄色的大正方形和一个黑色的小圆形。在中间的盒子里，有一个黑色的大圆形、一个蓝色的中等大小正方形、一个黄色的中等大小正方形、一个黄色的小三角形和一个黑色的小圆形。在右边的盒子里，有一个黄色的大三角形、一个黑色的小三角形、两个蓝色的大正方形和一个蓝色的大圆形。", "label": [["blue", "round", "large", "right"], ["black", "round", "large", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形和一个蓝色的小三角形。在中间的盒子里，有一个蓝色的大正方形、一个黄色的小三角形、一个黑色的大三角形、一个黄色的大三角形和一个蓝色的大圆形。在右边的盒子里，有一个蓝色的小正方形、一个黑色的小圆形、一个黑色的中等大小的正方形、一个蓝色的大三角形、一个黑色的小三角形和一个蓝色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "small", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的中圆形、一个蓝色的大三角形。中间的盒子里有一个黄色的小正方形、一个黄色的小三角形。右边的盒子里有一个蓝色的大三角形、一个黑色的大三角形、一个蓝色的大圆形、一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形、一个黄色的小三角形、一个蓝色的中等三角形和一个黄色的大圆形。中间的盒子里有一个黄色的小正方形、一个黑色的小正方形和一个黑色的中等圆形。右边的盒子里有一个黑色的中等三角形和一个蓝色的中等正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "square", "small", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的大圆形，一个黑色的中圆形，一个蓝色的大三角形，一个黄色的大圆形。在中间的盒子里，有一个蓝色的大圆形，一个黄色的中三角形，一个蓝色的中正方形，一个黄色的大正方形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的中三角形，一个蓝色的中三角形，一个黄色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "right"], ["blue", "triangle", "middle", "right"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个蓝色的大正方形，一个蓝色的小三角形，一个蓝色的小圆形。在中间的盒子里，有一个黄色的中等三角形，一个黄色的小圆形，一个黄色的中等正方形，一个黑色的小圆形，一个黑色的小圆形，一个蓝色的中等三角形。在右边的盒子里，有一个黄色的大圆形，一个蓝色的中等圆形，一个蓝色的大圆形，一个黄色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "large", "right"], ["yellow", "round", "small", "right"], ["yellow", "round", "small", "middle"], ["black", "round", "small", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等圆形、一个黄色的大三角形、一个黑色的中等三角形、一个黄色的大三角形和一个黑色的大圆形。在中间的盒子里，有一个蓝色的大圆形、一个蓝色的中等圆形、一个蓝色的中等三角形、一个黑色的小圆形、一个黑色的中等三角形和一个蓝色的大圆形。在右边的盒子里，有一个蓝色的中等圆形、一个蓝色的小正方形、一个黄色的中等正方形、一个蓝色的大正方形、一个黑色的中等正方形和一个黄色的大正方形。如何将所有正方形移动到中间的盒子？", "label": [["blue", "square", "small", "right"], ["yellow", "square", "middle", "right"], ["blue", "square", "large", "right"], ["black", "square", "middle", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中号圆形、一个蓝色的小圆形、一个黑色的中号圆形、一个黄色的中号圆形、一个蓝色的大正方形、一个黄色的小三角形。在中间的盒子里，有一个蓝色的小三角形、一个黄色的大三角形、一个蓝色的中号圆形、一个黄色的中号圆形、一个蓝色的中号圆形。在右边的盒子里，有一个黑色的小正方形、一个黑色的小圆形、一个黄色的大正方形、一个黄色的大三角形、一个黑色的小圆形、一个蓝色的小圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "small", "left"], ["black", "round", "middle", "left"], ["yellow", "round", "middle", "left"], ["black", "round", "small", "right"], ["black", "round", "small", "right"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形、一个黑色的中等正方形、一个蓝色的中等正方形、一个黑色的小三角形和一个黑色的大三角形。中间的盒子里有一个蓝色的中等三角形、一个黑色的中等三角形和一个蓝色的中等三角形。右边的盒子里有一个蓝色的中等圆形和一个黄色的中等正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "middle", "left"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个黄色中等正方形，一个黄色中等正方形。在中间的盒子里，有一个小黑色正方形，一个黑色中等三角形，一个蓝色中等圆形，一个小蓝色正方形，一个小黑色正方形。在右边的盒子里，有一个黄色中等圆形，一个黄色小正方形，一个蓝色中等正方形，一个黑色小三角形，一个黄色中等三角形，一个黑色中等三角形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "square", "small", "left"], ["black", "square", "small", "middle"], ["black", "triangle", "middle", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个蓝色的大三角形和一个蓝色的小正方形。中间的盒子里有一个蓝色的小正方形、一个蓝色的小正方形、一个黑色的大圆形、一个蓝色的小圆形和一个黄色的小正方形。右边的盒子里有一个黑色的小三角形和一个蓝色的中等三角形。如何将所有黑色物品移到左边的盒子？", "label": [["black", "triangle", "small", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个蓝色的小圆形，一个黑色的小圆形，一个黑色的小三角形，一个蓝色的大三角形。中间的盒子里有一个黄色的小正方形，一个蓝色的中等正方形，一个黑色的小三角形，一个黄色的中等正方形，一个蓝色的小三角形，一个黑色的大正方形。右边的盒子里有一个蓝色的中等三角形，一个蓝色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "small", "middle"], ["blue", "square", "middle", "middle"], ["yellow", "square", "middle", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等圆形，一个蓝色的小正方形，一个黑色的小三角形，一个黑色的小正方形，一个黄色的小正方形，一个蓝色的中等正方形。在中间的盒子里，有一个蓝色的小三角形，一个蓝色的大正方形。在右边的盒子里，有一个黑色的大正方形，一个黑色的中等圆形，一个黑色的小圆形，一个黑色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["black", "round", "middle", "right"], ["black", "round", "small", "right"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的大圆形，一个黑色的小三角形，一个黑色的小圆形，一个蓝色的大三角形，一个蓝色的大圆形。在中间的盒子里，有一个黑色的大三角形，一个黑色的小三角形，一个蓝色的大三角形，一个蓝色的大正方形，一个黄色的中等正方形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的中等三角形。如何将所有正方形移动到右边的盒子中？", "label": [["blue", "square", "large", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个蓝色的大正方形。中间的盒子里有一个蓝色的中等三角形和一个蓝色的小三角形。右边的盒子里有一个黑色的小圆形、一个黑色的大圆形和一个黄色的大三角形。如何将所有圆形移到左边的盒子中？", "label": [["black", "round", "small", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的小正方形，一个黑色的大三角形，一个蓝色的大三角形。在中间的盒子里，有一个黑色的大圆形，一个蓝色的中圆形，一个蓝色的小圆形，一个蓝色的大圆形，一个黑色的中圆形。在右边的盒子里，有一个黄色的中正方形，一个蓝色的大圆形，一个黄色的小正方形，一个蓝色的小正方形，一个黄色的中正方形。如何将所有的三角形移到左边的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的中等三角形，一个黄色的大三角形，一个黄色的中等三角形，一个蓝色的小三角形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的中等圆形，一个黄色的小三角形，一个黑色的中等正方形，一个黄色的中等正方形，一个黑色的小圆形。在右边的盒子里，有一个黄色的小圆形，一个蓝色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "middle", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"], ["blue", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的大三角形，一个黑色的小圆形，一个黑色的大三角形。在中间的盒子里，有一个黄色的小三角形，一个黑色的小三角形。在右边的盒子里，有一个黑色的中等三角形，一个蓝色的大三角形，一个蓝色的中等正方形，一个黑色的中等三角形，一个黄色的大正方形，一个黄色的小三角形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"], ["black", "triangle", "middle", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "triangle", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的大圆形，一个黑色的中等正方形，一个黄色的大圆形，一个黄色的大正方形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的中等三角形，一个黄色的大正方形，一个蓝色的中等圆形，一个蓝色的大三角形，一个黑色的小三角形。在右边的盒子里，有一个黑色的小圆形，一个蓝色的小正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形和一个蓝色的小圆形。中间的盒子里有一个黑色的中等大小的正方形和一个蓝色的小圆形。右边的盒子里有一个黑色的中等大小的正方形、一个黄色的小正方形、一个黑色的小圆形、一个蓝色的中等大小的正方形和一个黄色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["black", "round", "small", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的中圆形，一个黄色的小三角形，一个黄色的中方形，一个黑色的中方形，一个黑色的大方形。在中间的盒子里，有一个黄色的小三角形，一个黄色的小方形。在右边的盒子里，有一个黄色的大圆形，一个黑色的中方形，一个黄色的小三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "triangle", "small", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的小三角形、一个蓝色的小圆形和一个黑色的小三角形。中间的盒子里有一个黑色的大三角形、一个黄色的小三角形、一个黄色的中等大小的圆形和一个蓝色的大正方形。右边的盒子里有一个蓝色的中等大小的圆形、一个黑色的大圆形和一个蓝色的大正方形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "round", "middle", "right"], ["blue", "square", "large", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形和一个黄色的大圆形。中间的盒子里有一个黄色的大三角形和一个蓝色的中等大小的圆形。右边的盒子里有一个黑色的小正方形、一个黄色的大圆形、一个黑色的大正方形、一个黑色的中等大小的正方形、一个蓝色的小圆形和一个蓝色的小正方形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "large", "left"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个蓝色的小圆形。中间的盒子里有一个黄色的大圆形和一个黄色的小三角形。右边的盒子里有一个黑色的小三角形、一个蓝色的大圆形和一个黄色的中圆形。如何将所有正方形移到左边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中圆形、一个蓝色的大圆形、一个黑色的中圆形和一个蓝色的小正方形。中间的盒子里有一个黄色的中等三角形、一个黄色的大正方形和一个黄色的中等正方形。右边的盒子里有一个蓝色的中等正方形、一个黑色的大三角形、一个黄色的大正方形和一个黄色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "large", "left"], ["blue", "square", "small", "left"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形，一个黄色的小三角形，一个蓝色的大三角形，一个黄色的中等三角形，一个黑色的大正方形。在中间的盒子里，有一个黄色的中等正方形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的小三角形，一个黄色的中等三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黄色的中间正方形，一个黑色的中间正方形，一个黄色的大圆形，一个黄色的中间三角形。在中间的盒子里，有一个黄色的小正方形，一个蓝色的中间三角形，一个蓝色的大三角形。在右边的盒子里，有一个蓝色的大三角形，一个黄色的小三角形，一个蓝色的小正方形，一个蓝色的小圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["yellow", "triangle", "small", "right"], ["blue", "triangle", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形，一个黄色的中等圆形，一个黑色的大三角形。中间的盒子里有一个黄色的中等圆形，一个黑色的小正方形，一个蓝色的小三角形，一个黑色的小正方形，一个黄色的中等三角形，一个黄色的大正方形。右边的盒子里有一个黄色的大圆形，一个黑色的中等三角形，一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "large", "left"], ["blue", "triangle", "small", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的中等正方形，一个黑色的大圆形，一个蓝色的小三角形，一个蓝色的中等圆形。在中间的盒子里，有一个黑色的中等三角形，一个黑色的小三角形，一个蓝色的中等正方形，一个黄色的小圆形，一个蓝色的小正方形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小正方形，一个黑色的大三角形，一个黄色的大圆形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "middle", "left"], ["blue", "square", "middle", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黄色的大正方形。中间的盒子里有一个蓝色的小圆形、一个蓝色的小圆形、一个黄色的小三角形和一个黑色的中等圆形。右边的盒子里有一个黄色的中等正方形、一个蓝色的中等正方形和一个黑色的大圆形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个黑色的大正方形，一个黄色的中等大小的正方形。在中间的盒子里，有一个黑色的中等大小的圆形，一个黄色的小三角形，一个蓝色的中等大小的圆形，一个黄色的小正方形。在右边的盒子里，有一个蓝色的小三角形，一个黄色的小三角形，一个黑色的大圆形，一个黑色的小正方形，一个蓝色的中等大小的圆形，一个蓝色的小圆形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "square", "large", "left"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形和一个黑色的小正方形。中间的盒子里有一个黄色的中号三角形、一个黄色的大正方形、一个黑色的中号正方形、一个黑色的中号圆形和一个蓝色的中号正方形。右边的盒子里有一个黑色的小圆形、一个蓝色的小三角形和一个黑色的中号正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个蓝色的大圆形，一个黄色的小圆形，一个黄色的中等正方形，一个黑色的小圆形。在中间的盒子里，有一个黄色的中等三角形，一个黑色的中等三角形，一个黑色的小正方形，一个蓝色的中等正方形，一个黄色的小正方形。在右边的盒子里，有一个黑色的小圆形，一个黄色的大正方形，一个黄色的大圆形，一个黑色的小三角形，一个黄色的小正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "large", "left"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中圆形、一个黑色的小圆形、一个黄色的中圆形、一个蓝色的中方形。在中间的盒子里，有一个蓝色的小方形、一个蓝色的大圆形、一个黑色的中方形、一个黄色的小三角形、一个蓝色的小方形。在右边的盒子里，有一个黑色的中方形、一个蓝色的小三角形、一个蓝色的小三角形、一个蓝色的大方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个小蓝圆形，一个小黑圆形，一个大黑正方形。在中间的盒子里，有一个中等大小的黄正方形，两个小蓝圆形，两个大黄正方形。在右边的盒子里，有一个中等大小的黄正方形，一个大蓝三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的小三角形，一个黑色的中等圆形。在中间的盒子里，有一个黑色的小圆形，一个黑色的大正方形，一个黄色的中等三角形，一个蓝色的小正方形，一个蓝色的大三角形，一个黄色的小三角形。在右边的盒子里，有一个黑色的小正方形，一个黑色的小正方形，一个蓝色的小圆形，一个蓝色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "square", "small", "right"], ["blue", "square", "small", "right"], ["black", "square", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形和一个蓝色的中等圆形。中间的盒子里有一个黑色的小三角形和一个黄色的中等圆形。右边的盒子里有一个蓝色的小正方形和三个蓝色的小三角形。如何将所有的圆形移到左边的盒子里？ \n\n将上述文本翻译成中文。", "label": [["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个黑色的大正方形、一个蓝色的大圆形、一个蓝色的小三角形和一个蓝色的大三角形。在中间的盒子里，有一个蓝色的小正方形、一个蓝色的中等三角形、一个蓝色的大三角形、一个黑色的小圆形和一个黄色的大三角形。在右边的盒子里，有一个蓝色的大正方形、一个黑色的大圆形和一个黑色的小正方形。如何将所有黄色的物品移到右边的盒子里？", "label": [["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形，一个黑色的小正方形，一个黄色的大正方形，一个黑色的大正方形，一个蓝色的小正方形，一个蓝色的中号圆形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的小正方形，一个黑色的小正方形，一个黑色的大圆形，一个黄色的中号圆形。在右边的盒子里，有一个黄色的中号圆形，一个黑色的小正方形。如何将所有黄色的物品移到右边的盒子里？", "label": [["yellow", "square", "large", "left"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个蓝色的中号正方形、一个黑色的小号圆形、一个黄色的中号三角形。中间的盒子里有一个蓝色的小号圆形、一个黄色的大号圆形、一个黑色的中号正方形、一个蓝色的大号圆形、一个蓝色的小号正方形、一个黑色的小号圆形。右边的盒子里有一个蓝色的大号圆形、一个黄色的大号圆形。如何将所有黄色的物品移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黄色的大正方形，一个黄色的中等正方形，一个蓝色的小正方形。在中间的盒子里，有一个黄色的大圆形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的小正方形，一个蓝色的大三角形，一个黄色的中等正方形，一个黑色的小圆形，一个黄色的大三角形，一个黑色的小正方形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "middle", "left"], ["blue", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的小正方形、一个黄色的大圆形和一个黄色的中等三角形。中间的盒子里有一个黑色的小圆形、一个蓝色的中等三角形、一个黑色的小正方形和一个蓝色的小三角形。右边的盒子里有一个蓝色的小正方形、一个蓝色的大正方形、一个蓝色的小圆形、一个黑色的小三角形和一个黄色的中等正方形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "large", "left"], ["yellow", "round", "large", "left"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个蓝色中等三角形、一个蓝色中等正方形、一个黄色中等圆形、一个蓝色小正方形、一个黑色大正方形。中间的盒子里有一个黑色大三角形、一个黑色大三角形。右边的盒子里有一个黄色大三角形、一个黄色中等三角形、一个蓝色大圆形、一个蓝色中等三角形。如何将所有圆形移到右边的盒子里？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小蓝色正方形、一个大蓝色正方形、一个大黑色圆形。中间的盒子里有一个大黄色正方形、一个中等大小的蓝色三角形、一个大黄色正方形。右边的盒子里有一个大黄色正方形、一个大黑色圆形、一个大蓝色圆形、一个中等大小的黄色圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "large", "right"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形，一个黑色的小正方形，一个黑色的小三角形。中间的盒子里有一个蓝色的大圆形，一个黑色的大圆形。右边的盒子里有一个蓝色的大圆形，一个蓝色的大圆形，一个黄色的大圆形。如何将所有黄色物体移到左边的盒子中？", "label": [["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的中等三角形，一个黄色的大正方形，一个蓝色的大三角形，一个黑色的大三角形，一个黑色的中等圆形。在中间的盒子里，有一个蓝色的大正方形，一个蓝色的大三角形，一个蓝色的大圆形，一个黑色的中等三角形，一个黑色的大正方形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的小正方形，一个黄色的大圆形，一个黄色的中等三角形，一个黑色的大圆形，一个黄色的大正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "middle", "left"], ["yellow", "round", "large", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黄色的大三角形、一个黄色的中等圆形和一个黑色的中等三角形。中间的盒子里有一个黄色的小三角形、一个黑色的小三角形、一个蓝色的中等正方形和一个黄色的中等三角形。右边的盒子里有一个黑色的小正方形、一个黄色的大三角形、一个黑色的大正方形和一个蓝色的小圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "middle", "left"], ["black", "square", "small", "right"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个蓝色的小正方形，一个黄色的大正方形，一个黑色的小正方形。在中间的盒子里，有一个黑色的中等圆形，一个黄色的大圆形，一个黄色的中等三角形，一个黄色的大正方形，一个黑色的中等三角形。在右边的盒子里，有一个黑色的大正方形，一个蓝色的小三角形，一个蓝色的小三角形，一个黑色的大三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["blue", "triangle", "small", "right"], ["black", "triangle", "large", "right"], ["yellow", "triangle", "middle", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形和一个蓝色的大正方形。中间的盒子里有一个黄色的小正方形、一个黄色的中号圆形和一个黑色的大号圆形。右边的盒子里有一个黑色的小正方形和一个蓝色的中号圆形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黑色的大圆形，一个蓝色的小正方形，一个黑色的中等圆形。在中间的盒子里，有一个蓝色的中等圆形，一个黄色的小正方形，一个蓝色的大正方形。在右边的盒子里，有一个蓝色的中等正方形，一个黄色的中等圆形，一个黑色的小圆形，一个黑色的中等正方形，一个黄色的中等三角形，一个黑色的中等三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["black", "round", "small", "right"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个黑色的大三角形、一个蓝色的中等三角形、一个黄色的小正方形和一个黑色的小正方形。在中间的盒子里，有一个黄色的小正方形和一个黄色的小圆形。在右边的盒子里，有一个黄色的小三角形、一个黄色的大圆形、一个黄色的中等三角形和一个黑色的大三角形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "small", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形，一个蓝色的中间圆形。中间的盒子里有一个蓝色的大正方形，一个黄色的大圆形，一个黑色的中间三角形，一个蓝色的大三角形。右边的盒子里有一个黑色的小圆形，一个蓝色的中间正方形，一个黄色的小正方形，一个黑色的大正方形，一个黄色的中间圆形，一个黄色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黄色的大正方形，一个黄色的大圆形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的中等三角形，一个黄色的小三角形，一个黄色的中等圆形，一个黄色的中等圆形，一个黑色的大正方形。在右边的盒子里，有一个黑色的中等正方形，一个黄色的小三角形，一个黄色的小圆形，一个黑色的中等圆形，一个黑色的中等圆形，一个黑色的中等正方形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["yellow", "round", "large", "left"], ["yellow", "round", "small", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黑色的大三角形，一个蓝色的大正方形。在中间的盒子里，有一个蓝色的中等正方形，一个黄色的小三角形，一个黄色的中等圆形，一个黄色的大三角形，一个蓝色的中等正方形，一个黑色的大三角形。在右边的盒子里，有一个黑色的小三角形，一个黑色的大正方形，一个蓝色的中等圆形，一个黄色的小正方形，一个黑色的大正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "small", "middle"], ["yellow", "round", "middle", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个蓝色中等三角形，一个大黄三角形，一个大黄圆形，一个小蓝正方形，一个大黄圆形。在中间的盒子里，有一个小黄圆形，一个蓝色中等圆形，一个大黄正方形。在右边的盒子里，有一个小黑正方形，一个蓝色大正方形，一个小黄三角形，一个小黑正方形，一个蓝色中等正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["blue", "triangle", "middle", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形、一个小黄三角形和一个中黄三角形。中间的盒子里有一个小黄三角形、一个小黄正方形和一个中黑圆形。右边的盒子里有一个大黑三角形、一个中黄圆形、一个小蓝圆形和一个小蓝圆形、一个大黄圆形。如何将所有正方形移动到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个蓝色的大三角形、一个黄色的中等圆形、一个黄色的大正方形、一个黄色的大正方形。在中间的盒子里，有一个蓝色的大正方形、一个黄色的大圆形、一个黑色的小圆形。在右边的盒子里，有一个蓝色的中等三角形、一个黄色的小三角形、一个黑色的中等正方形、一个黑色的小正方形、一个蓝色的中等圆形、一个黑色的小圆形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黑色的小圆形和一个黑色的小正方形。中间的盒子里有一个蓝色的大正方形、一个黑色的中等大小的圆形和一个蓝色的小三角形。右边的盒子里有一个黄色的中等大小的圆形、一个蓝色的中等大小的三角形、一个黑色的中等大小的圆形、一个黄色的小圆形和一个黄色的大三角形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "round", "middle", "right"], ["yellow", "round", "small", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等圆形，一个黑色的中等正方形，一个黄色的大三角形，一个黄色的小圆形，一个蓝色的小圆形，一个黄色的中等圆形。在中间的盒子里，有一个黄色的小圆形，一个蓝色的大圆形，一个黄色的小圆形，一个蓝色的大正方形。在右边的盒子里，有一个黄色的大圆形，一个蓝色的大圆形，一个黄色的小三角形，一个蓝色的中等圆形，一个黄色的大三角形，一个蓝色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "left"], ["yellow", "round", "middle", "left"], ["yellow", "round", "large", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个蓝色的中等圆形，一个黄色的中等三角形。中间的盒子里有一个黑色的大三角形，一个黑色的大三角形，一个蓝色的中等圆形，一个蓝色的中等圆形。右边的盒子里有一个蓝色的小圆形，一个黑色的大圆形，一个黄色的小三角形，一个黑色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个黄色的大正方形、一个黄色的大正方形、一个黑色的大圆形和一个黄色的中等三角形。在中间的盒子里，有一个黄色的小圆形、一个黑色的中等三角形、一个黄色的中等圆形、一个蓝色的大三角形、一个黑色的小圆形和一个蓝色的大三角形。在右边的盒子里，有一个蓝色的中等正方形、一个蓝色的大三角形、一个黄色的小三角形、一个黄色的大圆形、一个蓝色的中等圆形和一个黑色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "large", "left"], ["black", "round", "large", "left"], ["yellow", "round", "small", "middle"], ["yellow", "round", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黑色的小三角形，一个蓝色的大正方形。在中间的盒子里，有一个黑色的中等大小的正方形，一个黑色的中等大小的圆形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小正方形，一个黄色的小三角形，一个黄色的小圆形，一个蓝色的大正方形，一个黄色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个黄色的大圆形。中间的盒子里有一个黄色的小正方形，一个黑色的大三角形，一个蓝色的中等正方形，一个黄色的中等正方形，一个蓝色的大圆形。右边的盒子里有一个黄色的中等圆形，一个黄色的中等正方形，一个黄色的小圆形，一个蓝色的大圆形，一个黄色的大三角形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["yellow", "round", "small", "right"], ["blue", "round", "large", "right"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的中等三角形和一个蓝色的中等圆形。在中间的盒子里，有一个黄色的小三角形，一个黑色的小正方形，一个蓝色的小圆形，一个黄色的中等三角形和一个黑色的大圆形。在右边的盒子里，有一个黄色的大正方形，一个蓝色的中等正方形，一个黄色的大三角形和一个黄色的中等正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "square", "large", "right"], ["yellow", "triangle", "large", "right"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的小正方形和一个黄色的小圆形。中间的盒子里有一个黑色的中等三角形、一个黑色的大正方形、一个黑色的小圆形和一个黄色的小正方形。右边的盒子里有一个蓝色的中等三角形和一个黑色的大正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["black", "triangle", "middle", "middle"], ["black", "square", "large", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个蓝色的中等正方形和一个黑色的中等正方形。中间的盒子里有一个蓝色的小圆形、一个黑色的中等正方形和一个蓝色的小正方形。右边的盒子里有一个黑色的大正方形和一个黄色的小圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "large", "left"], ["black", "square", "middle", "left"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形、一个黑色的小圆形、一个蓝色的大正方形、一个黑色的大三角形、一个蓝色的中号圆形和一个黑色的大正方形。中间的盒子里有一个蓝色的中号圆形、一个黄色的中号圆形和一个黑色的小正方形。右边的盒子里有一个黄色的大三角形和一个黄色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个小黑正方形，一个大黑圆形，一个蓝色大正方形，一个中等大小的黑色正方形，一个蓝色小圆形。在中间的盒子里，有一个蓝色大三角形，一个黑色大三角形，一个蓝色小圆形。在右边的盒子里，有一个蓝色中等大小的圆形，一个蓝色小圆形。如何将所有圆形移到左边的盒子中？", "label": [["blue", "round", "middle", "right"], ["blue", "round", "small", "right"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的大圆形、一个黄色的小圆形、一个黑色的中圆形。中间的盒子里有一个黄色的小正方形、一个蓝色的小正方形、一个黄色的中正方形、一个黑色的大圆形。右边的盒子里有一个黑色的大正方形、一个黄色的大正方形、一个黄色的小三角形、一个黑色的中圆形、一个黑色的小圆形、一个黄色的中圆形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "large", "right"], ["yellow", "square", "large", "right"], ["yellow", "square", "small", "middle"], ["blue", "square", "small", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个蓝色的中等圆形，一个黑色的小正方形。中间的盒子里有一个黄色的中等圆形，一个黑色的大三角形，一个黑色的小圆形，一个蓝色的中等三角形，一个蓝色的小三角形。右边的盒子里有一个黑色的中等正方形，一个黄色的小圆形。如何将所有蓝色物品移到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黑色的小三角形，一个黄色的小三角形，一个黑色的小三角形，一个黄色的中等圆形。在中间的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个黑色的大正方形，一个蓝色的小三角形，一个黄色的中等正方形，一个蓝色的小三角形。在右边的盒子里，有一个蓝色的大圆形，一个蓝色的小三角形，一个黑色的小三角形，一个黑色的大正方形，一个黄色的中等正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "right"], ["black", "triangle", "small", "right"], ["black", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形、一个黑色的中号圆形、一个蓝色的大号圆形、一个黄色的大号圆形。中间的盒子里有一个黑色的中号正方形、一个黄色的大号正方形、一个蓝色的小号圆形、一个黑色的大号正方形。右边的盒子里有一个黄色的大号正方形、一个黑色的小号三角形、一个黄色的中号三角形。如何将所有黑色物品移动到右边的盒子？", "label": [["black", "round", "middle", "left"], ["black", "square", "middle", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个蓝色的中等圆形，一个黄色的小正方形，一个黑色的中等正方形。在中间的盒子里，有一个黑色的小圆形，一个黄色的小三角形，一个蓝色的大三角形，一个黑色的小正方形，一个黑色的大圆形。在右边的盒子里，有一个黄色的小三角形，一个黄色的中等三角形，一个蓝色的小圆形，一个黄色的大三角形，一个黑色的中等正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形，一个蓝色的中圆形。中间的盒子里有一个蓝色的大圆形，一个黑色的中三角形，一个黄色的中圆形，一个蓝色的中三角形。右边的盒子里有一个黑色的大圆形，一个蓝色的中正方形，一个蓝色的大圆形，一个黄色的中三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "middle", "right"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个黄色的中等正方形，一个黄色的中等三角形。中间的盒子里有一个黑色的大正方形，一个蓝色的中等三角形，一个黄色的小圆形，一个黄色的中等正方形。右边的盒子里有一个黑色的中等三角形，一个蓝色的大正方形。如何将所有的三角形移到中间的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形，一个蓝色的大三角形，一个黄色的中等三角形，一个蓝色的大正方形，一个蓝色的中等圆形，一个蓝色的小正方形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的小圆形，一个黄色的大正方形，一个黄色的大圆形，一个黄色的中等三角形，一个黑色的大正方形。在右边的盒子里，有一个黑色的大圆形，一个黑色的中等正方形，一个蓝色的小正方形，一个蓝色的中等圆形，一个黄色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形和一个黄色的小圆形。中间的盒子里有一个黑色的小圆形、一个蓝色的小正方形、一个黑色的中等三角形和一个黑色的大三角形。右边的盒子里有一个蓝色的中等三角形、一个黑色的大正方形和一个蓝色的中等圆形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "middle", "right"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的小三角形，一个蓝色的大正方形，一个黑色的中等正方形，一个黑色的大三角形。在中间的盒子里，有一个黑色的小正方形，一个黑色的大正方形，一个蓝色的小三角形，一个黑色的小圆形。在右边的盒子里，有一个黄色的大圆形，一个黑色的中等三角形，一个黑色的小正方形，一个蓝色的中等圆形，一个蓝色的中等正方形。如何将所有正方形移动到中间的盒子里？", "label": [["blue", "square", "large", "left"], ["black", "square", "middle", "left"], ["black", "square", "small", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等圆形、一个黑色的中等三角形、一个蓝色的大三角形和一个蓝色的小三角形。中间的盒子里有一个黑色的中等正方形、一个黄色的大三角形、一个蓝色的小正方形、一个黄色的小圆形和一个蓝色的小圆形。右边的盒子里有一个蓝色的大正方形和一个蓝色的大正方形。如何将所有的正方形移到左边的盒子里？", "label": [["blue", "square", "large", "right"], ["blue", "square", "large", "right"], ["black", "square", "middle", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形，一个蓝色的小圆形，一个蓝色的中等圆形和一个黄色的小三角形。中间的盒子里有一个蓝色的中等圆形，一个黄色的大三角形，一个黄色的大正方形和一个蓝色的中等正方形。右边的盒子里有一个蓝色的中等正方形，一个黑色的小正方形，一个蓝色的小正方形和一个黄色的中等三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个黄色的小圆形、一个蓝色的大正方形。中间的盒子里有一个黄色的大圆形、一个蓝色的大正方形。右边的盒子里有一个蓝色的中等三角形、一个蓝色的小正方形、一个黄色的中等正方形、一个蓝色的中等三角形、一个黑色的大正方形、一个黑色的大圆形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "large", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的中等三角形，一个蓝色的大圆形，一个黑色的大正方形，一个黄色的小正方形，一个蓝色的大正方形。在中间的盒子里，有一个蓝色的中等三角形，一个黑色的大圆形，一个蓝色的小正方形，一个蓝色的大圆形，一个黑色的小三角形。在右边的盒子里，有一个黑色的小圆形，一个蓝色的中等正方形，一个蓝色的中等三角形，一个黄色的中等圆形，一个黑色的大正方形。如何将所有的正方形移到右边的盒子里？", "label": [["black", "square", "large", "left"], ["yellow", "square", "small", "left"], ["blue", "square", "large", "left"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个黄色的中等三角形，一个黄色的大正方形，一个黄色的小三角形。中间的盒子里有一个黄色的小三角形，一个蓝色的中等圆形，一个黄色的小三角形。右边的盒子里有一个蓝色的大正方形，一个黄色的大圆形。如何将所有正方形移动到右边的盒子中？", "label": [["black", "square", "small", "left"], ["yellow", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的中等三角形、一个黄色的小正方形和一个蓝色的小圆形。中间的盒子里有一个黑色的小圆形、一个黑色的大正方形、一个黄色的中等正方形、一个蓝色的小正方形、一个蓝色的小圆形和一个黄色的中等三角形。右边的盒子里有一个蓝色的小圆形和一个黄色的小圆形。如何将所有的正方形移到中间的盒子里？", "label": [["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的小三角形、一个黄色的中等正方形、一个蓝色的中等圆形和一个黄色的小三角形。中间的盒子里有一个黄色的大圆形、一个蓝色的小正方形和一个黄色的小正方形。右边的盒子里有一个黑色的中等圆形、一个黄色的中等圆形和一个蓝色的大正方形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "large", "left"], ["blue", "round", "middle", "left"], ["black", "round", "middle", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的大正方形，一个黄色的小圆形。在中间的盒子里，有一个黄色的小三角形，两个黑色的小三角形，一个黑色的中等圆形，一个蓝色的中等圆形。在右边的盒子里，有一个黄色的中等三角形，一个黄色的小圆形，一个黄色的大圆形，一个黑色的中等正方形，一个黑色的小三角形，一个黑色的中等圆形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个蓝色的中等三角形，一个黑色的中等三角形，一个蓝色的大正方形。在中间的盒子里，有一个蓝色的大圆形，一个黄色的小圆形，一个黄色的小圆形，一个黄色的小圆形，一个黄色的小三角形，一个黑色的小圆形。在右边的盒子里，有一个黑色的小正方形，一个黑色的小三角形，一个黑色的中等三角形，一个黄色的大三角形。如何将所有正方形移动到中间的盒子？", "label": [["blue", "square", "large", "left"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黄色的中等三角形、一个黑色的大三角形和一个黄色的小正方形。中间的盒子里有一个黄色的大正方形和一个黑色的大圆形。右边的盒子里有一个黑色的大正方形、一个黑色的大三角形和一个蓝色的中等圆形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "large", "left"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形，一个中等黑色圆形。中间的盒子里有一个大黑色正方形，一个中等蓝色正方形，一个中等蓝色正方形，一个小黑色正方形，一个大黑色三角形。右边的盒子里有一个小黄色正方形，一个大蓝色正方形，一个大黄色圆形，一个中等黄色三角形，一个中等蓝色三角形。如何将所有黄色物品移动到右边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个黄色的大正方形。中间的盒子里有两个蓝色的中圆形、一个蓝色的大正方形、一个黑色的中正方形。右边的盒子里有两个黑色的中正方形、一个黄色的小三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黑色的大三角形，一个黄色的大圆形。中间的盒子里有一个黑色的大圆形，一个黄色的大正方形，两个黑色的小正方形，一个黑色的小三角形。右边的盒子里有一个黄色的小三角形，一个蓝色的小三角形，一个黑色的中等三角形，一个蓝色的小正方形，一个黑色的小圆形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "middle", "left"], ["black", "triangle", "large", "left"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的中圆形。在中间的盒子里，有一个黄色的中圆形，一个黄色的大正方形，一个黄色的大正方形，一个黄色的小三角形，一个黄色的大正方形。在右边的盒子里，有一个黑色的大圆形，一个黄色的小三角形，一个黑色的中三角形，一个黑色的小三角形，一个蓝色的小三角形，一个黄色的小圆形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "small", "left"], ["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形和一个蓝色的中等正方形。在中间的盒子里，有两个黑色的大三角形。在右边的盒子里，有一个黄色的中等三角形、一个蓝色的大圆形、一个黑色的大三角形、一个黑色的大圆形、一个黄色的大三角形和一个黑色的大三角形。如何将所有黑色物品移动到中间的盒子中？\n\n将上述文本翻译成中文。", "label": [["black", "triangle", "large", "right"], ["black", "round", "large", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的小圆形，一个蓝色的大正方形，一个黑色的大正方形，一个黄色的大圆形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的小三角形，一个黑色的中等三角形，一个蓝色的小三角形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的小正方形，一个黄色的中等正方形，一个蓝色的大正方形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "small", "left"], ["yellow", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黄色的小圆形和一个黄色的中等圆形。中间的盒子里有一个蓝色的小三角形、一个蓝色的大三角形、一个蓝色的大圆形、一个黄色的小正方形、一个黑色的大圆形和一个黑色的大圆形。右边的盒子里有一个黄色的小三角形和一个蓝色的大三角形。如何将所有黑色物品移到左边的盒子中？", "label": [["black", "round", "large", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个蓝色的大圆形、一个黄色的中圆形、一个蓝色的大三角形、一个黑色的中三角形、一个蓝色的大正方形。中间的盒子里有一个黑色的中三角形、一个黄色的小正方形。右边的盒子里有一个蓝色的中圆形、一个黑色的中正方形、一个黑色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "large", "left"], ["yellow", "round", "middle", "left"], ["blue", "round", "middle", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形，一个黄色的大三角形，一个蓝色的小正方形。中间的盒子里有一个蓝色的大正方形，一个黑色的中等圆形，一个蓝色的中等三角形，一个黄色的大三角形，一个黄色的大正方形，一个黑色的中等正方形。右边的盒子里有一个黑色的大圆形，一个蓝色的中等正方形，一个蓝色的小三角形。如何将所有黄色物品移动到左边的盒子？", "label": [["yellow", "triangle", "large", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的小正方形，一个黄色的大三角形，一个黄色的小圆形，一个黑色的大正方形，一个黄色的小圆形。在中间的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个蓝色的大圆形，一个蓝色的小正方形，一个黑色的中等大小的正方形。在右边的盒子里，有一个黄色的大三角形，一个黑色的大三角形，一个蓝色的小正方形，一个黄色的大三角形，一个黄色的大三角形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "small", "left"], ["blue", "round", "large", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中间正方形，一个蓝色的大正方形，一个黑色的小三角形，一个蓝色的大圆形，一个黄色的大正方形。在中间的盒子里，有一个黑色的大三角形，一个蓝色的小正方形，一个黑色的大三角形，一个黑色的中间正方形，一个黑色的大正方形。在右边的盒子里，有一个黑色的中间三角形，一个蓝色的中间正方形，一个黑色的小三角形，一个黑色的小正方形，一个蓝色的大三角形，一个黄色的小三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"], ["black", "square", "middle", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等三角形和一个黑色的中等圆形。中间的盒子里有一个黄色的中等正方形、一个黑色的中等正方形、一个蓝色的大正方形、一个黑色的中等三角形、一个蓝色的中等三角形和一个黄色的小圆形。右边的盒子里有一个黄色的小三角形和一个蓝色的中等圆形。如何将所有蓝色物品移到左边的盒子？", "label": [["blue", "round", "middle", "right"], ["blue", "square", "large", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形和一个黄色的中等正方形。中间的盒子里有一个蓝色的大圆形、一个黑色的小正方形和一个蓝色的小圆形。右边的盒子里有一个黑色的小正方形、一个黄色的大正方形和一个黄色的中等正方形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黑色的中等圆形，一个黄色的大三角形，一个黄色的中等三角形，一个黑色的小圆形。在中间的盒子里，有一个黑色的小正方形，一个黑色的中等圆形，一个蓝色的中等圆形，一个黑色的大三角形，一个黄色的小三角形，一个黑色的大三角形。在右边的盒子里，有一个黑色的中等圆形，一个黑色的大三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "middle", "left"], ["black", "round", "small", "left"], ["black", "square", "small", "middle"], ["black", "round", "middle", "middle"], ["black", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个黑色的小正方形，一个黑色的小圆形，一个黑色的小圆形，一个黑色的小三角形，一个黄色的中等圆形。在中间的盒子里，有一个蓝色的小正方形，一个蓝色的小圆形，一个蓝色的中等正方形。在右边的盒子里，有一个黑色的大圆形，一个黑色的大三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "round", "small", "left"], ["black", "round", "small", "left"], ["black", "triangle", "small", "left"], ["black", "round", "large", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形，一个黄色的大三角形。中间的盒子里有一个黄色的大正方形，一个黄色的中间三角形。右边的盒子里有一个蓝色的大正方形，一个黄色的中间三角形，一个黑色的大三角形，两个黄色的大三角形和一个蓝色的大圆形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "square", "large", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形，一个大黄三角形。中间的盒子里有一个大黄正方形，一个小黑三角形。右边的盒子里有一个中等大小的蓝色正方形，一个小黄正方形，一个小黄正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["yellow", "square", "small", "right"], ["yellow", "square", "small", "right"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形和一个黄色的中号正方形。中间的盒子里有一个蓝色的中号圆形和一个蓝色的小号圆形。右边的盒子里有一个黑色的中号三角形、一个黄色的小号三角形、一个黄色的小号圆形、一个蓝色的中号圆形、一个黄色的中号正方形和一个蓝色的大号圆形。如何将所有圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "left"], ["blue", "round", "middle", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的大圆形，一个黄色的大三角形，一个黄色的中等大小的正方形。在中间的盒子里，有一个黑色的中等大小的三角形，一个蓝色的大圆形，一个黑色的小正方形，一个蓝色的小三角形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小三角形，一个蓝色的大圆形，一个黑色的大圆形，一个黑色的小圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "large", "right"], ["black", "round", "small", "right"], ["black", "triangle", "middle", "middle"], ["black", "square", "small", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的小正方形，一个蓝色的中等正方形。在中间的盒子里，有一个黄色的中等圆形，一个蓝色的大三角形，一个黑色的小圆形，一个黑色的小三角形，一个黑色的中等正方形，一个黄色的小三角形。在右边的盒子里，有一个蓝色的中等正方形，一个黑色的小圆形，一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的小三角形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "small", "left"], ["blue", "square", "small", "left"], ["blue", "square", "middle", "left"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的大正方形、一个黑色的大圆形、一个蓝色的中等圆形、一个黄色的小正方形、一个黄色的小正方形。中间的盒子里有一个黄色的大正方形、一个黄色的中等圆形。右边的盒子里有一个黑色的大三角形、一个黑色的中等正方形、一个黄色的小三角形、一个黑色的大三角形、一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个蓝色的大正方形、一个黑色的大圆形和一个黄色的小圆形。中间的盒子里有一个黑色的大正方形、一个蓝色的大三角形和一个蓝色的中号正方形。右边的盒子里有一个黑色的中号正方形、一个黑色的大正方形和一个蓝色的大正方形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["blue", "triangle", "large", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黑色圆形，一个小黑色三角形，一个小黄色三角形，一个中等大小的黑色正方形，一个中等大小的黑色三角形，一个小黄色正方形。在中间的盒子里，有一个大蓝色三角形，一个小蓝色圆形，一个中等大小的蓝色圆形，一个中等大小的黑色正方形，一个小蓝色圆形，一个小黄色圆形。在右边的盒子里，有一个小蓝色三角形，一个大蓝色正方形，一个小黑色正方形，一个小蓝色正方形，一个中等大小的蓝色正方形。如何将所有正方形移动到右边的盒子里？", "label": [["black", "square", "middle", "left"], ["yellow", "square", "small", "left"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的小三角形，一个黄色的小圆形，一个黄色的小正方形，一个黄色的中等大小的正方形。在中间的盒子里，有一个黄色的小三角形，一个蓝色的小三角形，一个黄色的大圆形，一个黄色的小正方形，一个黑色的大三角形。在右边的盒子里，有一个黑色的大圆形，一个黑色的中等大小的圆形，一个蓝色的中等大小的圆形，一个蓝色的小三角形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中间正方形，一个黄色的中间三角形，一个蓝色的中间正方形，一个蓝色的小三角形，一个黑色的小三角形。在中间的盒子里，有一个黄色的中间正方形，一个黑色的大圆形，一个黑色的小三角形，一个黑色的小圆形。在右边的盒子里，有一个蓝色的大三角形，一个蓝色的中间圆形，一个蓝色的小圆形，一个蓝色的小正方形，一个黑色的大正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["blue", "round", "middle", "right"], ["blue", "round", "small", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个中黄正方形，一个大黄正方形。中间的盒子里有一个大黄三角形，一个中蓝三角形。右边的盒子里有一个大黄圆形，一个大黄正方形，一个小黑三角形。如何将所有三角形移动到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的小圆形，一个蓝色的中等圆形，一个黑色的小三角形，一个蓝色的大圆形。在中间的盒子里，有一个黄色的小三角形，一个黑色的小正方形，一个黄色的大三角形，一个蓝色的大三角形，一个黑色的小正方形，一个黑色的大正方形。在右边的盒子里，有一个蓝色的小正方形，一个蓝色的大圆形，一个黄色的小正方形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "right"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中号圆形、一个黄色的大正方形、一个蓝色的大圆形、一个黄色的小正方形。在中间的盒子里，有一个黑色的小正方形、一个黄色的小三角形、一个蓝色的小三角形、一个黄色的大圆形、一个黑色的大正方形。在右边的盒子里，有一个黑色的小三角形、一个黑色的中号三角形、一个蓝色的大三角形、一个蓝色的大圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个黑色的大三角形、一个黄色的中等三角形和一个黑色的小三角形。中间的盒子里有一个黄色的中等圆形、一个黑色的大圆形、一个黑色的中等圆形、一个黄色的中等正方形和一个黑色的大三角形。右边的盒子里有一个蓝色的中等正方形、一个黑色的大三角形和一个黄色的大圆形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "round", "large", "middle"], ["black", "round", "middle", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的中等三角形，一个黄色的小三角形，一个黄色的小正方形，一个黑色的大正方形。在中间的盒子里，有一个黄色的中等圆形，一个黑色的中等圆形，一个蓝色的中等正方形，一个黑色的小圆形，一个黑色的小正方形。在右边的盒子里，有一个黑色的小正方形，一个蓝色的大圆形，一个黑色的大圆形，一个黄色的小三角形，一个黄色的小正方形，一个黑色的中等三角形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "large", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个大黄色圆形、一个小黄色圆形、一个小黄色三角形、一个小黑色圆形。中间的盒子里有一个中等大小的黑色正方形、一个大黄色正方形、一个小黄色三角形、一个大蓝色正方形、一个大黄色圆形、一个中等大小的蓝色正方形。右边的盒子里有一个大黄色三角形、一个大黄色正方形、一个中等大小的蓝色正方形、一个小黑色三角形、一个小黑色正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "large", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个黄色的小三角形。中间的盒子里有一个黑色的大圆形、一个蓝色的大正方形和一个黑色的中等三角形。右边的盒子里有一个黄色的小三角形和一个黄色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个黑中等正方形，一个黄中等三角形，一个蓝中等圆形，一个黑中等正方形，一个黑中等圆形。在中间的盒子里，有一个黄中等圆形，一个蓝小圆形，一个蓝中等圆形，一个黄中等圆形。在右边的盒子里，有一个黄大圆形，一个蓝中等三角形，一个黄大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个蓝色的中等圆形，一个黑色的中等正方形。在中间的盒子里，有一个黄色的小三角形，一个蓝色的中等三角形，一个黄色的大三角形，一个黄色的小圆形。在右边的盒子里，有一个蓝色的大圆形，一个蓝色的大正方形，一个黄色的大三角形，一个黄色的中等三角形，一个黄色的中等圆形，一个黑色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "large", "right"], ["yellow", "triangle", "middle", "right"], ["yellow", "triangle", "small", "middle"], ["blue", "triangle", "middle", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个蓝色的大三角形。中间的盒子里有一个黑色的小圆形、一个黑色的大三角形、两个蓝色的中等大小的圆形。右边的盒子里有一个黄色的中等大小的正方形、一个蓝色的大三角形和一个黄色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的大圆形和一个黄色的大圆形。中间的盒子里有一个黄色的小三角形、一个黑色的中等三角形、一个黄色的中等三角形和一个黑色的小正方形。右边的盒子里有一个蓝色的中等圆形、一个黄色的小正方形、一个黄色的中等圆形、一个黑色的小正方形、一个黑色的小三角形和一个黄色的大正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "round", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的中等三角形，一个黄色的中等三角形。在中间的盒子里，有一个黄色的中等圆形，一个黑色的大三角形，一个蓝色的小圆形，一个黄色的小圆形，一个黄色的中等正方形，一个蓝色的大圆形。在右边的盒子里，有一个黑色的小三角形，一个蓝色的小圆形，一个黑色的小正方形，一个蓝色的中等正方形，一个黑色的小圆形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "large", "left"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的小三角形，一个蓝色的大正方形，一个蓝色的大圆形，一个黄色的小正方形，一个黄色的中圆形。在中间的盒子里，有一个黄色的小正方形，一个黄色的中正方形，一个蓝色的中圆形。在右边的盒子里，有一个黄色的小正方形，一个黄色的大圆形，一个黄色的大正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "square", "small", "left"], ["yellow", "round", "middle", "left"], ["yellow", "square", "small", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中圆形、一个黑色的大圆形、一个蓝色的大正方形、一个黄色的中正方形、一个蓝色的大正方形。在中间的盒子里，有一个黑色的中三角形、一个蓝色的小圆形。在右边的盒子里，有一个黑色的小正方形、一个黄色的小三角形、一个黑色的小正方形、一个黄色的大正方形、一个蓝色的小三角形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "large", "left"], ["blue", "square", "large", "left"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的大圆形和一个蓝色的小圆形。中间的盒子里有一个蓝色的中等大小的圆形、一个蓝色的中等大小的三角形、一个黄色的小圆形、一个黄色的大正方形和一个黑色的小三角形。右边的盒子里有一个蓝色的大正方形、两个黑色的小正方形和一个蓝色的中等大小的正方形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "large", "left"], ["blue", "round", "large", "left"], ["blue", "round", "small", "left"], ["blue", "round", "middle", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个蓝色的中等三角形，一个黄色的大正方形，一个蓝色的小正方形，一个黄色的中等正方形，一个黄色的小三角形。在中间的盒子里，有一个黑色的小正方形，一个蓝色的中等三角形，一个黑色的中等三角形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的中等圆形，一个黑色的中等圆形，一个蓝色的大圆形，一个黄色的小正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "small", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑三角形、一个大黑三角形、一个大黑圆形、一个大蓝圆形、一个小蓝三角形和一个大黑三角形。中间的盒子里有一个大蓝圆形和一个小黄圆形。右边的盒子里有一个小黑正方形、一个中黑正方形、一个大蓝三角形和一个大蓝正方形。如何将所有三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "large", "left"], ["blue", "triangle", "small", "left"], ["black", "triangle", "large", "left"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的中圆形，一个黄色的中三角形，一个蓝色的小正方形，一个黑色的小三角形，一个蓝色的中三角形。在中间的盒子里，有一个黑色的中圆形，一个蓝色的大圆形，一个黑色的小圆形，一个蓝色的小三角形，一个蓝色的小圆形，一个黑色的小圆形。在右边的盒子里，有一个蓝色的中圆形，一个黄色的中圆形，一个蓝色的大圆形，一个黑色的中圆形，一个黑色的大正方形，一个黑色的大正方形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形、一个黑色的中等正方形、一个黑色的小三角形和一个黑色的大正方形。中间的盒子里有一个蓝色的中等圆形和一个黑色的小正方形。右边的盒子里有一个黄色的中等正方形和一个黑色的小三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的大正方形、一个黑色的大圆形、一个蓝色的中等圆形、一个黑色的小正方形。中间的盒子里有一个蓝色的中等圆形、一个黑色的小三角形。右边的盒子里有一个黑色的大正方形、一个黄色的大正方形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个蓝色的大正方形、一个蓝色的大圆形、一个蓝色的中等正方形和一个黑色的小圆形。中间的盒子里有一个黄色的大圆形、一个黑色的中等正方形、一个蓝色的小正方形和一个黄色的大圆形。右边的盒子里有一个蓝色的中等三角形、一个黑色的大三角形和一个黑色的大三角形。如何将所有黑色物品移到左边的盒子中？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "large", "right"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黄色的小正方形，一个蓝色的中等三角形，一个黑色的中等正方形，一个黄色的中等三角形，一个黑色的大正方形。在中间的盒子里，有一个黄色的小三角形，一个蓝色的小三角形，一个黄色的中等正方形，一个黄色的小三角形，一个黑色的中等三角形，一个黑色的中等圆形。在右边的盒子里，有一个黄色的中等正方形，一个蓝色的小三角形，一个黑色的大三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黄色的小三角形，一个蓝色的大正方形，一个黄色的大正方形，一个黑色的大正方形，一个黄色的中等三角形。在中间的盒子里，有一个黄色的大正方形，一个黄色的小正方形，一个蓝色的大正方形，一个黄色的大正方形。在右边的盒子里，有一个蓝色的中等圆形，一个蓝色的大三角形，一个蓝色的大三角形，一个黄色的中等三角形，一个黑色的小三角形。如何将所有正方形移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["blue", "square", "large", "left"], ["yellow", "square", "large", "left"], ["black", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的小三角形、一个黑色的小圆形、一个黑色的中圆形、一个黑色的中圆形、一个黑色的小三角形。中间的盒子里有一个蓝色的大圆形、一个蓝色的小正方形、一个黄色的大正方形、一个黄色的大三角形。右边的盒子里有一个黄色的大正方形、一个蓝色的中正方形、一个黑色的大圆形、一个黄色的大正方形、一个黑色的中圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["black", "round", "small", "left"], ["black", "round", "middle", "left"], ["black", "round", "middle", "left"], ["black", "round", "large", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的大三角形、一个黄色的中圆形。中间的盒子里有一个蓝色的大三角形、一个黑色的大三角形、一个蓝色的中正方形、一个蓝色的大正方形、一个黑色的大三角形、一个蓝色的中三角形。右边的盒子里有一个蓝色的小圆形、一个黑色的小圆形、一个黄色的小圆形、一个黄色的大圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "triangle", "large", "middle"], ["blue", "square", "middle", "middle"], ["blue", "square", "large", "middle"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的小圆形，一个蓝色的中等圆形，一个黄色的大三角形，一个黑色的小正方形。在中间的盒子里，有一个黑色的小正方形，一个黑色的小正方形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的小正方形，一个蓝色的大圆形，一个蓝色的小正方形，一个黑色的中等三角形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形、一个黑色的中等正方形和一个蓝色的小三角形。中间的盒子里有一个蓝色的中等正方形、一个黑色的中等三角形、一个黄色的大圆形和两个黄色的大三角形。右边的盒子里有一个蓝色的小圆形、一个黑色的中等圆形和一个黑色的大正方形。如何将所有正方形移到右边的盒子中？", "label": [["yellow", "square", "large", "left"], ["black", "square", "middle", "left"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个蓝色的大正方形，一个蓝色的中等三角形，一个黄色的大三角形。在中间的盒子里，有一个黄色的大圆形，一个黄色的大正方形。在右边的盒子里，有一个黑色的中等正方形，一个黑色的小三角形，一个黄色的中等圆形。如何将所有正方形移动到中间的盒子里？", "label": [["black", "square", "middle", "left"], ["blue", "square", "large", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的小圆形，一个黑色的中等正方形。在中间的盒子里，有一个黄色的大三角形，一个黄色的大正方形，一个黄色的大三角形，一个蓝色的小三角形，一个黄色的大正方形，一个蓝色的大圆形。在右边的盒子里，有一个黑色的小正方形，一个黄色的大三角形，一个黑色的大圆形，一个黑色的小正方形，一个蓝色的大三角形，一个蓝色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "round", "small", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个蓝色的中等圆形，一个蓝色的中等圆形，一个黄色的大正方形，一个蓝色的小正方形，一个黄色的小正方形。在中间的盒子里，有一个蓝色的大圆形，一个蓝色的大正方形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的中等圆形，一个黑色的大圆形，一个黑色的小圆形，一个黄色的小圆形，一个黑色的中等正方形，一个蓝色的小圆形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "large", "left"], ["blue", "square", "small", "left"], ["yellow", "square", "small", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个蓝色的大三角形和一个黄色的中等正方形。中间的盒子里有一个黑色的中等正方形、两个黄色的中等三角形、一个黑色的小三角形和一个黄色的小正方形。右边的盒子里有一个蓝色的大正方形、一个黄色的大三角形、一个蓝色的大正方形、一个黑色的小正方形和一个黄色的中等圆形。如何将所有黑色物品移到右边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的小正方形，一个黑色的大三角形，一个黑色的大正方形，一个蓝色的小三角形，一个黑色的中等圆形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的大三角形，一个黄色的小圆形，一个蓝色的小三角形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的大正方形，一个蓝色的小正方形，一个蓝色的小三角形，一个黑色的大正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["blue", "square", "small", "right"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个大黄色正方形，一个大黑色三角形，一个大黄色三角形，一个大黑色正方形。在中间的盒子里，有一个大黄色三角形，一个小黑色三角形，一个小黄色三角形，一个大蓝色正方形，一个小黑色正方形，一个小黑色圆形。在右边的盒子里，有一个中等大小的黄色三角形，一个中等大小的黄色三角形，一个大蓝色三角形，一个大黄色三角形，一个中等大小的黄色三角形，一个小黄色三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "middle"], ["black", "square", "small", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黑色的中等三角形。中间的盒子里有一个黄色的小三角形和一个蓝色的大正方形。右边的盒子里有一个蓝色的大三角形和一个黑色的小圆形。如何将所有蓝色物品移动到中间的盒子？请将以上文本翻译成中文。", "label": [["blue", "triangle", "small", "left"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的大圆形，一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的小三角形。在中间的盒子里，有一个黄色的中等大小的正方形，一个黑色的小三角形。在右边的盒子里，有一个黑色的中等大小的三角形，一个蓝色的中等大小的圆形，一个黄色的大圆形，一个蓝色的小正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "middle", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黑色的中等三角形和一个蓝色的大三角形。中间的盒子里有一个黄色的中等正方形、一个黄色的中等正方形、一个黑色的大圆形和一个黑色的大正方形。右边的盒子里有一个黑色的中等三角形和一个黄色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个小黑色圆形、一个小黑色正方形。中间的盒子里有一个大黑色正方形、一个中等大小的黄色正方形、一个小黑色圆形。右边的盒子里有一个小黄色三角形、一个小黑色三角形、一个中等大小的黑色三角形、一个大黄色三角形、一个小蓝色三角形。如何将所有正方形移到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["black", "square", "small", "left"], ["black", "square", "large", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中号圆形、一个蓝色的小正方形、一个黄色的大号圆形、一个黄色的大正方形、一个黑色的小正方形、一个黄色的中号正方形。在中间的盒子里，有一个黑色的小号圆形、一个蓝色的小三角形、一个黑色的中号圆形、一个蓝色的中号三角形、一个黄色的大号圆形、一个黑色的大号圆形。在右边的盒子里，有一个黄色的小号圆形、一个蓝色的中号三角形、一个蓝色的大号圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "middle", "left"], ["black", "square", "small", "left"], ["black", "round", "small", "middle"], ["black", "round", "middle", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个蓝色的大三角形、一个蓝色的小正方形、两个蓝色的中等圆形。中间的盒子里有一个黑色的小圆形、两个黑色的大三角形、三个黑色的中等圆形。右边的盒子里有一个黄色的大三角形、一个黑色的大三角形、一个蓝色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["blue", "round", "small", "right"], ["black", "round", "small", "middle"], ["black", "round", "middle", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的小圆形，一个黑色的中等三角形。在中间的盒子里，有一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的小圆形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的中等正方形，一个蓝色的大圆形，一个蓝色的大正方形，一个黄色的大三角形，一个黄色的小正方形，一个黑色的中等正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "round", "small", "left"], ["blue", "round", "small", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的小圆形、一个蓝色的中圆形和一个蓝色的大三角形。中间的盒子里有一个黑色的大圆形、一个蓝色的中圆形和一个黑色的小正方形。右边的盒子里有一个黑色的大圆形、一个黑色的中圆形、一个蓝色的小圆形和一个蓝色的小正方形。如何将所有的正方形移到左边的盒子里？", "label": [["blue", "square", "small", "right"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的中圆形，一个黑色的大圆形，一个黑色的大正方形，一个蓝色的小三角形，一个蓝色的大正方形。在中间的盒子里，有一个黑色的小圆形，一个黑色的小正方形，一个黑色的中三角形，一个蓝色的大圆形，一个蓝色的大正方形。在右边的盒子里，有一个黑色的中三角形，一个黑色的小正方形，一个蓝色的小三角形，一个黑色的小圆形，一个黑色的大三角形，一个蓝色的中圆形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "large", "left"], ["blue", "square", "large", "left"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个蓝色的大正方形。中间的盒子里有一个黄色的大圆形和一个黑色的大圆形。右边的盒子里有一个黑色的大三角形和两个黄色的小圆形。如何将所有的三角形移到左边的盒子里？", "label": [["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个蓝色的大正方形，一个蓝色的中等三角形。中间的盒子里有一个蓝色的大三角形，一个蓝色的小圆形，一个蓝色的大三角形。右边的盒子里有一个蓝色的中等圆形，一个黑色的中等圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "triangle", "large", "middle"], ["blue", "round", "small", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中圆形、一个蓝色的大正方形、一个蓝色的中圆形、一个黑色的小三角形和一个蓝色的小正方形。中间的盒子里有一个蓝色的小正方形、一个黄色的小三角形和一个黄色的中正方形。右边的盒子里有一个蓝色的小正方形、一个黑色的中三角形和一个黑色的大圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形、一个蓝色的中等正方形、一个蓝色的小三角形、一个蓝色的大正方形、一个蓝色的大圆形。在中间的盒子里，有一个黑色的中等正方形、一个黑色的中等三角形、一个蓝色的大三角形、一个黑色的中等圆形。在右边的盒子里，有一个黄色的大圆形、一个蓝色的中等三角形、一个蓝色的中等正方形、一个蓝色的小三角形、一个黄色的中等正方形。如何将所有的正方形移到左边的盒子里？", "label": [["blue", "square", "middle", "right"], ["yellow", "square", "middle", "right"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中号圆形、一个黄色的大正方形、一个黄色的小圆形、一个黄色的小正方形、一个黑色的中号正方形和一个黑色的大圆形。在中间的盒子里，有一个蓝色的大正方形、一个蓝色的小正方形、一个黄色的小圆形、一个蓝色的小三角形、一个蓝色的小圆形和一个蓝色的大圆形。在右边的盒子里，有一个黑色的中号三角形、一个蓝色的大正方形、一个黄色的大正方形、一个黑色的大圆形和一个黄色的中号正方形。如何将所有的圆形移到右边的盒子里？", "label": [["yellow", "round", "middle", "left"], ["yellow", "round", "small", "left"], ["black", "round", "large", "left"], ["yellow", "round", "small", "middle"], ["blue", "round", "small", "middle"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄圆形、一个大黑三角形、一个蓝色中等三角形、一个黄色中等三角形和一个黑色大圆形。在中间的盒子里，有一个蓝色小三角形、一个蓝色小正方形、一个蓝色小圆形、一个蓝色中等圆形和一个黄色中等圆形。在右边的盒子里，有一个黄色小三角形、一个黑色小圆形、一个黑色小正方形、一个蓝色中等正方形、一个蓝色中等圆形和一个蓝色大圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "large", "left"], ["black", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形、一个黄色的大圆形和一个黑色的大正方形。中间的盒子里有一个蓝色的小三角形、一个黑色的大三角形和一个黄色的中等三角形。右边的盒子里有一个黄色的中等三角形和一个黑色的大圆形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "middle", "right"], ["blue", "triangle", "small", "middle"], ["black", "triangle", "large", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的中等正方形，一个蓝色的小三角形，一个黑色的中等正方形，一个蓝色的大圆形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的小三角形，一个蓝色的中等三角形，一个黑色的大三角形。在右边的盒子里，有一个黑色的大三角形，一个黑色的大正方形，一个黑色的大正方形，一个蓝色的中等圆形，一个蓝色的大圆形。如何将所有黑色物体移动到右边的盒子中？", "label": [["black", "triangle", "middle", "left"], ["black", "square", "middle", "left"], ["black", "triangle", "middle", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个黄色的中圆形、一个黑色的小正方形和一个蓝色的中圆形。中间的盒子里有一个蓝色的小圆形、一个蓝色的大三角形和一个黄色的大圆形。右边的盒子里有一个黑色的中圆形和一个蓝色的中圆形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的大三角形。在中间的盒子里，有一个黄色的小正方形，两个黑色的小圆形，一个蓝色的大圆形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的小正方形，一个黄色的中等大小的圆形，两个蓝色的大三角形，一个黄色的小圆形。如何将所有黑色物体移动到中间的盒子？", "label": [["black", "triangle", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个黄色的中等圆形，一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的大圆形，一个黄色的大三角形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的中等正方形，一个黄色的大正方形，一个黑色的小圆形，一个蓝色的大正方形，一个黄色的小三角形。在右边的盒子里，有一个黑色的中等正方形，一个蓝色的大圆形，一个蓝色的大正方形，一个黑色的中等三角形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "round", "small", "left"], ["blue", "square", "large", "left"], ["blue", "square", "middle", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个黑色的大三角形、一个蓝色的大圆形、一个黑色的中等三角形和一个蓝色的中等圆形。在中间的盒子里，有一个黄色的小圆形、一个黄色的大正方形、一个黑色的大圆形、一个黄色的大圆形和一个黑色的大三角形。在右边的盒子里，有一个黄色的小圆形、一个黑色的大三角形、一个黄色的中等正方形和一个黑色的大三角形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个蓝色的中等正方形，一个蓝色的中等三角形，一个黑色的小圆形。在中间的盒子里，有一个蓝色的小三角形，一个黑色的小圆形，一个黑色的大圆形，一个黑色的大正方形，一个蓝色的中等圆形，一个黄色的大圆形。在右边的盒子里，有一个蓝色的中等正方形，一个蓝色的小三角形，一个蓝色的小三角形，一个黑色的大正方形。如何将所有的正方形移到中间的盒子里？", "label": [["blue", "square", "small", "left"], ["blue", "square", "middle", "left"], ["blue", "square", "middle", "right"], ["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个蓝色的大三角形，一个黄色的中等三角形，一个黄色的大圆形，一个蓝色的大三角形，一个蓝色的大圆形。在中间的盒子里，有一个蓝色的中等圆形，一个黄色的中等圆形，一个蓝色的大正方形，一个黄色的小三角形。在右边的盒子里，有一个黄色的大正方形，一个黄色的中等圆形，一个蓝色的小正方形，一个黑色的大正方形，一个黄色的中等三角形，一个蓝色的大三角形。如何将所有黑色物体移动到右边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个蓝色的小正方形，一个黄色的小正方形，一个黄色的小正方形，一个黄色的小圆形。在中间的盒子里，有一个蓝色的中等大小的正方形，一个黑色的小三角形，一个黑色的中等大小的正方形，一个黄色的大正方形。在右边的盒子里，有一个黑色的大三角形，一个黄色的小正方形，一个蓝色的中等大小的三角形，一个黑色的小正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "triangle", "small", "middle"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中等正方形、一个黄色的小三角形、一个蓝色的中等正方形和一个蓝色的中等圆形。中间的盒子里有一个黑色的中等圆形、一个黑色的大正方形和一个黑色的中等三角形。右边的盒子里有一个黄色的中等三角形、一个黄色的小三角形、一个蓝色的小正方形和一个黑色的中等圆形、一个蓝色的小正方形。如何将所有黑色物体移到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "round", "middle", "middle"], ["black", "square", "large", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个黄色的小正方形，一个蓝色的中等正方形，一个黑色的小正方形。在中间的盒子里，有一个蓝色的大三角形，一个黄色的大三角形，一个黑色的中等三角形，一个黄色的中等圆形，一个黄色的小三角形，一个蓝色的中等圆形。在右边的盒子里，有一个黑色的大三角形，一个黑色的大正方形，一个黑色的小正方形，一个蓝色的小圆形，一个蓝色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个黄色的小圆形，一个黄色的中圆形，一个蓝色的中正方形。中间的盒子里有一个黄色的中圆形，一个黄色的大圆形，一个黄色的小三角形，一个黄色的大三角形，一个黑色的中三角形，一个黑色的小圆形。右边的盒子里有一个黄色的大正方形，一个黄色的小三角形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "small", "left"], ["blue", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个蓝色的中等三角形。在中间的盒子里，有一个黑色的大圆形，一个黑色的中等正方形，一个黄色的小正方形，一个黑色的大三角形，一个黄色的中等圆形，一个黄色的中等三角形。在右边的盒子里，有一个黄色的小三角形，一个黑色的大圆形，一个黑色的大正方形，一个黑色的小圆形，一个蓝色的中等圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "large", "left"], ["black", "round", "large", "middle"], ["black", "square", "middle", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的中等三角形，一个黄色的小三角形，一个黄色的大三角形，一个黑色的中等正方形，一个蓝色的大圆形。在中间的盒子里，有一个蓝色的小圆形，一个黄色的小正方形，一个黑色的中等圆形。在右边的盒子里，有一个黄色的小正方形，一个黄色的中等圆形。如何将所有的正方形移到右边的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "middle", "left"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的大圆形和一个黄色的小圆形。中间的盒子里有一个蓝色的小正方形、一个蓝色的大三角形、一个黑色的大圆形、一个黄色的中等正方形、一个蓝色的小三角形和一个黑色的小三角形。右边的盒子里有一个黑色的大三角形和一个黄色的小正方形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "round", "large", "middle"], ["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个蓝色的小正方形、一个黑色的大正方形、一个黄色的中等正方形。在中间的盒子里，有一个黄色的大正方形、一个黄色的中等正方形、一个黑色的中等圆形、一个蓝色的中等圆形、一个黑色的小三角形、一个蓝色的小圆形。在右边的盒子里，有一个蓝色的中等圆形、一个蓝色的大圆形、一个蓝色的大三角形、一个黑色的中等正方形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "large", "left"], ["black", "round", "middle", "middle"], ["blue", "round", "middle", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个蓝色中等三角形、一个蓝色大圆形、一个蓝色中等正方形。中间的盒子里有一个黑色中等圆形、一个小黄三角形、一个小黄正方形。右边的盒子里有一个黄色中等圆形、一个黑色小圆形、一个蓝色大正方形、一个黑色中等三角形、一个黄色大三角形。如何将所有圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "left"], ["blue", "round", "large", "left"], ["yellow", "round", "middle", "right"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小三角形，一个黄色的大圆形，一个蓝色的中圆形，一个蓝色的中正方形，一个黄色的大圆形，一个黄色的小三角形。在中间的盒子里，有一个蓝色的中正方形，一个黑色的中正方形，一个蓝色的小正方形。在右边的盒子里，有一个黑色的中三角形，一个黑色的大三角形，一个黄色的小正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "square", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个黄色的大三角形、一个黑色的中三角形和一个黑色的小三角形。中间的盒子里有一个蓝色的中正方形和一个蓝色的中正方形。右边的盒子里有一个蓝色的中三角形、一个黑色的小三角形、一个蓝色的中三角形、一个蓝色的大三角形、一个黄色的小三角形和一个蓝色的中正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "right"], ["blue", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"], ["blue", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小正方形，一个蓝色的小三角形，一个黑色的中等大小正方形，一个蓝色的小圆形。中间的盒子里有一个黄色的大三角形，一个黑色的大圆形，一个黑色的小圆形。右边的盒子里有一个黑色的大正方形，一个黄色的小三角形，一个蓝色的中等大小三角形。如何将所有的正方形移到左边的盒子里？", "label": [["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大圆形、一个蓝色的大正方形、一个黑色的中等三角形、一个黄色的大正方形、一个蓝色的大圆形、一个黑色的大圆形。在中间的盒子里，有一个蓝色的小圆形、两个黑色的中等三角形、一个黄色的大正方形、一个黑色的中等圆形、一个蓝色的大三角形。在右边的盒子里，有一个黑色的小正方形、两个蓝色的小三角形、一个黑色的大圆形、一个蓝色的中等三角形、一个蓝色的小三角形、一个黄色的中等三角形。如何将所有的三角形移到右边的盒子里？", "label": [["black", "triangle", "middle", "left"], ["black", "triangle", "middle", "middle"], ["black", "triangle", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的大正方形，一个黄色的中等三角形，一个黑色的小正方形，一个黑色的小圆形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的小圆形。在右边的盒子里，有一个黑色的小三角形，一个黑色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "middle", "left"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个黑色的中等正方形和一个蓝色的中等圆形。中间的盒子里有一个蓝色的中等正方形、一个黑色的大三角形、一个黑色的小圆形和一个黑色的大三角形。右边的盒子里有一个黄色的中等正方形、一个黑色的小正方形和一个黑色的中等正方形。如何将所有黄色物品移到中间的盒子？", "label": [["yellow", "triangle", "large", "left"], ["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个大黑圆形。中间的盒子里有一个中等大小的黄色圆形，一个大黑色正方形，一个大黑色三角形，一个中等大小的黑色三角形，一个中等大小的黄色三角形。右边的盒子里有一个中等大小的黑色圆形，一个大黑色正方形，一个小黄色正方形，一个小黑色正方形，一个小黄色圆形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "square", "large", "middle"], ["black", "triangle", "large", "middle"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小正方形，一个黄色的小三角形，一个黄色的小圆形，一个蓝色的大圆形，一个黄色的小圆形，一个黑色的小正方形。在中间的盒子里，有一个黄色的小三角形，一个黑色的中等圆形，一个黄色的小圆形，一个蓝色的中等正方形，一个黄色的大圆形，一个黄色的中等正方形。在右边的盒子里，有一个蓝色的小正方形，一个黑色的大正方形，一个黑色的大圆形，一个黄色的大三角形，一个黑色的大圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "large", "left"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个小黑圆形，一个小黑圆形，一个中等黑三角形，一个蓝色大三角形。在中间的盒子里，有一个黄色大圆形，一个蓝色小圆形，一个黑色大三角形，一个蓝色大正方形，一个黄色大正方形，一个蓝色中等正方形。在右边的盒子里，有一个黄色小正方形，一个黄色大三角形，一个小黑正方形，一个小黑正方形。如何将所有三角形移动到右边的盒子里？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "middle", "left"], ["blue", "triangle", "large", "left"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个黑色的大正方形、一个蓝色的中圆形、一个黑色的大圆形、一个黑色的中圆形、一个黄色的大三角形。中间的盒子里有一个黄色的小三角形、一个黄色的大圆形、一个蓝色的小正方形、一个黄色的小圆形。右边的盒子里有一个蓝色的小三角形、一个黑色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"], ["blue", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形和一个蓝色的大三角形。中间的盒子里有一个蓝色的中等大小圆形、一个黑色的中等大小圆形、一个黑色的小圆形、一个黄色的中等大小圆形、一个黑色的小圆形和一个黑色的小正方形。右边的盒子里有一个蓝色的大三角形、一个黄色的小正方形、一个黄色的小三角形和一个黄色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["blue", "round", "middle", "middle"], ["black", "round", "middle", "middle"], ["black", "round", "small", "middle"], ["yellow", "round", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形和一个黑色的大圆形。中间的盒子里有一个黑色的中等大小的三角形和一个黄色的中等大小的正方形。右边的盒子里有一个蓝色的中等大小的正方形和一个蓝色的大圆形。如何将所有蓝色物品移动到左边的盒子？", "label": [["blue", "square", "middle", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中间正方形，一个蓝色的大圆形，一个黑色的小圆形。中间的盒子里有一个黄色的大三角形，一个黄色的大正方形。右边的盒子里有一个蓝色的小圆形，一个黄色的大三角形，一个蓝色的小正方形，一个黑色的大三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "small", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形、一个黄色的大圆形和一个黄色的中等正方形。中间的盒子里有一个黄色的中等三角形和一个黄色的大圆形。右边的盒子里有一个黑色的中等圆形和一个蓝色的中等圆形。如何将所有黄色物品移动到中间的盒子中？", "label": [["yellow", "round", "large", "left"], ["yellow", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的小正方形，一个黄色的中等正方形。在中间的盒子里，有一个蓝色的大正方形，一个黑色的大正方形，一个蓝色的中等三角形，一个蓝色的中等三角形，一个蓝色的小三角形。在右边的盒子里，有一个蓝色的小圆形，一个黑色的中等正方形，一个黄色的大三角形，一个黄色的小正方形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个黑色的大三角形、一个黄色的中等圆形、一个黑色的小圆形、一个蓝色的大圆形。在中间的盒子里，有一个蓝色的小正方形、一个蓝色的大圆形、一个蓝色的大圆形、一个蓝色的大圆形、一个黑色的中等圆形、一个蓝色的小圆形。在右边的盒子里，有一个黑色的中等正方形、一个蓝色的大圆形、一个蓝色的中等正方形、一个黄色的中等三角形、一个蓝色的小圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个蓝色的中等三角形，一个蓝色的中等三角形。在中间的盒子里，有一个黄色的小正方形，一个黑色的小正方形，一个黄色的小圆形，一个蓝色的大正方形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的小正方形，一个黄色的小正方形，一个蓝色的小三角形，一个黄色的小圆形，一个蓝色的中等三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "round", "small", "right"], ["yellow", "square", "small", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个大蓝色正方形，一个大蓝色圆形，一个大黄色三角形，一个中等蓝色三角形，一个中等蓝色圆形。在中间的盒子里，有一个中等黑色正方形，一个大蓝色三角形，一个中等黑色圆形，一个中等黑色正方形。在右边的盒子里，有一个大黑色三角形，一个中等黑色三角形，一个大蓝色正方形，一个小黑色圆形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"], ["black", "triangle", "large", "right"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个大黑色正方形，一个小黄色圆形，一个小黑色三角形。在中间的盒子里，有一个小黑色圆形，一个小黑色圆形，一个中等大小的黄色正方形，一个中等大小的黄色正方形，一个中等大小的黑色圆形，一个大黄色圆形。在右边的盒子里，有一个大黄色正方形，一个小黄色圆形，一个大黄色圆形，一个中等大小的黑色三角形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["yellow", "round", "small", "right"], ["yellow", "round", "large", "right"], ["yellow", "square", "middle", "middle"], ["yellow", "square", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，两个蓝色的小圆形，一个蓝色的大三角形，一个黑色的大正方形。在中间的盒子里，有一个黑色的小正方形，一个黑色的大正方形，一个黄色的大圆形。在右边的盒子里，有一个黑色的大圆形，一个蓝色的小正方形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "large", "right"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个黑色的中等正方形，一个蓝色的小三角形，一个黄色的小圆形，一个蓝色的大三角形。在中间的盒子里，有一个黄色的中等正方形，一个蓝色的小三角形。在右边的盒子里，有一个黑色的大三角形，一个蓝色的小正方形，一个蓝色的小圆形，一个黄色的大三角形，一个黄色的中等圆形，一个蓝色的大圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "triangle", "large", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的中等圆形，一个蓝色的小圆形。在中间的盒子里，有一个蓝色的小圆形，一个黄色的大圆形，一个蓝色的小圆形，一个黑色的小正方形，一个蓝色的中等圆形，一个黄色的中等正方形。在右边的盒子里，有一个蓝色的中等圆形，一个黄色的中等正方形，一个黑色的小圆形，一个蓝色的中等三角形，一个蓝色的小三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "middle", "left"], ["black", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个蓝色的中等圆形，一个黄色的小圆形，一个黄色的小正方形，一个黄色的大正方形，一个黑色的小正方形。在中间的盒子里，有一个黄色的大正方形，一个黄色的大三角形。在右边的盒子里，有一个黄色的小三角形，一个黄色的大三角形，一个蓝色的中等三角形，一个黄色的中等圆形，一个黄色的大三角形，一个黑色的大三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个蓝色的中号三角形和一个蓝色的大正方形。中间的盒子里有一个黑色的大正方形、一个蓝色的小圆形、一个黄色的中号圆形和一个蓝色的小三角形。右边的盒子里有一个黄色的大圆形、一个蓝色的小正方形和一个黄色的中号三角形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "middle", "left"], ["blue", "round", "small", "middle"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的大正方形，一个黄色的大三角形，一个黑色的中等三角形，一个黄色的大正方形，一个蓝色的中等正方形，一个黄色的大圆形。在右边的盒子里，有一个蓝色的小正方形，一个黄色的中等圆形，一个黄色的大圆形，一个蓝色的中等三角形，一个黑色的大圆形，一个黄色的大三角形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["yellow", "square", "large", "middle"], ["yellow", "square", "large", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黑色的中等圆形，一个蓝色的大正方形，一个黑色的大三角形。中间的盒子里有一个黑色的小正方形，一个蓝色的大正方形，一个蓝色的中等正方形。右边的盒子里有一个黑色的中等三角形，一个黑色的大圆形。如何将所有正方形移动到中间的盒子中？", "label": [["blue", "square", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等三角形，一个黑色的中等圆形，一个蓝色的中等圆形，一个黄色的小正方形，一个黑色的小正方形，一个黑色的中等正方形。在中间的盒子里，有一个黑色的小正方形，一个黑色的中等圆形，一个黑色的中等正方形，一个蓝色的中等圆形，一个黑色的大三角形。在右边的盒子里，有两个黄色的小正方形，一个黄色的中等圆形，一个蓝色的中等正方形，一个黄色的中等圆形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的小正方形，一个黄色的小三角形，一个蓝色的中等三角形，一个蓝色的中等三角形，一个黄色的大圆形。在中间的盒子里，有一个黑色的大正方形，一个黑色的中等圆形，一个黄色的小三角形，一个黑色的小正方形，一个黑色的小圆形。在右边的盒子里，有一个黄色的中等正方形，一个蓝色的大三角形，一个黄色的中等正方形，一个蓝色的大圆形，一个黄色的小圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "round", "large", "left"], ["yellow", "square", "middle", "right"], ["yellow", "square", "middle", "right"], ["yellow", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的小正方形，一个黄色的大三角形，一个黑色的小正方形，一个蓝色的小正方形。在中间的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个黑色的中号圆形，一个蓝色的中号圆形，一个黑色的小三角形。在右边的盒子里，有一个蓝色的大正方形，一个黑色的小圆形，两个黑色的中号圆形，一个黑色的小三角形，一个黑色的中号三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形，一个蓝色的中等圆形，一个黄色的大三角形，一个蓝色的中等三角形，一个黄色的大圆形，一个黄色的小圆形。中间的盒子里有一个黑色的小圆形，一个蓝色的中等正方形，一个黄色的中等正方形。右边的盒子里有一个黄色的小三角形，一个蓝色的小圆形，一个蓝色的大圆形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的小三角形、一个黑色的小正方形和一个黄色的小正方形。中间的盒子里有一个黄色的中等三角形和一个黄色的小圆形。右边的盒子里有一个黄色的中等三角形、一个蓝色的大圆形、一个黑色的小正方形、一个黄色的小三角形、一个黑色的中等正方形和一个蓝色的中等三角形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "round", "large", "right"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个黄色中圆形，一个黑色中三角形，一个黑色中三角形，一个蓝色大三角形。在中间的盒子里，有一个蓝色中圆形，一个黑色中正方形，一个小黄色正方形，一个蓝色大圆形。在右边的盒子里，有一个蓝色小正方形，一个黄色中三角形，一个蓝色中圆形，一个蓝色大正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "triangle", "middle", "right"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等正方形和一个黄色的小三角形。中间的盒子里有一个蓝色的大圆形、一个蓝色的中等三角形和一个黄色的小三角形。右边的盒子里有一个蓝色的小圆形、一个蓝色的中等圆形、一个蓝色的中等正方形和一个黑色的小正方形。如何将所有的圆形移到中间的盒子里？ \n\n您好，我是一名有用的助手。", "label": [["blue", "round", "small", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形，一个黑色的中等正方形，一个蓝色的小圆形，一个蓝色的大正方形，一个黑色的小圆形，一个黑色的大圆形。在中间的盒子里，有一个蓝色的小三角形，一个黄色的小正方形，两个蓝色的中等圆形。在右边的盒子里，有一个蓝色的大三角形，一个黑色的大三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "round", "large", "left"], ["black", "square", "middle", "left"], ["black", "round", "small", "left"], ["black", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形，一个黄色的中等正方形，一个黑色的小正方形。中间的盒子里有一个黑色的小正方形，一个黑色的小圆形，一个黑色的大三角形，一个黑色的中等正方形，一个黄色的中等圆形。右边的盒子里有一个蓝色的中等三角形，一个黑色的小正方形，一个黄色的中等三角形，一个黄色的小正方形，一个黑色的中等圆形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "square", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形，一个大黑色圆形。中间的盒子里有一个蓝色大圆形，一个黄色大三角形。右边的盒子里有一个黑色大正方形，一个小黄色三角形，一个黑色大正方形。如何将所有黄色物体移动到左边的盒子中？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黄色的中等三角形和一个黄色的小圆形。中间的盒子里有一个黑色的大三角形和一个黄色的小圆形。右边的盒子里有一个黑色的大正方形、一个蓝色的中等三角形、一个蓝色的大圆形和一个黄色的大圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的小圆形，一个黑色的大正方形，一个蓝色的大三角形，一个蓝色的中等三角形，一个黑色的中等圆形。在中间的盒子里，有一个蓝色的小正方形，一个蓝色的中等正方形，一个黄色的大正方形，一个蓝色的中等圆形，一个黑色的大三角形。在右边的盒子里，有一个黑色的小三角形，一个黄色的大正方形，一个蓝色的小三角形，一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的小圆形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "large", "right"], ["blue", "square", "large", "right"], ["blue", "square", "small", "middle"], ["blue", "square", "middle", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形、一个黄色的中圆形、一个黑色的中方形、一个黑色的小三角形和一个黑色的大方形。在中间的盒子里，有一个蓝色的中圆形、一个黄色的大方形、一个蓝色的大圆形、一个黄色的小圆形、一个蓝色的大方形和一个黑色的大方形。在右边的盒子里，有一个黑色的大圆形、一个蓝色的小圆形、一个黄色的中圆形、一个蓝色的小圆形、一个黑色的中方形和一个蓝色的小圆形。如何将所有的方形移到右边的盒子里？", "label": [["black", "square", "middle", "left"], ["black", "square", "large", "left"], ["yellow", "square", "large", "middle"], ["blue", "square", "large", "middle"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小圆形，一个黑色的中等三角形，一个蓝色的中等圆形，一个黑色的大三角形，一个黄色的中等圆形，一个黑色的中等三角形。在中间的盒子里，有一个蓝色的小正方形，一个蓝色的大圆形，一个黄色的大三角形。在右边的盒子里，有一个蓝色的小圆形，一个黄色的中等圆形，一个蓝色的大正方形，一个黄色的中等正方形，一个蓝色的大圆形。如何将所有的圆形移到中间的盒子里？", "label": [["blue", "round", "small", "left"], ["blue", "round", "middle", "left"], ["yellow", "round", "middle", "left"], ["blue", "round", "small", "right"], ["yellow", "round", "middle", "right"], ["blue", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个黄色的小圆形。中间的盒子里有一个黄色的中等大小的三角形，一个黑色的小圆形，一个黑色的小圆形。右边的盒子里有一个蓝色的小圆形，一个黑色的大正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黑色的中等正方形、一个黑色的小正方形、一个黑色的大三角形。中间的盒子里有一个黄色的中等三角形、一个黑色的大正方形。右边的盒子里有一个黑色的大三角形、一个黑色的小三角形、一个蓝色的小三角形、一个黄色的大三角形、一个黄色的大圆形、一个黑色的中等正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "large", "left"], ["yellow", "triangle", "large", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形，一个黑色的小三角形，一个黑色的中圆形，一个蓝色的小圆形，一个黑色的小圆形，一个黑色的中三角形。在中间的盒子里，有一个蓝色的中正方形，一个黑色的大圆形，一个黄色的小圆形，一个黄色的小三角形，一个黑色的大三角形，一个蓝色的小三角形。在右边的盒子里，有一个蓝色的小正方形，一个黄色的大正方形，一个黄色的小圆形，一个蓝色的中圆形，一个黑色的大三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "square", "small", "right"], ["blue", "round", "middle", "right"], ["blue", "square", "middle", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黑色的小圆形，一个蓝色的大正方形，一个蓝色的中等三角形，一个黄色的大正方形。在中间的盒子里，有一个黑色的中等三角形，一个蓝色的小三角形，一个蓝色的小圆形，一个黑色的小正方形。在右边的盒子里，有一个黄色的中等正方形，一个蓝色的大三角形，一个黑色的小三角形，一个黑色的中等圆形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "round", "small", "left"], ["black", "triangle", "small", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑三角形，一个小黑正方形，一个小黑三角形，一个小蓝三角形，一个黄色中等三角形，一个黄色大正方形。在中间的盒子里，有一个黄色大圆形，一个小蓝圆形。在右边的盒子里，有一个黄色中等三角形，一个蓝色中等正方形，一个黄色小圆形，一个黄色小正方形，一个蓝色大圆形。如何将所有三角形移动到中间的盒子？", "label": [["black", "triangle", "small", "left"], ["black", "triangle", "small", "left"], ["blue", "triangle", "small", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形、一个黄色的小圆形、一个蓝色的大正方形。中间的盒子里有一个黑色的中等大小的正方形、一个黄色的小三角形。右边的盒子里有一个黑色的中等大小的三角形、一个黄色的中等大小的正方形、一个蓝色的中等大小的三角形。如何将所有的正方形移到左边的盒子里？", "label": [["yellow", "square", "middle", "right"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个大黄色圆形、一个中等黄色三角形和一个中等黑色三角形。中间的盒子里有一个大黑色正方形、一个小黄色三角形和一个大黄色圆形。右边的盒子里有一个中等黄色三角形、一个大黄色圆形、一个大黄色三角形、一个小黑色三角形和一个小蓝色三角形，还有一个大蓝色正方形。如何将所有正方形移到左边的盒子里？", "label": [["blue", "square", "large", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形和一个黑色的大三角形。中间的盒子里有一个蓝色的中等三角形、一个黑色的中等圆形、一个黄色的小三角形和一个蓝色的小三角形。右边的盒子里有一个蓝色的中等圆形、一个黑色的小正方形和一个黄色的小正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "middle"], ["yellow", "triangle", "small", "middle"], ["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形，一个蓝色的中间圆形，一个黑色的中间三角形。中间的盒子里有一个黄色的大三角形，一个蓝色的大三角形。右边的盒子里有一个蓝色的小三角形，一个黑色的中间圆形，一个蓝色的大圆形，一个黄色的小正方形，一个黄色的中间正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的大正方形和一个蓝色的中等大小的圆形。中间的盒子里有一个黄色的小三角形、一个黑色的小正方形和一个黄色的大三角形。右边的盒子里有一个黑色的小圆形、一个黄色的中等大小的圆形、一个黑色的中等大小的正方形、一个黄色的小三角形、一个黄色的大圆形和一个蓝色的大正方形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "right"], ["yellow", "round", "middle", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中间正方形，一个蓝色的中间正方形，一个黑色的小圆形，一个蓝色的小三角形，一个蓝色的大圆形，一个蓝色的中间三角形。中间的盒子里有一个黄色的小圆形，一个黄色的中间正方形，一个蓝色的大正方形，一个黄色的小三角形。右边的盒子里有一个蓝色的大正方形，一个蓝色的中间三角形，一个黑色的中间正方形。如何将所有黄色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大三角形，一个蓝色的大三角形，一个蓝色的大三角形，一个黑色的中等三角形，一个蓝色的中等圆形。在中间的盒子里，有一个蓝色的中等圆形，一个蓝色的中等圆形，一个蓝色的大圆形，一个蓝色的大圆形，一个黑色的中等三角形，一个黑色的中等三角形。在右边的盒子里，有一个黄色的小圆形，一个黄色的中等正方形，一个黑色的大正方形，一个黄色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["black", "square", "large", "right"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小圆形、一个蓝色的大正方形、一个蓝色的小正方形和一个黄色的中等三角形。中间的盒子里有一个黑色的中等三角形、一个黄色的小圆形和一个黄色的小三角形。右边的盒子里有一个黑色的小三角形、一个黄色的中等正方形、一个黑色的大正方形和一个蓝色的大圆形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "square", "large", "left"], ["blue", "square", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个黄色中等正方形，一个蓝色中等三角形，一个小黑色圆形，一个黄色中等正方形，一个小黑色正方形。在中间的盒子里，有一个大黑色正方形，一个黄色中等圆形，一个大黑色圆形，一个大黑色三角形，一个蓝色小圆形。在右边的盒子里，有一个大黑色圆形，一个黄色中等圆形，一个大黑色圆形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "square", "middle", "left"], ["yellow", "square", "middle", "left"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆、一个小蓝圆、一个中黄圆、一个小黑方。中间的盒子里有一个大蓝方、一个中黑方、一个中蓝圆、一个大黑方、一个中黑方。右边的盒子里有一个小黄圆、一个小黄方。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形和一个黑色的中等三角形。在中间的盒子里，有一个黑色的大圆形、一个蓝色的中等正方形和一个黑色的中等圆形。在右边的盒子里，有一个黑色的大三角形、一个黄色的大三角形、一个黄色的大圆形和一个蓝色的中等正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的中等三角形，一个黑色的大正方形，一个黄色的大正方形。在中间的盒子里，有一个黑色的大三角形，一个黄色的小三角形，一个黄色的中等圆形，一个蓝色的中等三角形，一个蓝色的大正方形，一个黑色的大圆形。在右边的盒子里，有一个黄色的小圆形，一个黄色的大圆形，一个黄色的中等三角形，一个黑色的中等三角形，一个黄色的大三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "right"], ["yellow", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形、一个蓝色的大三角形和一个蓝色的中等正方形。中间的盒子里有一个蓝色的小三角形、一个黑色的小三角形、一个黑色的小正方形和一个黑色的大正方形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的小圆形、一个黄色的小三角形和一个黄色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个黄色的小三角形，一个黑色的小三角形，一个黄色的大圆形，一个黑色的中圆形。中间的盒子里有一个黄色的小圆形，一个蓝色的大三角形，一个黑色的中正方形，一个黑色的大三角形。右边的盒子里有一个黑色的中圆形，一个黑色的中正方形，两个黄色的小圆形，一个黑色的大正方形。如何将所有的三角形移到右边的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["black", "triangle", "small", "left"], ["blue", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个黑色的大圆形，一个黄色的小圆形。中间的盒子里有一个黄色的小正方形，一个蓝色的大圆形。右边的盒子里有一个黄色的中等大小的正方形，一个黄色的中等大小的圆形，一个黑色的中等大小的圆形，一个黑色的小正方形。如何将所有蓝色的物品移到右边的盒子？", "label": [["blue", "triangle", "small", "left"], ["blue", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中圆形、一个蓝色的大三角形和一个黑色的中圆形。中间的盒子里有一个黄色的小圆形、一个黄色的大三角形、一个黄色的小三角形、一个黄色的中正方形、一个蓝色的大圆形和一个黑色的小圆形。右边的盒子里有一个蓝色的中正方形和一个黄色的中三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "left"], ["yellow", "triangle", "large", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中圆形、一个黄色的大圆形、一个黑色的小圆形、一个蓝色的小三角形、一个蓝色的大圆形和一个黑色的小圆形。中间的盒子里有一个黄色的小圆形、一个黑色的大正方形、一个黄色的小圆形和一个黑色的大正方形。右边的盒子里有一个黄色的小正方形、一个黑色的中三角形、一个蓝色的小三角形、一个蓝色的中圆形、一个黑色的大三角形和一个黄色的中圆形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "round", "large", "left"], ["yellow", "square", "small", "right"], ["yellow", "round", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形和一个蓝色的大圆形。中间的盒子里有一个蓝色的中等大小的正方形和一个黄色的小正方形。右边的盒子里有一个黑色的小圆形、一个黑色的中等大小的圆形和一个黄色的中等大小的圆形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个蓝色的小三角形，一个黑色的小圆形。在中间的盒子里，有一个黄色的小正方形，一个黄色的小圆形，一个蓝色的中等三角形，一个黑色的大正方形，一个黑色的中等圆形。在右边的盒子里，有一个黄色的大正方形，一个蓝色的大正方形，一个黑色的中等三角形，一个黄色的中等三角形，一个黑色的小圆形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "square", "large", "left"], ["yellow", "square", "small", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的大三角形，一个黑色的大正方形，一个蓝色的小圆形，一个蓝色的中等三角形，一个黑色的大三角形。在中间的盒子里，有一个蓝色的大三角形，一个黄色的小三角形，一个黄色的大圆形。在右边的盒子里，有一个黄色的中等三角形，一个黄色的小三角形，一个蓝色的中等圆形，一个黄色的中等正方形，一个蓝色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["yellow", "square", "middle", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形，一个黑色的小圆形，一个蓝色的大圆形。中间的盒子里有一个黑色的大圆形，一个蓝色的中等大小的三角形，一个黄色的大正方形。右边的盒子里有一个蓝色的中等大小的圆形，一个黄色的小三角形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "round", "small", "left"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小圆形，一个蓝色的小三角形。在中间的盒子里，有一个黄色的大圆形，一个蓝色的小圆形，一个蓝色的大正方形，一个黄色的大正方形，一个黑色的小三角形，一个黄色的中等大小的正方形。在右边的盒子里，有一个黄色的中等大小的圆形，一个黑色的中等大小的正方形，一个黄色的小正方形，一个蓝色的大三角形，一个黑色的小三角形，一个黑色的中等大小的圆形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "triangle", "small", "left"], ["blue", "round", "small", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色正方形、一个中黄色正方形、一个小蓝色正方形、一个黑色中圆形和一个中黄色正方形。中间的盒子里有一个蓝色中圆形、一个蓝色中三角形、一个黑色大三角形和一个小蓝色正方形。右边的盒子里有一个黄色中正方形、一个黑色中三角形和一个蓝色大正方形。如何将所有正方形移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "middle", "left"], ["blue", "square", "small", "left"], ["yellow", "square", "middle", "left"], ["yellow", "square", "middle", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形、一个黄色的中圆形、一个蓝色的小正方形、一个黑色的小正方形和一个黑色的大正方形。中间的盒子里有一个黑色的中等三角形、一个蓝色的大三角形、一个黄色的小三角形和一个蓝色的小三角形。右边的盒子里有一个黄色的大圆形、一个黑色的大正方形、一个黑色的中等三角形、一个黄色的中等三角形和一个蓝色的大正方形。如何将所有正方形移到右边的盒子里？", "label": [["blue", "square", "small", "left"], ["black", "square", "small", "left"], ["black", "square", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形和一个黑色的小圆形。中间的盒子里有一个黄色的中等三角形、一个黄色的中等圆形、一个黄色的大圆形和一个蓝色的小正方形。右边的盒子里有一个黑色的中等三角形和一个黄色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["yellow", "round", "middle", "middle"], ["yellow", "round", "large", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小正方形，一个蓝色的中等三角形，一个黑色的小圆形。中间的盒子里有一个蓝色的大三角形，一个黄色的小圆形。右边的盒子里有一个蓝色的小圆形，一个蓝色的小圆形，一个黄色的小正方形，一个蓝色的小正方形，一个蓝色的中等三角形，一个黄色的中等正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "small", "right"], ["yellow", "square", "middle", "right"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黄色的中等三角形和一个蓝色的小正方形。中间的盒子里有一个黄色的小正方形、一个蓝色的小圆形、一个蓝色的中等圆形和一个蓝色的小圆形。右边的盒子里有一个黄色的大正方形、一个黄色的小圆形和一个蓝色的小正方形。如何将所有黑色物体移到右边的盒子中？", "label": [["black", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的大三角形、一个蓝色的中等正方形、一个蓝色的中等圆形和一个黄色的大圆形。中间的盒子里有一个黄色的大三角形和一个黑色的小正方形。右边的盒子里有一个黑色的中等正方形、一个蓝色的大正方形、一个黄色的小三角形、一个黄色的大三角形和一个蓝色的大圆形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "small", "right"], ["yellow", "triangle", "large", "right"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个黑色的大正方形、一个蓝色的小正方形。中间的盒子里有一个黄色的大圆形、一个黄色的小三角形、一个蓝色的大圆形。右边的盒子里有一个黑色的小正方形、一个黄色的中等大小的圆形、一个黑色的中等大小的圆形、一个蓝色的小三角形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "round", "middle", "right"], ["yellow", "round", "large", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个大黄色圆形、一个中黄色圆形、一个蓝色小三角形。中间的盒子里有一个中黄色三角形、一个大黄色圆形。右边的盒子里有一个大黄色圆形、一个大黄色圆形、一个小黄色三角形、一个中黄色正方形。如何将所有黄色物品移到右边的盒子中？", "label": [["yellow", "round", "large", "left"], ["yellow", "round", "middle", "left"], ["yellow", "triangle", "middle", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个黄色的大正方形。中间的盒子里有一个黑色的中等大小的正方形和一个黄色的中等大小的正方形。右边的盒子里有一个蓝色的小三角形、一个蓝色的小三角形和一个黄色的小圆形。如何将所有的小圆形移到右边的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的小圆形，一个黑色的大圆形，一个黄色的小圆形，一个黑色的小正方形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的中等正方形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的大正方形，一个黄色的小圆形，一个蓝色的小正方形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "round", "small", "right"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形，一个蓝色的大三角形和一个黑色的大三角形。中间的盒子里有一个黑色的小圆形和一个黑色的小正方形。右边的盒子里有一个黑色的中等三角形，一个蓝色的中等圆形，一个黄色的大正方形，一个黑色的小正方形和一个蓝色的大圆形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"], ["blue", "triangle", "large", "left"], ["black", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的大圆形和一个黄色的大三角形。中间的盒子里有一个蓝色的中等大小的三角形、一个黄色的小圆形和一个蓝色的大圆形。右边的盒子里有一个蓝色的小圆形和一个黑色的中等大小的圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["yellow", "triangle", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个黑色的大圆形、一个蓝色的小三角形、一个黄色的中等三角形、一个蓝色的小圆形、一个蓝色的大三角形。中间的盒子里有一个黑色的小正方形、一个黑色的小圆形、一个蓝色的中等圆形、一个黑色的小圆形。右边的盒子里有一个黑色的中等三角形、一个黄色的中等三角形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "middle"], ["blue", "round", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个蓝色的小圆形。中间的盒子里有一个黄色的小正方形、一个黄色的中圆形、一个蓝色的大三角形和一个黑色的小正方形。右边的盒子里有一个蓝色的大正方形、一个黄色的大正方形和一个黑色的中圆形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "large", "left"], ["blue", "round", "small", "left"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中间正方形和一个蓝色的中间正方形。中间的盒子里有一个蓝色的中间圆形和一个黑色的小圆形。右边的盒子里有一个黑色的中间圆形、一个黄色的小圆形、一个蓝色的大三角形、一个黄色的中间正方形、一个蓝色的小圆形和一个蓝色的小正方形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "right"], ["yellow", "round", "small", "right"], ["blue", "round", "small", "right"], ["blue", "round", "middle", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黄色的小三角形、一个黄色的大三角形和一个黄色的中等三角形。中间的盒子里有一个黄色的小正方形和一个黄色的小三角形。右边的盒子里有一个蓝色的大正方形、一个黑色的小圆形、一个黄色的中等圆形和一个蓝色的小三角形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "small", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形和一个黑色的大圆形。中间的盒子里有一个黄色的大正方形和一个蓝色的中等大小的圆形。右边的盒子里有一个黑色的大圆形和一个蓝色的小圆形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄三角形，一个小黄圆形。中间的盒子里有一个小黑三角形，一个大黄正方形，一个中等黑三角形。右边的盒子里有一个大黑正方形，一个大黄正方形，一个大黑正方形，一个中等黑正方形，一个大黑三角形。如何将所有正方形移动到中间的盒子？", "label": [["black", "square", "large", "right"], ["yellow", "square", "large", "right"], ["black", "square", "large", "right"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等三角形，一个蓝色的小正方形，一个黄色的小圆形，一个黄色的大圆形，一个蓝色的中等正方形。在中间的盒子里，有一个蓝色的中等圆形，一个黑色的小圆形，一个黄色的大正方形，一个蓝色的大三角形，一个蓝色的小三角形，一个蓝色的中等三角形。在右边的盒子里，有一个黑色的中等正方形，一个蓝色的大三角形，一个黑色的小三角形，一个蓝色的小三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形和一个蓝色的小三角形。中间的盒子里有一个黑色的大圆形和一个蓝色的中等大小的三角形。右边的盒子里有一个黑色的大正方形、两个蓝色的大三角形、一个黑色的大圆形和一个黑色的中等大小的圆形。如何将所有蓝色物品移到左边的盒子里？", "label": [["blue", "triangle", "large", "right"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形和一个黑色的小圆形。中间的盒子里有一个黑色的中等正方形、一个黄色的小圆形、一个黑色的小圆形和一个黄色的中等三角形。右边的盒子里有一个黄色的中等圆形、一个黑色的大圆形、一个黄色的小正方形、一个蓝色的大三角形和一个蓝色的小三角形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "small", "left"], ["yellow", "round", "small", "middle"], ["black", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的小三角形，一个蓝色的中等正方形，一个黑色的小正方形，一个蓝色的中等正方形，一个黄色的大三角形。在中间的盒子里，有一个黑色的大圆形，一个蓝色的大三角形，一个黄色的中等圆形。在右边的盒子里，有一个黑色的大圆形，一个黄色的大三角形。如何将所有的三角形移到左边的盒子里？\n\n将上述文本翻译成中文。", "label": [["yellow", "triangle", "large", "right"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个蓝色的小正方形，一个黑色的中等三角形，一个黑色的小三角形。在中间的盒子里，有一个蓝色的大三角形，一个黑色的小圆形，一个蓝色的中等三角形，一个黑色的大正方形，一个蓝色的大正方形。在右边的盒子里，有一个蓝色的小正方形，一个黄色的小三角形，一个黄色的中等圆形。如何将所有黄色物品移到右边的盒子中？", "label": []}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个蓝色的小三角形。中间的盒子里有一个蓝色的小三角形和一个黄色的中等大小的正方形。右边的盒子里有一个蓝色的中等大小的正方形和一个黄色的大正方形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个蓝色大正方形、一个蓝色小三角形。中间的盒子里有一个中等大小的黄色圆形、一个黑色中等大小的正方形、一个黑色大三角形。右边的盒子里有一个黑色中等大小的正方形、一个黄色大三角形、一个蓝色大圆形、一个黄色中等大小的三角形、一个黑色中等大小的三角形、一个蓝色小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "left"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中号圆形、一个黑色的小三角形、一个黄色的小三角形和一个蓝色的大三角形。中间的盒子里有一个蓝色的大正方形、一个黄色的中号三角形、一个蓝色的中号正方形和一个黄色的小正方形。右边的盒子里有一个黑色的大圆形和两个黄色的大正方形。如何将所有黄色物品移到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形、一个黑色的大三角形、一个黑色的小正方形和一个黑色的大正方形。中间的盒子里有一个黑色的中等圆形、两个黑色的中等正方形。右边的盒子里有一个黑色的大圆形和一个蓝色的中等圆形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "middle", "left"], ["black", "round", "large", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黄色的小圆形，一个黄色的中等圆形，一个黄色的大正方形，一个黑色的小圆形，一个黑色的大正方形。在中间的盒子里，有一个黄色的大三角形，一个黄色的大圆形，一个黄色的大三角形。在右边的盒子里，有一个黑色的大圆形，一个黄色的小正方形，一个黑色的中等三角形，一个黄色的小正方形，一个黄色的中等三角形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "large", "right"], ["black", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的小三角形，一个蓝色的中等圆形，一个黑色的小三角形，一个黄色的小三角形，一个蓝色的大三角形，一个黄色的大圆形。在中间的盒子里，有一个黄色的中等三角形，一个蓝色的中等圆形，一个蓝色的小圆形，一个蓝色的大三角形，一个黄色的小三角形。在右边的盒子里，有一个黑色的中等三角形，一个黑色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大正方形、一个黑色的中等正方形和一个黄色的小圆形。中间的盒子里有一个黄色的中等正方形和一个黑色的小三角形。右边的盒子里有一个黑色的大圆形、一个蓝色的中等正方形、一个蓝色的小圆形和一个蓝色的中等三角形。如何将所有蓝色物品移到右边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中号圆形、一个黑色的大正方形、一个黑色的小圆形、一个蓝色的小正方形、一个黄色的中号圆形。在中间的盒子里，有一个黑色的大三角形、一个黑色的中号正方形、一个蓝色的中号正方形、一个蓝色的大正方形、一个黑色的小圆形。在右边的盒子里，有一个蓝色的大正方形、一个蓝色的小正方形、一个黑色的小正方形、一个蓝色的大圆形。如何将所有的正方形移到左边的盒子里？", "label": [["blue", "square", "large", "right"], ["blue", "square", "small", "right"], ["black", "square", "small", "right"], ["black", "square", "middle", "middle"], ["blue", "square", "middle", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个蓝色的小三角形、一个黄色的大正方形、一个蓝色的中等三角形、一个黄色的大圆形和一个黄色的中等正方形。中间的盒子里有一个黄色的小圆形、一个黄色的大三角形和一个黑色的小圆形。右边的盒子里有一个蓝色的大圆形和一个蓝色的大三角形。如何将所有黄色物品移到左边的盒子中？", "label": [["yellow", "round", "small", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小三角形、一个蓝色的小圆形和一个黄色的小三角形。中间的盒子里有一个蓝色的小正方形、一个黑色的中等正方形和一个黑色的小正方形。右边的盒子里有一个黑色的大三角形、一个蓝色的小圆形、一个黄色的中等三角形和一个蓝色的大圆形、一个黄色的大三角形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "middle", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大圆形和一个黑色的小正方形。中间的盒子里有一个黄色的大圆形、一个黑色的小正方形、一个蓝色的小圆形、一个黄色的大圆形和一个黄色的小正方形。右边的盒子里有一个蓝色的中等三角形和一个黄色的中等圆形。如何将所有的正方形移动到左边的盒子中？", "label": [["black", "square", "small", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等大小的正方形，一个黄色的大正方形，一个黑色的中等大小的圆形。中间的盒子里有一个黄色的大三角形，一个黄色的中等大小的正方形，一个蓝色的大圆形，一个黄色的小正方形，一个黑色的小圆形。右边的盒子里有一个黑色的大正方形，一个黄色的小圆形，一个黄色的大正方形，一个黄色的小三角形。如何将所有黄色物品移动到左边的盒子中？", "label": [["yellow", "round", "small", "right"], ["yellow", "square", "large", "right"], ["yellow", "triangle", "small", "right"], ["yellow", "triangle", "large", "middle"], ["yellow", "square", "middle", "middle"], ["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形和一个黑色的大圆形。中间的盒子里有一个黑色的大正方形和一个蓝色的小三角形。右边的盒子里有一个蓝色的大三角形、一个黑色的大三角形和一个黑色的大圆形。如何将所有的圆形移到中间的盒子里？请将以上文本翻译成中文。", "label": [["black", "round", "large", "left"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形、一个蓝色的中间三角形、一个黑色的小正方形、一个黑色的中间圆形和一个黑色的大正方形。在中间的盒子里，有一个黄色的小正方形、一个黑色的小正方形、一个蓝色的中间正方形、一个黄色的大三角形和一个黄色的小三角形。在右边的盒子里，有一个黑色的小圆形、一个黄色的中间正方形、一个黑色的中间正方形和一个黑色的大圆形。如何将所有黄色物品移动到中间的盒子中？", "label": [["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个中黑色正方形，一个小蓝色正方形，一个小黑色圆形，一个小黑色圆形，一个中黄色圆形。在中间的盒子里，有一个中黄色三角形，一个大黄色三角形，一个大黄色圆形，一个中蓝色三角形，一个中黄色三角形，一个中蓝色三角形。在右边的盒子里，有一个大黑色三角形，一个小黄色圆形，一个小蓝色圆形，一个大黑色三角形，一个大蓝色圆形，一个大黑色圆形。如何将所有黑色物品移动到左边的盒子？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "large", "right"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的中等三角形，一个蓝色的小正方形，一个黑色的大三角形，一个黄色的中等正方形，一个黑色的小三角形。在中间的盒子里，有一个黑色的中等三角形，一个黑色的大正方形。在右边的盒子里，有一个黑色的中等圆形，一个蓝色的大三角形，一个黑色的中等正方形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "square", "middle", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的中等正方形，一个黑色的大三角形，一个蓝色的小正方形，一个蓝色的中等圆形，一个黄色的小正方形，一个黑色的小三角形。在中间的盒子里，有一个黑色的中等圆形，一个黑色的中等三角形，一个蓝色的大圆形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的小圆形，一个黑色的中等正方形，一个黑色的小正方形，一个黄色的小三角形，一个蓝色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "square", "middle", "left"], ["blue", "square", "small", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "small", "right"], ["blue", "square", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等圆形、一个蓝色的大三角形、一个黄色的小三角形、一个蓝色的中等三角形、一个黑色的中等正方形、一个黄色的小三角形。在中间的盒子里，有一个蓝色的小三角形、一个黑色的大三角形、一个黑色的大正方形、一个黑色的大圆形。在右边的盒子里，有一个蓝色的小正方形、一个黄色的中等三角形、一个黄色的中等圆形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "large", "left"], ["blue", "triangle", "middle", "left"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黄色的大正方形和一个蓝色的中等正方形。中间的盒子里有一个蓝色的小三角形和一个黄色的大正方形。右边的盒子里有一个黑色的大三角形、一个黑色的大三角形和一个蓝色的小正方形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "right"], ["black", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中号圆形、一个黄色的大正方形、一个黑色的小圆形、一个黑色的小正方形、一个黄色的中号三角形、一个黑色的大圆形。在中间的盒子里，有一个黄色的中号正方形、一个黑色的中号三角形、一个黄色的小圆形。在右边的盒子里，有一个黄色的小正方形、一个黄色的大正方形、一个黑色的中号正方形、一个黄色的小正方形、一个黑色的中号圆形。如何将所有黄色物品移动到中间的盒子里？", "label": [["yellow", "square", "large", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "square", "small", "right"], ["yellow", "square", "large", "right"], ["yellow", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大正方形和一个黑色的中等正方形。中间的盒子里有一个黄色的中等正方形、一个蓝色的小三角形、一个蓝色的中等圆形和一个黑色的大正方形。右边的盒子里有一个黄色的中等正方形、一个蓝色的中等正方形和一个蓝色的大圆形。如何将所有黄色物体移动到中间的盒子？", "label": [["yellow", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小圆形、一个黄色的大三角形、一个黑色的小圆形。中间的盒子里有一个蓝色的中等大小的正方形、一个黑色的小正方形、一个黑色的中等大小的正方形。右边的盒子里有一个蓝色的小圆形、一个蓝色的中等大小的圆形、一个黑色的小圆形。如何将所有蓝色物品移到右边的盒子？", "label": [["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大正方形，一个黄色的大三角形，一个黑色的大圆形。在中间的盒子里，有一个黑色的大圆形，一个蓝色的中等大小的正方形，一个蓝色的小圆形，一个黄色的小正方形，一个黄色的大正方形，一个黑色的中等大小的圆形。在右边的盒子里，有一个黑色的中等大小的三角形，一个黑色的中等大小的三角形，一个蓝色的大正方形，一个黑色的小正方形，一个黄色的中等大小的圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["black", "round", "large", "middle"], ["blue", "round", "small", "middle"], ["black", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黄色的中等三角形，一个黄色的小正方形。在中间的盒子里，有一个黑色的大正方形，一个蓝色的大三角形，一个蓝色的大圆形，一个黑色的中等三角形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的中等圆形，一个黄色的小正方形，一个黑色的中等圆形，一个蓝色的中等正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "square", "large", "middle"], ["black", "triangle", "middle", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小圆形、一个黑色的中圆形和一个黄色的中方形。中间的盒子里有一个蓝色的中三角形、一个黑色的小方形和一个黑色的小圆形。右边的盒子里有一个黑色的小方形和一个黄色的小三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的小三角形和一个黄色的大三角形。中间的盒子里有一个黄色的中等大小的三角形、一个黑色的小正方形和一个黑色的大圆形。右边的盒子里有一个黑色的小三角形和一个黄色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "small", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形和一个黑色的中等圆形。中间的盒子里有一个黑色的中等正方形和一个黑色的小圆形。右边的盒子里有一个蓝色的中等圆形、一个蓝色的大三角形和一个蓝色的大正方形。如何将所有蓝色物品移动到右边的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的大正方形，一个蓝色的中等圆形，一个黑色的小正方形，一个黑色的中等三角形，一个蓝色的中等三角形。在中间的盒子里，有一个黄色的中等圆形，一个蓝色的大三角形，一个黄色的中等正方形，一个黑色的小正方形。在右边的盒子里，有一个蓝色的中等三角形，一个黄色的中等圆形，一个蓝色的中等正方形，一个黑色的中等三角形。如何将所有蓝色物品移到左边的盒子中？", "label": [["blue", "triangle", "middle", "right"], ["blue", "square", "middle", "right"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小黑正方形、一个小黑圆形、一个蓝色中等三角形和一个黑色中等正方形。中间的盒子里有一个蓝色中等正方形和一个大黄色圆形。右边的盒子里有一个蓝色大圆形、一个黄色中等三角形、一个黑色中等正方形、一个黄色中等三角形和一个蓝色中等三角形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"], ["yellow", "triangle", "middle", "right"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个蓝色中等三角形和一个大黄色三角形。中间的盒子里有一个黑色中等三角形和一个黑色大三角形。右边的盒子里有一个黄色中等正方形、一个黑色中等三角形、一个蓝色中等三角形、一个小黄色正方形和一个小黑色三角形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的大正方形，一个黑色的中等正方形，一个黄色的中等三角形，一个黑色的中等正方形，一个蓝色的小三角形。在中间的盒子里，有一个黑色的小正方形，一个黑色的大圆形，一个黑色的大正方形，一个蓝色的中等圆形，一个黑色的大圆形。在右边的盒子里，有一个黑色的大圆形，一个黄色的大圆形，一个黑色的大正方形，一个蓝色的中等三角形，一个黄色的中等圆形，一个黑色的小三角形。如何将所有的三角形移到左边的盒子里？", "label": [["blue", "triangle", "middle", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个蓝色的大圆形、一个蓝色的大圆形、一个黑色的中等正方形、一个黄色的小正方形、一个黄色的中等三角形。在中间的盒子里，有一个黄色的小正方形、一个黄色的大正方形、一个黄色的大圆形、一个黄色的小圆形、一个黄色的小三角形。在右边的盒子里，有一个黄色的小三角形、一个黄色的小圆形、一个黄色的小圆形。如何将所有正方形移动到左边的盒子里？", "label": [["yellow", "square", "small", "middle"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形，一个黄色的中等圆形。中间的盒子里有一个黄色的小正方形，一个蓝色的中等圆形，一个黑色的大正方形，一个蓝色的大三角形，一个黄色的小圆形。右边的盒子里有一个蓝色的大三角形，一个蓝色的中等圆形，一个黄色的中等三角形。如何将所有蓝色物品移动到右边的盒子？", "label": [["blue", "triangle", "middle", "left"], ["blue", "round", "middle", "middle"], ["blue", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的大三角形，一个黄色的小正方形，一个蓝色的中等正方形，一个黑色的中等圆形。中间的盒子里有一个黑色的小正方形，一个黑色的中等圆形，一个黄色的大圆形，一个蓝色的小圆形。右边的盒子里有一个黄色的大三角形，一个黑色的中等正方形。如何将所有正方形移动到中间的盒子中？", "label": [["yellow", "square", "small", "left"], ["blue", "square", "middle", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个蓝色的大圆形，一个黑色的大三角形，一个黑色的中等正方形，一个蓝色的中等正方形。在中间的盒子里，有一个黑色的中等正方形，一个蓝色的大圆形，一个黄色的大圆形，一个黑色的大三角形，一个黄色的中等正方形，一个蓝色的大正方形。在右边的盒子里，有一个黄色的中等正方形，一个黑色的大圆形，一个黄色的中等三角形，一个黄色的中等三角形。如何将所有的圆形移到右边的盒子里？", "label": [["blue", "round", "large", "left"], ["blue", "round", "large", "middle"], ["yellow", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形和一个黑色的大号圆形。中间的盒子里有一个黄色的大号正方形、一个黄色的中号圆形、一个蓝色的大号圆形、一个蓝色的小号三角形、一个黑色的中号正方形和一个黑色的小号正方形。右边的盒子里有一个蓝色的大号圆形、一个蓝色的小号三角形、一个蓝色的小号正方形和一个黄色的大号三角形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小正方形和一个黑色的大圆形。在中间的盒子里，有一个黑色的小正方形、一个黑色的大圆形、一个黑色的小正方形、一个黄色的中等正方形和一个黑色的中等正方形。在右边的盒子里，有一个黄色的中等圆形、一个黑色的中等三角形、一个黄色的大圆形、一个蓝色的中等正方形、一个黄色的大圆形和一个黑色的中等圆形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "right"], ["yellow", "round", "large", "right"], ["yellow", "round", "large", "right"], ["black", "round", "middle", "right"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等圆形，一个黄色的大三角形。中间的盒子里有一个蓝色的大三角形，一个黄色的小正方形，一个蓝色的小圆形。右边的盒子里有一个蓝色的小正方形，一个蓝色的大三角形，一个黑色的大正方形，一个蓝色的大圆形，一个蓝色的大三角形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的小三角形、一个黑色的大三角形、一个蓝色的中等圆形、一个黑色的小三角形、一个蓝色的小三角形、一个黄色的大圆形。中间的盒子里有一个黄色的中等圆形、一个蓝色的中等正方形。右边的盒子里有一个黑色的中等正方形、一个黑色的大三角形、一个黑色的中等三角形、一个蓝色的小正方形。如何将所有的正方形移到中间的盒子里？", "label": [["black", "square", "middle", "right"], ["blue", "square", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黄色的中等正方形，一个黑色的小三角形。在中间的盒子里，有一个蓝色的中等三角形，一个黑色的中等圆形，一个蓝色的小三角形，一个黑色的中等三角形，一个蓝色的小三角形，一个黄色的小圆形。在右边的盒子里，有一个蓝色的大圆形，一个黑色的大圆形，一个蓝色的小三角形，一个黑色的小正方形，一个黄色的大正方形，一个蓝色的大圆形。如何将所有的圆形移到右边的盒子里？", "label": [["black", "round", "middle", "middle"], ["yellow", "round", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的小三角形，一个蓝色的大圆形，一个黄色的大三角形，一个黄色的小正方形。在中间的盒子里，有一个黑色的小三角形，一个蓝色的小三角形，一个蓝色的中等三角形，一个黄色的大圆形，一个蓝色的中等正方形。在右边的盒子里，有一个蓝色的小三角形，一个黄色的中等圆形，一个黄色的中等三角形，一个黑色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["blue", "triangle", "small", "left"], ["yellow", "triangle", "large", "left"], ["blue", "triangle", "small", "right"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等正方形，一个黑色的大圆形，一个蓝色的大正方形，一个黄色的大三角形，一个黄色的中等圆形，一个黑色的中等三角形。在中间的盒子里，有一个黄色的中等正方形，一个黑色的小圆形，一个黄色的中等圆形，一个蓝色的小正方形。在右边的盒子里，有一个蓝色的大正方形，一个黄色的中等圆形，一个黑色的小正方形，一个黄色的中等三角形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "large", "left"], ["black", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的中等三角形，一个蓝色的大圆形，一个黑色的中等正方形，一个蓝色的大圆形，一个黑色的小三角形。在中间的盒子里，有一个黄色的小正方形，一个黑色的大圆形。在右边的盒子里，有一个蓝色的大圆形，一个黑色的中等圆形，一个蓝色的大三角形，一个黑色的大正方形。如何将所有黄色物品移动到中间的盒子？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个蓝色的中等三角形，一个黑色的大正方形。在中间的盒子里，有一个黄色的大正方形，一个黄色的小三角形，一个黄色的大圆形，一个蓝色的小三角形，一个黄色的中等圆形。在右边的盒子里，有一个蓝色的中等正方形，一个黑色的中等圆形，一个黄色的大三角形，一个黄色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "middle", "right"], ["yellow", "square", "small", "right"], ["yellow", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个大黑圆形，一个大黑三角形，一个中等黑圆形。在中间的盒子里，有一个蓝色的大圆形，一个黄色的中等正方形，一个蓝色的中等三角形，一个小黑色正方形，一个大黑三角形，一个中等黑三角形。在右边的盒子里，有一个黄色的中等圆形，一个蓝色的中等三角形，一个蓝色的小正方形，一个黑色的小正方形，一个中等黑三角形。如何将所有正方形移动到右边的盒子中？", "label": [["yellow", "square", "middle", "middle"], ["black", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个黄色的大正方形、一个蓝色的小三角形、一个黄色的大圆形和一个黑色的大圆形。中间的盒子里有一个黑色的中等大小的圆形、一个蓝色的大三角形和一个黄色的中等大小的圆形。右边的盒子里有一个黑色的大三角形、一个黑色的大三角形和一个黑色的小圆形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "small", "right"], ["black", "round", "middle", "middle"], ["yellow", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个小黄三角形、一个蓝色中圆形、一个大黄三角形和一个小黑圆形。中间的盒子里有一个黑色中正方形、一个小黄正方形、一个蓝色中正方形、一个大蓝三角形和一个大黄三角形。右边的盒子里有一个蓝色中正方形和一个小黄三角形。如何将所有黑色物品移到右边的盒子？", "label": [["black", "round", "small", "left"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形、一个黄色的中等正方形、一个黑色的大正方形、一个蓝色的中等正方形。中间的盒子里有一个黑色的中等正方形、一个蓝色的中等正方形、一个黄色的中等正方形。右边的盒子里有一个蓝色的大三角形、一个黑色的小三角形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "middle", "middle"], ["blue", "square", "middle", "middle"], ["yellow", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等正方形、一个黄色的中等圆形、一个蓝色的小三角形、一个蓝色的中等正方形。中间的盒子里有一个黑色的大正方形、一个黑色的小三角形、一个黄色的中等正方形、一个蓝色的小圆形、一个蓝色的中等正方形。右边的盒子里有一个黄色的大正方形、一个蓝色的大三角形、一个黄色的大三角形。如何将所有正方形移到左边的盒子里？", "label": [["yellow", "square", "large", "right"], ["black", "square", "large", "middle"], ["yellow", "square", "middle", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大圆形、一个黄色的大正方形、一个黑色的中等正方形、一个蓝色的大圆形。在中间的盒子里，有一个黑色的中等圆形、一个蓝色的大圆形、一个黑色的小圆形、一个黑色的大三角形、一个黑色的中等圆形、一个黑色的大圆形。在右边的盒子里，有一个黑色的小三角形、一个黑色的大三角形、一个黄色的小三角形、一个黄色的大三角形。如何将所有黑色物品移动到左边的盒子里？", "label": [["black", "triangle", "small", "right"], ["black", "triangle", "large", "right"], ["black", "round", "middle", "middle"], ["black", "round", "small", "middle"], ["black", "triangle", "large", "middle"], ["black", "round", "middle", "middle"], ["black", "round", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄圆形、一个小黄色正方形、一个蓝色中等正方形、一个大蓝色圆形、一个黄色中等三角形、一个小黑色三角形。在中间的盒子里，有一个黄色中等三角形、一个蓝色小正方形、一个蓝色小圆形、一个小黄色圆形、一个蓝色中等三角形、一个大蓝色正方形。在右边的盒子里，有一个大黄色圆形、一个蓝色小圆形、一个大蓝色三角形、一个黄色中等正方形。如何将所有正方形移动到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["blue", "square", "middle", "left"], ["blue", "square", "small", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等圆形，一个蓝色的大三角形，一个黑色的大三角形，一个黄色的小正方形，一个蓝色的大正方形。在中间的盒子里，有一个黑色的大正方形，一个黄色的小正方形，一个黑色的小圆形，一个蓝色的小正方形，一个黄色的中等圆形。在右边的盒子里，有一个蓝色的小三角形，一个蓝色的大正方形，一个黑色的大三角形，一个蓝色的中等三角形，一个黄色的小正方形。如何将所有正方形移动到左边的盒子中？", "label": [["blue", "square", "large", "right"], ["yellow", "square", "small", "right"], ["black", "square", "large", "middle"], ["yellow", "square", "small", "middle"], ["blue", "square", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形、一个黄色的中号三角形、一个蓝色的中号圆形、一个蓝色的中号正方形和一个黑色的大正方形。中间的盒子里有一个蓝色的中号圆形、一个黑色的小三角形和一个黄色的大正方形。右边的盒子里有一个黄色的中号圆形和一个蓝色的中号正方形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "triangle", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆形、一个黑色中等正方形、一个大黄三角形、一个蓝色大正方形、一个蓝色小正方形。中间的盒子里有一个黑色中等三角形、一个蓝色中等圆形。右边的盒子里有一个黄色大三角形、一个蓝色大三角形、一个蓝色中等圆形、一个蓝色小三角形、一个黑色小正方形。如何将所有三角形移到左边的盒子里？", "label": [["yellow", "triangle", "large", "right"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "small", "right"], ["black", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形、一个蓝色的中等圆形、一个黄色的大三角形和一个黄色的大圆形。中间的盒子里有一个蓝色的中等圆形、一个黄色的中等正方形、一个黑色的中等三角形和一个蓝色的中等正方形。右边的盒子里有一个黑色的大圆形、一个黄色的中等正方形和一个蓝色的中等三角形。如何将所有的正方形移到右边的盒子里？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "middle", "middle"], ["blue", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的小正方形，一个蓝色的中等正方形，一个黄色的大三角形，一个黄色的小正方形。中间的盒子里有一个黄色的小正方形，一个黑色的小三角形，一个黄色的小正方形，一个黄色的小三角形，一个蓝色的小圆形。右边的盒子里有一个黄色的大三角形，一个黄色的小圆形。如何将所有黄色物品移动到右边的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "triangle", "large", "left"], ["yellow", "square", "small", "left"], ["yellow", "square", "small", "middle"], ["yellow", "square", "small", "middle"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个黑色的小圆形，一个黄色的中等圆形，一个黄色的中等圆形。在中间的盒子里，有一个黑色的中等圆形，一个蓝色的小正方形，一个黑色的大三角形，一个黑色的小圆形，一个蓝色的中等正方形。在右边的盒子里，有一个黑色的大圆形，一个蓝色的小正方形，一个黄色的小正方形，一个蓝色的大三角形，一个蓝色的中等三角形，一个黄色的小正方形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["blue", "triangle", "large", "right"], ["blue", "triangle", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等三角形，一个黄色的中等三角形和一个蓝色的中等圆形。中间的盒子里有一个黄色的中等三角形，一个大黄色三角形和一个大蓝色正方形。右边的盒子里有一个蓝色的大三角形和一个蓝色的大三角形。如何将所有黄色物体移动到右边的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "middle"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的中圆形和一个黑色的中圆形。中间的盒子里有一个蓝色的大三角形、一个黑色的大三角形和一个黄色的大正方形。右边的盒子里有一个黄色的中正方形、一个黄色的小圆形、一个黑色的大正方形、一个蓝色的大圆形、一个黑色的大圆形和一个蓝色的小正方形。如何将所有的三角形移到右边的盒子里？", "label": [["blue", "triangle", "large", "middle"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形，一个中蓝色圆形。中间的盒子里有一个中黄色圆形，一个大蓝色正方形，一个大黄色正方形，一个小黑色正方形。右边的盒子里有一个大蓝色三角形，一个大黄色三角形，一个中黄色正方形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "triangle", "large", "right"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的中号圆形、一个黑色的小圆形、一个黑色的小圆形、一个蓝色的大三角形、一个黄色的小正方形、一个黄色的小正方形。中间的盒子里有一个黑色的小三角形、一个黑色的中号圆形、一个蓝色的大三角形、一个黑色的大正方形。右边的盒子里有一个黄色的大三角形、一个黑色的中号圆形、两个黑色的小三角形、一个蓝色的小三角形、一个蓝色的中号圆形。如何将所有的圆形移到中间的盒子里？", "label": [["black", "round", "middle", "left"], ["black", "round", "small", "left"], ["black", "round", "small", "left"], ["black", "round", "middle", "right"], ["blue", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个蓝色的小正方形，一个黑色的小正方形，一个黑色的小圆形，一个黄色的中等三角形，一个黑色的大正方形。在中间的盒子里，有一个蓝色的大圆形，一个黄色的小三角形。在右边的盒子里，有一个黑色的小正方形，一个蓝色的小三角形，一个黑色的小三角形，一个蓝色的中等三角形，一个蓝色的小三角形，一个蓝色的中等三角形。如何将所有黑色物品移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄色圆形、一个黑色中等三角形、一个黄色中等三角形、一个蓝色大圆形。中间的盒子里有一个黑色小三角形、一个黑色中等三角形、一个黄色中等三角形、一个黑色大三角形。右边的盒子里有一个黄色大三角形、一个蓝色中等正方形、一个黄色中等三角形、一个蓝色大圆形、一个黑色小三角形、一个蓝色大正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "middle", "left"], ["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄色正方形，一个大黄色正方形，一个蓝色中等大小的正方形，一个蓝色中等大小的正方形，一个黑色大圆形。在中间的盒子里，有一个蓝色大圆形，一个蓝色中等大小的正方形，一个黑色中等大小的正方形，一个黑色大三角形。在右边的盒子里，有一个黑色中等大小的正方形，一个蓝色中等大小的正方形，一个蓝色中等大小的正方形，一个大黄色正方形，一个黑色中等大小的正方形，一个大黄色正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "small", "left"], ["yellow", "square", "large", "left"], ["yellow", "square", "large", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的小三角形、一个黑色的大正方形和一个黑色的小圆形。中间的盒子里有一个蓝色的大正方形、一个蓝色的小正方形、一个黑色的小三角形、一个蓝色的大正方形和一个黄色的大三角形。右边的盒子里有一个蓝色的中等大小的圆形、一个黄色的小正方形、一个黑色的大圆形和一个黄色的大正方形。如何将所有蓝色物品移到右边的盒子中？", "label": [["blue", "triangle", "small", "left"], ["blue", "square", "large", "middle"], ["blue", "square", "small", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的小三角形，一个蓝色的大圆形，一个蓝色的大圆形，一个黑色的小三角形，一个蓝色的大正方形。在中间的盒子里，有一个蓝色的大三角形，一个黑色的小正方形，一个蓝色的中圆形。在右边的盒子里，有一个黄色的小三角形，一个蓝色的小圆形，一个黄色的小圆形，一个黑色的中正方形，一个蓝色的中三角形。如何将所有蓝色物品移动到左边的盒子中？", "label": [["blue", "round", "small", "right"], ["blue", "triangle", "middle", "right"], ["blue", "triangle", "large", "middle"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黄圆、一个中蓝圆、一个小黑方、一个小黑方。中间的盒子里有一个小黄圆、一个中蓝圆。右边的盒子里有一个小蓝圆、一个小蓝方、一个中蓝方。如何将所有圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "left"], ["blue", "round", "middle", "left"], ["blue", "round", "small", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大三角形，一个黄色的中圆形，一个蓝色的小三角形，一个黄色的大三角形，一个蓝色的小正方形。在中间的盒子里，有一个黄色的中圆形，一个黄色的中圆形，一个黑色的中圆形，一个黑色的中三角形，一个蓝色的小圆形。在右边的盒子里，有一个蓝色的中三角形，一个黄色的中正方形。如何将所有的圆形移到左边的盒子里？", "label": [["yellow", "round", "middle", "middle"], ["yellow", "round", "middle", "middle"], ["black", "round", "middle", "middle"], ["blue", "round", "small", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个黄色的小三角形和一个黄色的中等正方形。中间的盒子里有一个黑色的小正方形、一个黑色的中等圆形、一个黄色的中等三角形、一个黄色的大圆形、一个黑色的大正方形和一个黑色的大三角形。右边的盒子里有一个黄色的中等三角形、一个黄色的大正方形、一个黑色的中等三角形、一个蓝色的大三角形和一个黄色的小圆形。如何将所有的三角形移到中间的盒子里？", "label": [["yellow", "triangle", "small", "left"], ["yellow", "triangle", "middle", "right"], ["black", "triangle", "middle", "right"], ["blue", "triangle", "large", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个小黄三角形，一个中黄三角形，一个中黄三角形，一个中黄正方形，一个小黑三角形，一个小蓝圆形。在中间的盒子里，有一个大黑三角形，一个大黑圆形，一个大黑正方形，一个中蓝圆形，一个小黄圆形。在右边的盒子里，有一个小黑圆形，一个小黑正方形，一个中黑圆形。如何将所有正方形移动到左边的盒子中？", "label": [["black", "square", "small", "right"], ["black", "square", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大正方形，一个黑色的中等正方形，一个黑色的中等正方形，一个黄色的大三角形，一个黄色的中等三角形，一个黄色的小三角形。在中间的盒子里，有一个黑色的中等正方形，一个蓝色的小正方形，一个黄色的小正方形，一个黄色的中等圆形，一个蓝色的大圆形。在右边的盒子里，有一个黄色的中等三角形，一个黑色的中等圆形，一个黄色的中等三角形。如何将所有黑色物体移动到左边的盒子中？", "label": [["black", "round", "middle", "right"], ["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形和一个黄色的大圆形。中间的盒子里有一个蓝色的中等大小的正方形、一个黄色的小圆形、一个黑色的大圆形、一个蓝色的小圆形和一个黄色的中等大小的圆形。右边的盒子里有一个黄色的大圆形、一个蓝色的大圆形和一个黑色的大圆形。如何将所有正方形移动到中间的盒子中？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个黄色的中间正方形，一个蓝色的小正方形，一个黑色的中间三角形。在中间的盒子里，有一个蓝色的大圆形，一个黄色的小三角形，一个蓝色的大正方形。在右边的盒子里，有一个黑色的大正方形，一个黑色的小三角形，一个黑色的中间三角形，一个黄色的大正方形，一个黑色的大正方形，一个黑色的小三角形。如何将所有蓝色物品移动到右边的盒子中？", "label": [["blue", "square", "small", "left"], ["blue", "round", "large", "middle"], ["blue", "square", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大三角形、一个黄色的中等正方形、一个黄色的大圆形。中间的盒子里有一个蓝色的小圆形、一个黄色的小三角形、一个黄色的中等正方形、一个蓝色的小三角形、一个黄色的大三角形、一个黑色的大正方形。右边的盒子里有一个黑色的中等圆形、一个黑色的小正方形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "square", "middle", "left"], ["yellow", "round", "large", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等圆形、一个蓝色的大正方形、一个黑色的大三角形、一个黑色的大圆形和一个蓝色的小正方形。中间的盒子里有一个蓝色的小圆形、一个蓝色的小正方形、一个黄色的大正方形、一个蓝色的大三角形和一个黄色的中等三角形。右边的盒子里有一个黄色的小正方形和一个黑色的大圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中等三角形，一个黄色的中等正方形，一个蓝色的大圆形，一个黑色的小正方形，一个黄色的小三角形，一个黑色的大三角形。在中间的盒子里，有一个黑色的中等三角形，一个黑色的中等正方形。在右边的盒子里，有一个黑色的中等三角形，一个黑色的中等正方形，一个黑色的大三角形，一个黑色的小正方形，一个蓝色的大圆形，一个蓝色的中等圆形。如何将所有正方形移动到中间的盒子里？", "label": [["yellow", "square", "middle", "left"], ["black", "square", "small", "left"], ["black", "square", "middle", "right"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的大圆形、一个蓝色的小正方形、一个蓝色的小三角形和一个黄色的大三角形。中间的盒子里有一个蓝色的大三角形、一个蓝色的中等大小的圆形、一个黑色的中等大小的正方形。右边的盒子里有一个黑色的大圆形、一个黄色的小圆形、一个黄色的中等大小的三角形、一个黄色的小正方形和一个黄色的中等大小的三角形。如何将所有黑色物品移到右边的盒子中？", "label": [["black", "square", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个蓝色的中等三角形、一个黑色的中等正方形和一个黑色的大正方形。中间的盒子里有一个蓝色的小圆形、一个黑色的小正方形、一个黄色的小正方形和一个蓝色的大三角形。右边的盒子里有一个黄色的大正方形、一个蓝色的中等正方形、一个蓝色的大三角形、一个黑色的大正方形和一个黑色的大三角形。如何将所有的圆形移到中间的盒子里？", "label": []}, {"data": "有三个盒子。在左边的盒子里，有一个小黑色正方形，一个大黑色正方形，一个蓝色大圆形，一个大黑色三角形。在中间的盒子里，有一个黄色中等大小的三角形，一个黄色大正方形，一个黄色小圆形，一个蓝色小圆形。在右边的盒子里，有一个黑色大圆形，一个蓝色小正方形，一个黄色大三角形，一个黄色小三角形，一个蓝色中等大小的正方形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "square", "small", "left"], ["black", "square", "large", "left"], ["black", "triangle", "large", "left"], ["black", "round", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的大正方形和一个蓝色的小正方形。中间的盒子里有一个黑色的中等大小的圆形和一个黑色的大圆形。右边的盒子里有一个蓝色的大圆形、一个黄色的中等大小的三角形、一个黑色的小正方形、一个黄色的小三角形和两个黑色的小正方形。如何将所有的正方形移到左边的盒子里？", "label": [["black", "square", "small", "right"], ["black", "square", "small", "right"], ["black", "square", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的小三角形、一个黄色的小正方形、一个黄色的中号圆形和一个黄色的小圆形。中间的盒子里有一个黑色的中号正方形、一个黑色的小圆形和一个蓝色的大正方形。右边的盒子里有一个黑色的中号正方形和一个蓝色的大三角形。如何将所有黑色物品移动到中间的盒子？", "label": [["black", "triangle", "large", "left"], ["black", "square", "middle", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形、一个黑色的中等三角形、一个黄色的小圆形、一个黑色的小正方形和一个黄色的小圆形。中间的盒子里有一个蓝色的中等三角形、一个黄色的中等圆形和一个黄色的小三角形。右边的盒子里有一个黑色的中等三角形、一个黑色的中等正方形和一个黑色的大三角形。如何将所有黄色物品移动到中间的盒子？", "label": [["yellow", "round", "small", "left"], ["yellow", "round", "small", "left"]]}, {"data": "有三个盒子。在左边的盒子里，有一个蓝色的大圆形，一个黑色的小圆形，一个蓝色的大三角形，一个蓝色的小三角形，一个蓝色的大正方形，一个黄色的中等三角形。在中间的盒子里，有一个黄色的小圆形，一个黄色的中等三角形，一个蓝色的中等正方形，一个蓝色的中等三角形。在右边的盒子里，有一个黑色的中等正方形，一个蓝色的大正方形，一个黄色的大正方形。如何将所有黄色物品移动到右边的盒子中？", "label": [["yellow", "triangle", "middle", "left"], ["yellow", "round", "small", "middle"], ["yellow", "triangle", "middle", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中等大小的正方形，一个黄色的大圆形。中间的盒子里有一个蓝色的大圆形，一个黑色的大正方形，一个黑色的小正方形，一个黄色的中等大小的正方形，一个黑色的大圆形。右边的盒子里有一个黑色的小三角形，一个黄色的中等大小的圆形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "small", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大三角形、一个黄色的中等三角形、一个黄色的中等圆形和一个黄色的中等三角形。中间的盒子里有一个黑色的中等正方形、一个蓝色的小圆形和一个黄色的小正方形。右边的盒子里有一个蓝色的中等正方形、一个蓝色的大正方形、一个蓝色的中等正方形、一个黄色的大三角形、一个蓝色的小圆形和一个黑色的大正方形。如何将所有的三角形移到中间的盒子里？", "label": [["black", "triangle", "large", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "middle", "left"], ["yellow", "triangle", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黄色的中号圆形、一个黄色的大正方形、一个蓝色的小正方形和一个蓝色的中号三角形。中间的盒子里有一个黑色的大正方形、一个黑色的大圆形、一个蓝色的大三角形和一个黄色的大三角形。右边的盒子里有一个黑色的大正方形、一个蓝色的大正方形、一个黑色的中号圆形、一个黄色的大圆形和一个黑色的小三角形。如何将所有黄色物品移到右边的盒子？", "label": [["yellow", "round", "middle", "left"], ["yellow", "square", "large", "left"], ["yellow", "triangle", "large", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的中等正方形，一个黄色的小圆形，一个黄色的中等三角形，一个黑色的大圆形。在中间的盒子里，有一个黑色的中等圆形，一个黑色的小圆形，一个黄色的中等正方形。在右边的盒子里，有一个蓝色的小圆形，一个蓝色的中等正方形，一个黄色的小圆形，一个蓝色的中等正方形，一个黄色的小圆形，一个黑色的中等圆形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "small", "left"], ["black", "round", "large", "left"], ["blue", "round", "small", "right"], ["yellow", "round", "small", "right"], ["yellow", "round", "small", "right"], ["black", "round", "middle", "right"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的中间正方形，一个蓝色的中间三角形，一个黑色的中间圆形，一个蓝色的中间正方形，一个黄色的小三角形。在中间的盒子里，有一个黄色的小三角形，一个蓝色的大圆形，一个黄色的大正方形，一个黑色的小圆形，一个黄色的中间圆形。在右边的盒子里，有一个黄色的中间圆形，一个黄色的大圆形，一个黄色的中间三角形，一个黄色的小正方形，一个蓝色的大圆形。如何将所有的三角形移到左边的盒子里？", "label": [["yellow", "triangle", "middle", "right"], ["yellow", "triangle", "small", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黄色的大正方形，一个黑色的中等正方形，一个蓝色的小圆形，一个蓝色的小圆形，一个黑色的小三角形，一个黑色的大圆形。在中间的盒子里，有一个黄色的中等正方形，一个黄色的大三角形，一个黑色的大三角形。在右边的盒子里，有一个蓝色的中等三角形，一个黄色的小三角形，一个黄色的小三角形，一个黄色的中等三角形，一个黄色的大正方形。如何将所有黑色物品移动到右边的盒子中？", "label": [["black", "square", "middle", "left"], ["black", "triangle", "small", "left"], ["black", "round", "large", "left"], ["black", "triangle", "large", "middle"]]}, {"data": "有三个盒子。左边的盒子里有一个小黑色圆形，一个中等大小的黑色三角形。中间的盒子里有一个小黄色正方形，一个蓝色的中等大小的圆形，一个蓝色的大正方形，一个黄色的中等大小的三角形。右边的盒子里有一个黑色的大正方形，两个小黑色三角形，一个黑色的中等大小的圆形，一个黄色的大圆形。如何将所有的圆形移到左边的盒子里？", "label": [["black", "round", "middle", "right"], ["yellow", "round", "large", "right"], ["blue", "round", "middle", "middle"]]}, {"data": "有三个盒子。在左边的盒子里，有一个黑色的大三角形，一个蓝色的小正方形，一个黄色的小圆形，一个黑色的大三角形，一个黄色的中等三角形，一个黄色的中等正方形。在中间的盒子里，有一个黄色的小正方形，一个黑色的大三角形，一个黑色的小三角形，一个黄色的中等圆形。在右边的盒子里，有一个蓝色的大正方形，一个蓝色的小三角形，一个黄色的小圆形，一个黄色的大正方形，一个蓝色的小圆形，一个黑色的中等圆形。如何将所有正方形移动到中间的盒子？", "label": [["blue", "square", "small", "left"], ["yellow", "square", "middle", "left"], ["blue", "square", "large", "right"], ["yellow", "square", "large", "right"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大圆形，一个蓝色的中圆形，一个黄色的小三角形，一个黄色的中圆形。中间的盒子里有一个黄色的小正方形，一个黄色的小圆形，一个蓝色的小圆形，一个蓝色的小三角形。右边的盒子里有一个黄色的小三角形，一个黄色的大正方形。如何将所有蓝色物品移动到中间的盒子？", "label": [["blue", "round", "middle", "left"]]}, {"data": "有三个盒子。左边的盒子里有一个黑色的大正方形、一个黑色的小正方形、一个黄色的大圆形、一个蓝色的中等大小的正方形。中间的盒子里有一个黄色的大圆形、一个黑色的大正方形。右边的盒子里有一个黄色的中等大小的三角形、一个黄色的小正方形、一个黄色的大三角形。如何将所有的圆形移到中间的盒子里？", "label": [["yellow", "round", "large", "left"]]}]